NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* TASKS_XO24MSTART @Bit 0 : Request HFXO to provide a crystal clock for PCLK24M */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Pos (0UL) /*!< Position of TASKS_XO24MSTART field.                           */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Msk (0x1UL << CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Pos) /*!< Bit mask of
                                                                            TASKS_XO24MSTART field.*/
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_XO24MSTART field.             */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_XO24MSTART field.             */
  #define CLOCK_TASKS_XO24MSTART_TASKS_XO24MSTART_Trigger (0x1UL) /*!< Trigger task                                            */


/* CLOCK_TASKS_XO24MSTOP: Stop request HFXO for PCLK24M. When all requests for HFXO are stopped, HFXO will also stop. */
  #define CLOCK_TASKS_XO24MSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XO24MSTOP register.                        */

/* TASKS_XO24MSTOP @Bit 0 : Stop request HFXO for PCLK24M. When all requests for HFXO are stopped, HFXO will also stop. */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Pos (0UL) /*!< Position of TASKS_XO24MSTOP field.                              */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Msk (0x1UL << CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Pos) /*!< Bit mask of
                                                                            TASKS_XO24MSTOP field.*/
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_XO24MSTOP field.                */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_XO24MSTOP field.                */
  #define CLOCK_TASKS_XO24MSTOP_TASKS_XO24MSTOP_Trigger (0x1UL) /*!< Trigger task                                              */


/* CLOCK_TASKS_AUXPLLSTART: Start AUXPLL audio / USB clock source */
  #define CLOCK_TASKS_AUXPLLSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_AUXPLLSTART register.                    */

/* TASKS_AUXPLLSTART @Bit 0 : Start AUXPLL audio / USB clock source */
  #define CLOCK_TASKS_AUXPLLSTART_TASKS_AUXPLLSTART_Pos (0UL) /*!< Position of TASKS_AUXPLLSTART field.                        */
  #define CLOCK_TASKS_AUXPLLSTART_TASKS_AUXPLLSTART_Msk (0x1UL << CLOCK_TASKS_AUXPLLSTART_TASKS_AUXPLLSTART_Pos) /*!< Bit mask
                                                                            of TASKS_AUXPLLSTART field.*/
  #define CLOCK_TASKS_AUXPLLSTART_TASKS_AUXPLLSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_AUXPLLSTART field.          */
  #define CLOCK_TASKS_AUXPLLSTART_TASKS_AUXPLLSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_AUXPLLSTART field.          */
  #define CLOCK_TASKS_AUXPLLSTART_TASKS_AUXPLLSTART_Trigger (0x1UL) /*!< Trigger task                                          */


/* CLOCK_TASKS_AUXPLLSTOP: Stop AUXPLL audio / USB clock source */
  #define CLOCK_TASKS_AUXPLLSTOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_AUXPLLSTOP register.                      */

/* TASKS_AUXPLLSTOP @Bit 0 : Stop AUXPLL audio / USB clock source */
  #define CLOCK_TASKS_AUXPLLSTOP_TASKS_AUXPLLSTOP_Pos (0UL) /*!< Position of TASKS_AUXPLLSTOP field.                           */
  #define CLOCK_TASKS_AUXPLLSTOP_TASKS_AUXPLLSTOP_Msk (0x1UL << CLOCK_TASKS_AUXPLLSTOP_TASKS_AUXPLLSTOP_Pos) /*!< Bit mask of
                                                                            TASKS_AUXPLLSTOP field.*/
  #define CLOCK_TASKS_AUXPLLSTOP_TASKS_AUXPLLSTOP_Min (0x1UL) /*!< Min enumerator value of TASKS_AUXPLLSTOP field.             */
  #define CLOCK_TASKS_AUXPLLSTOP_TASKS_AUXPLLSTOP_Max (0x1UL) /*!< Max enumerator value of TASKS_AUXPLLSTOP field.             */
  #define CLOCK_TASKS_AUXPLLSTOP_TASKS_AUXPLLSTOP_Trigger (0x1UL) /*!< Trigger task                                            */


/* CLOCK_SUBSCRIBE_XOSTART: Subscribe configuration for task XOSTART */
  #define CLOCK_SUBSCRIBE_XOSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XOSTART register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task XOSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XOSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_XOSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XOSTART_EN_Pos) /*!< Bit mask of EN field.                  */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define CLOCK_SUBSCRIBE_XOSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_XOSTOP: Subscribe configuration for task XOSTOP */
  #define CLOCK_SUBSCRIBE_XOSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XOSTOP register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task XOSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_XOSTOP_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XOSTOP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define CLOCK_SUBSCRIBE_XOSTOP_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_PLLSTART: Subscribe configuration for task PLLSTART */
  #define CLOCK_SUBSCRIBE_PLLSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PLLSTART register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that task PLLSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define CLOCK_SUBSCRIBE_PLLSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_PLLSTART_EN_Pos) /*!< Bit mask of EN field.                */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                               */
  #define CLOCK_SUBSCRIBE_PLLSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                                 */


/* CLOCK_SUBSCRIBE_PLLSTOP: Subscribe configuration for task PLLSTOP */
  #define CLOCK_SUBSCRIBE_PLLSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PLLSTOP register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task PLLSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_PLLSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_PLLSTOP_EN_Pos) /*!< Bit mask of EN field.                  */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define CLOCK_SUBSCRIBE_PLLSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* CLOCK_SUBSCRIBE_LFCLKSTART: Subscribe configuration for task LFCLKSTART */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_LFCLKSTART register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task LFCLKSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_LFCLKSTART_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define CLOCK_SUBSCRIBE_LFCLKSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* CLOCK_SUBSCRIBE_LFCLKSTOP: Subscribe configuration for task LFCLKSTOP */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_LFCLKSTOP register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task LFCLKSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Pos) /*!< Bit mask of EN field.              */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define CLOCK_SUBSCRIBE_LFCLKSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* CLOCK_SUBSCRIBE_XO24MSTART: Subscribe configuration for task XO24MSTART */
  #define CLOCK_SUBSCRIBE_XO24MSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XO24MSTART register.              */

/* CHIDX @Bits 0..7 : DPPI channel that task XO24MSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_SUBSCRIBE_XO24MSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XO24MSTART_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                             */
  #define CLOCK_SUBSCRIBE_XO24MSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                               */


/* CLOCK_SUBSCRIBE_XO24MSTOP: Subscribe configuration for task XO24MSTOP */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_XO24MSTOP register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task XO24MSTOP will subscribe to */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_XO24MSTOP_EN_Pos) /*!< Bit mask of EN field.              */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define CLOCK_SUBSCRIBE_XO24MSTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* CLOCK_SUBSCRIBE_AUXPLLSTART: Subscribe configuration for task AUXPLLSTART */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_AUXPLLSTART register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task AUXPLLSTART will subscribe to */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_CHIDX_Msk (0xFFUL << CLOCK_SUBSCRIBE_AUXPLLSTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_EN_Msk (0x1UL << CLOCK_SUBSCRIBE_AUXPLLSTART_EN_Pos) /*!< Bit mask of EN field.          */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define CLOCK_SUBSCRIBE_AUXPLLSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


