NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* AUXPLLSTARTED @Bit 8 : Write '1' to enable interrupt for event AUXPLLSTARTED */
  #define CLOCK_INTENSET_AUXPLLSTARTED_Pos (8UL)     /*!< Position of AUXPLLSTARTED field.                                     */
  #define CLOCK_INTENSET_AUXPLLSTARTED_Msk (0x1UL << CLOCK_INTENSET_AUXPLLSTARTED_Pos) /*!< Bit mask of AUXPLLSTARTED field.   */
  #define CLOCK_INTENSET_AUXPLLSTARTED_Min (0x0UL)   /*!< Min enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTENSET_AUXPLLSTARTED_Max (0x1UL)   /*!< Max enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTENSET_AUXPLLSTARTED_Set (0x1UL)   /*!< Enable                                                               */
  #define CLOCK_INTENSET_AUXPLLSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define CLOCK_INTENSET_AUXPLLSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* CLOCK_INTENCLR: Disable interrupt */
  #define CLOCK_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* XOSTARTED @Bit 0 : Write '1' to disable interrupt for event XOSTARTED */
  #define CLOCK_INTENCLR_XOSTARTED_Pos (0UL)         /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTENCLR_XOSTARTED_Msk (0x1UL << CLOCK_INTENCLR_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.               */
  #define CLOCK_INTENCLR_XOSTARTED_Min (0x0UL)       /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENCLR_XOSTARTED_Max (0x1UL)       /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENCLR_XOSTARTED_Clear (0x1UL)     /*!< Disable                                                              */
  #define CLOCK_INTENCLR_XOSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define CLOCK_INTENCLR_XOSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PLLSTARTED @Bit 1 : Write '1' to disable interrupt for event PLLSTARTED */
  #define CLOCK_INTENCLR_PLLSTARTED_Pos (1UL)        /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTENCLR_PLLSTARTED_Msk (0x1UL << CLOCK_INTENCLR_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.            */
  #define CLOCK_INTENCLR_PLLSTARTED_Min (0x0UL)      /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENCLR_PLLSTARTED_Max (0x1UL)      /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENCLR_PLLSTARTED_Clear (0x1UL)    /*!< Disable                                                              */
  #define CLOCK_INTENCLR_PLLSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CLOCK_INTENCLR_PLLSTARTED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LFCLKSTARTED @Bit 2 : Write '1' to disable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Pos (2UL)      /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTENCLR_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.      */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Min (0x0UL)    /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Max (0x1UL)    /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* XO24MSTARTED @Bit 7 : Write '1' to disable interrupt for event XO24MSTARTED */
  #define CLOCK_INTENCLR_XO24MSTARTED_Pos (7UL)      /*!< Position of XO24MSTARTED field.                                      */
  #define CLOCK_INTENCLR_XO24MSTARTED_Msk (0x1UL << CLOCK_INTENCLR_XO24MSTARTED_Pos) /*!< Bit mask of XO24MSTARTED field.      */
  #define CLOCK_INTENCLR_XO24MSTARTED_Min (0x0UL)    /*!< Min enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTENCLR_XO24MSTARTED_Max (0x1UL)    /*!< Max enumerator value of XO24MSTARTED field.                          */
  #define CLOCK_INTENCLR_XO24MSTARTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define CLOCK_INTENCLR_XO24MSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENCLR_XO24MSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* AUXPLLSTARTED @Bit 8 : Write '1' to disable interrupt for event AUXPLLSTARTED */
  #define CLOCK_INTENCLR_AUXPLLSTARTED_Pos (8UL)     /*!< Position of AUXPLLSTARTED field.                                     */
  #define CLOCK_INTENCLR_AUXPLLSTARTED_Msk (0x1UL << CLOCK_INTENCLR_AUXPLLSTARTED_Pos) /*!< Bit mask of AUXPLLSTARTED field.   */
  #define CLOCK_INTENCLR_AUXPLLSTARTED_Min (0x0UL)   /*!< Min enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTENCLR_AUXPLLSTARTED_Max (0x1UL)   /*!< Max enumerator value of AUXPLLSTARTED field.                         */
  #define CLOCK_INTENCLR_AUXPLLSTARTED_Clear (0x1UL) /*!< Disable                                                              */
  #define CLOCK_INTENCLR_AUXPLLSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define CLOCK_INTENCLR_AUXPLLSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


