NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* MODE1 @Bit 21 : Coexistence allowed configuration for mode [1] in client [5] */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Pos (21UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 22 : Coexistence allowed configuration for mode [2] in client [5] */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE2_Pos (22UL) /*!< Position of MODE2 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT5_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE3 @Bit 23 : Coexistence allowed configuration for mode [3] in client [5] */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE3_Pos (23UL) /*!< Position of MODE3 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT5_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT5_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT5. */

/* Field group CLIENT6 : (unspecified) */
/* MODE0 @Bit 24 : Coexistence allowed configuration for mode [0] in client [6] */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Pos (24UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 25 : Coexistence allowed configuration for mode [1] in client [6] */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Pos (25UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 26 : Coexistence allowed configuration for mode [2] in client [6] */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE2_Pos (26UL) /*!< Position of MODE2 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT6_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE3 @Bit 27 : Coexistence allowed configuration for mode [3] in client [6] */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE3_Pos (27UL) /*!< Position of MODE3 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT6_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT6_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT6. */

/* Field group CLIENT7 : (unspecified) */
/* MODE0 @Bit 28 : Coexistence allowed configuration for mode [0] in client [7] */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Pos (28UL) /*!< Position of MODE0 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Pos) /*!< Bit mask of MODE0
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Min (0x0UL) /*!< Min enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Max (0x1UL) /*!< Max enumerator value of MODE0 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE0_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE1 @Bit 29 : Coexistence allowed configuration for mode [1] in client [7] */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Pos (29UL) /*!< Position of MODE1 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Pos) /*!< Bit mask of MODE1
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Min (0x0UL) /*!< Min enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Max (0x1UL) /*!< Max enumerator value of MODE1 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE1_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* MODE2 @Bit 30 : Coexistence allowed configuration for mode [2] in client [7] */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE2_Pos (30UL) /*!< Position of MODE2 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE2_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT7_MODE2_Pos) /*!< Bit mask of MODE2
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE2_Min (0x0UL) /*!< Min enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE2_Max (0x1UL) /*!< Max enumerator value of MODE2 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE2_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE2_Allow (0x1UL) /*!< Coexistence allowed                                           */

