NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* MODE3 @Bit 31 : Coexistence allowed configuration for mode [3] in client [7] */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE3_Pos (31UL) /*!< Position of MODE3 field.                                         */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE3_Msk (0x1UL << COEXC_CCMALLOW_MODE_CLIENT7_MODE3_Pos) /*!< Bit mask of MODE3
                                                                            field.*/
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE3_Min (0x0UL) /*!< Min enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE3_Max (0x1UL) /*!< Max enumerator value of MODE3 field.                            */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE3_NotAllowed (0x0UL) /*!< Coexistence not allowed                                  */
    #define COEXC_CCMALLOW_MODE_CLIENT7_MODE3_Allow (0x1UL) /*!< Coexistence allowed                                           */

/* End field group CLIENT7. */



/* ==================================================== Struct COEXC_PSEL ==================================================== */
/**
  * @brief PSEL [COEXC_PSEL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  REQUEST;                           /*!< (@ 0x00000000) Pin select for extRequest signal                      */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Pin select for extStatus signal                       */
  __IOM uint32_t  GRANT;                             /*!< (@ 0x00000008) Pin select for extGrant signal                        */
} NRF_COEXC_PSEL_Type;                               /*!< Size = 12 (0x00C)                                                    */

/* COEXC_PSEL_REQUEST: Pin select for extRequest signal */
  #define COEXC_PSEL_REQUEST_ResetValue (0xFFFFFFFFUL) /*!< Reset value of REQUEST register.                                   */

/* PIN @Bits 0..4 : Pin number */
  #define COEXC_PSEL_REQUEST_PIN_Pos (0UL)           /*!< Position of PIN field.                                               */
  #define COEXC_PSEL_REQUEST_PIN_Msk (0x1FUL << COEXC_PSEL_REQUEST_PIN_Pos) /*!< Bit mask of PIN field.                        */
  #define COEXC_PSEL_REQUEST_PIN_Min (0x00UL)        /*!< Min value of PIN field.                                              */
  #define COEXC_PSEL_REQUEST_PIN_Max (0x1FUL)        /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define COEXC_PSEL_REQUEST_PORT_Pos (5UL)          /*!< Position of PORT field.                                              */
  #define COEXC_PSEL_REQUEST_PORT_Msk (0x7UL << COEXC_PSEL_REQUEST_PORT_Pos) /*!< Bit mask of PORT field.                      */
  #define COEXC_PSEL_REQUEST_PORT_Min (0x0UL)        /*!< Min value of PORT field.                                             */
  #define COEXC_PSEL_REQUEST_PORT_Max (0x7UL)        /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define COEXC_PSEL_REQUEST_CONNECT_Pos (31UL)      /*!< Position of CONNECT field.                                           */
  #define COEXC_PSEL_REQUEST_CONNECT_Msk (0x1UL << COEXC_PSEL_REQUEST_CONNECT_Pos) /*!< Bit mask of CONNECT field.             */
  #define COEXC_PSEL_REQUEST_CONNECT_Min (0x0UL)     /*!< Min enumerator value of CONNECT field.                               */
  #define COEXC_PSEL_REQUEST_CONNECT_Max (0x1UL)     /*!< Max enumerator value of CONNECT field.                               */
  #define COEXC_PSEL_REQUEST_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                      */
  #define COEXC_PSEL_REQUEST_CONNECT_Connected (0x0UL) /*!< Connect                                                            */


/* COEXC_PSEL_STATUS: Pin select for extStatus signal */
  #define COEXC_PSEL_STATUS_ResetValue (0xFFFFFFFFUL) /*!< Reset value of STATUS register.                                     */

/* PIN @Bits 0..4 : Pin number */
  #define COEXC_PSEL_STATUS_PIN_Pos (0UL)            /*!< Position of PIN field.                                               */
  #define COEXC_PSEL_STATUS_PIN_Msk (0x1FUL << COEXC_PSEL_STATUS_PIN_Pos) /*!< Bit mask of PIN field.                          */
  #define COEXC_PSEL_STATUS_PIN_Min (0x00UL)         /*!< Min value of PIN field.                                              */
  #define COEXC_PSEL_STATUS_PIN_Max (0x1FUL)         /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define COEXC_PSEL_STATUS_PORT_Pos (5UL)           /*!< Position of PORT field.                                              */
  #define COEXC_PSEL_STATUS_PORT_Msk (0x7UL << COEXC_PSEL_STATUS_PORT_Pos) /*!< Bit mask of PORT field.                        */
  #define COEXC_PSEL_STATUS_PORT_Min (0x0UL)         /*!< Min value of PORT field.                                             */
  #define COEXC_PSEL_STATUS_PORT_Max (0x7UL)         /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define COEXC_PSEL_STATUS_CONNECT_Pos (31UL)       /*!< Position of CONNECT field.                                           */
  #define COEXC_PSEL_STATUS_CONNECT_Msk (0x1UL << COEXC_PSEL_STATUS_CONNECT_Pos) /*!< Bit mask of CONNECT field.               */
  #define COEXC_PSEL_STATUS_CONNECT_Min (0x0UL)      /*!< Min enumerator value of CONNECT field.                               */
  #define COEXC_PSEL_STATUS_CONNECT_Max (0x1UL)      /*!< Max enumerator value of CONNECT field.                               */
  #define COEXC_PSEL_STATUS_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                       */
  #define COEXC_PSEL_STATUS_CONNECT_Connected (0x0UL) /*!< Connect                                                             */


/* COEXC_PSEL_GRANT: Pin select for extGrant signal */
  #define COEXC_PSEL_GRANT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of GRANT register.                                       */

/* PIN @Bits 0..4 : Pin number */
  #define COEXC_PSEL_GRANT_PIN_Pos (0UL)             /*!< Position of PIN field.                                               */
  #define COEXC_PSEL_GRANT_PIN_Msk (0x1FUL << COEXC_PSEL_GRANT_PIN_Pos) /*!< Bit mask of PIN field.                            */
  #define COEXC_PSEL_GRANT_PIN_Min (0x00UL)          /*!< Min value of PIN field.                                              */
  #define COEXC_PSEL_GRANT_PIN_Max (0x1FUL)          /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define COEXC_PSEL_GRANT_PORT_Pos (5UL)            /*!< Position of PORT field.                                              */
  #define COEXC_PSEL_GRANT_PORT_Msk (0x7UL << COEXC_PSEL_GRANT_PORT_Pos) /*!< Bit mask of PORT field.                          */
  #define COEXC_PSEL_GRANT_PORT_Min (0x0UL)          /*!< Min value of PORT field.                                             */
  #define COEXC_PSEL_GRANT_PORT_Max (0x7UL)          /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define COEXC_PSEL_GRANT_CONNECT_Pos (31UL)        /*!< Position of CONNECT field.                                           */
  #define COEXC_PSEL_GRANT_CONNECT_Msk (0x1UL << COEXC_PSEL_GRANT_CONNECT_Pos) /*!< Bit mask of CONNECT field.                 */
  #define COEXC_PSEL_GRANT_CONNECT_Min (0x0UL)       /*!< Min enumerator value of CONNECT field.                               */
  #define COEXC_PSEL_GRANT_CONNECT_Max (0x1UL)       /*!< Max enumerator value of CONNECT field.                               */
  #define COEXC_PSEL_GRANT_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                        */
  #define COEXC_PSEL_GRANT_CONNECT_Connected (0x0UL) /*!< Connect                                                              */


