NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* FPUIDC @Bit 5 : Write '1' to disable interrupt for event FPUIDC */
  #define CPUC_INTENCLR_FPUIDC_Pos (5UL)             /*!< Position of FPUIDC field.                                            */
  #define CPUC_INTENCLR_FPUIDC_Msk (0x1UL << CPUC_INTENCLR_FPUIDC_Pos) /*!< Bit mask of FPUIDC field.                          */
  #define CPUC_INTENCLR_FPUIDC_Min (0x0UL)           /*!< Min enumerator value of FPUIDC field.                                */
  #define CPUC_INTENCLR_FPUIDC_Max (0x1UL)           /*!< Max enumerator value of FPUIDC field.                                */
  #define CPUC_INTENCLR_FPUIDC_Clear (0x1UL)         /*!< Disable                                                              */
  #define CPUC_INTENCLR_FPUIDC_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define CPUC_INTENCLR_FPUIDC_Enabled (0x1UL)       /*!< Read: Enabled                                                        */


/* CPUC_INTPEND: Pending interrupts */
  #define CPUC_INTPEND_ResetValue (0x00000000UL)     /*!< Reset value of INTPEND register.                                     */

/* FPUIOC @Bit 0 : Read pending status of interrupt for event FPUIOC */
  #define CPUC_INTPEND_FPUIOC_Pos (0UL)              /*!< Position of FPUIOC field.                                            */
  #define CPUC_INTPEND_FPUIOC_Msk (0x1UL << CPUC_INTPEND_FPUIOC_Pos) /*!< Bit mask of FPUIOC field.                            */
  #define CPUC_INTPEND_FPUIOC_Min (0x0UL)            /*!< Min enumerator value of FPUIOC field.                                */
  #define CPUC_INTPEND_FPUIOC_Max (0x1UL)            /*!< Max enumerator value of FPUIOC field.                                */
  #define CPUC_INTPEND_FPUIOC_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define CPUC_INTPEND_FPUIOC_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* FPUDZC @Bit 1 : Read pending status of interrupt for event FPUDZC */
  #define CPUC_INTPEND_FPUDZC_Pos (1UL)              /*!< Position of FPUDZC field.                                            */
  #define CPUC_INTPEND_FPUDZC_Msk (0x1UL << CPUC_INTPEND_FPUDZC_Pos) /*!< Bit mask of FPUDZC field.                            */
  #define CPUC_INTPEND_FPUDZC_Min (0x0UL)            /*!< Min enumerator value of FPUDZC field.                                */
  #define CPUC_INTPEND_FPUDZC_Max (0x1UL)            /*!< Max enumerator value of FPUDZC field.                                */
  #define CPUC_INTPEND_FPUDZC_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define CPUC_INTPEND_FPUDZC_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* FPUOFC @Bit 2 : Read pending status of interrupt for event FPUOFC */
  #define CPUC_INTPEND_FPUOFC_Pos (2UL)              /*!< Position of FPUOFC field.                                            */
  #define CPUC_INTPEND_FPUOFC_Msk (0x1UL << CPUC_INTPEND_FPUOFC_Pos) /*!< Bit mask of FPUOFC field.                            */
  #define CPUC_INTPEND_FPUOFC_Min (0x0UL)            /*!< Min enumerator value of FPUOFC field.                                */
  #define CPUC_INTPEND_FPUOFC_Max (0x1UL)            /*!< Max enumerator value of FPUOFC field.                                */
  #define CPUC_INTPEND_FPUOFC_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define CPUC_INTPEND_FPUOFC_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* FPUUFC @Bit 3 : Read pending status of interrupt for event FPUUFC */
  #define CPUC_INTPEND_FPUUFC_Pos (3UL)              /*!< Position of FPUUFC field.                                            */
  #define CPUC_INTPEND_FPUUFC_Msk (0x1UL << CPUC_INTPEND_FPUUFC_Pos) /*!< Bit mask of FPUUFC field.                            */
  #define CPUC_INTPEND_FPUUFC_Min (0x0UL)            /*!< Min enumerator value of FPUUFC field.                                */
  #define CPUC_INTPEND_FPUUFC_Max (0x1UL)            /*!< Max enumerator value of FPUUFC field.                                */
  #define CPUC_INTPEND_FPUUFC_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define CPUC_INTPEND_FPUUFC_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* FPUIXC @Bit 4 : Read pending status of interrupt for event FPUIXC */
  #define CPUC_INTPEND_FPUIXC_Pos (4UL)              /*!< Position of FPUIXC field.                                            */
  #define CPUC_INTPEND_FPUIXC_Msk (0x1UL << CPUC_INTPEND_FPUIXC_Pos) /*!< Bit mask of FPUIXC field.                            */
  #define CPUC_INTPEND_FPUIXC_Min (0x0UL)            /*!< Min enumerator value of FPUIXC field.                                */
  #define CPUC_INTPEND_FPUIXC_Max (0x1UL)            /*!< Max enumerator value of FPUIXC field.                                */
  #define CPUC_INTPEND_FPUIXC_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define CPUC_INTPEND_FPUIXC_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* FPUIDC @Bit 5 : Read pending status of interrupt for event FPUIDC */
  #define CPUC_INTPEND_FPUIDC_Pos (5UL)              /*!< Position of FPUIDC field.                                            */
  #define CPUC_INTPEND_FPUIDC_Msk (0x1UL << CPUC_INTPEND_FPUIDC_Pos) /*!< Bit mask of FPUIDC field.                            */
  #define CPUC_INTPEND_FPUIDC_Min (0x0UL)            /*!< Min enumerator value of FPUIDC field.                                */
  #define CPUC_INTPEND_FPUIDC_Max (0x1UL)            /*!< Max enumerator value of FPUIDC field.                                */
  #define CPUC_INTPEND_FPUIDC_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define CPUC_INTPEND_FPUIDC_Pending (0x1UL)        /*!< Read: Pending                                                        */


