NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* CRYPTOMASTER @Bit 0 : Write '1' to disable interrupt for event CRYPTOMASTER */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Pos (0UL)     /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTENCLR_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.    */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Min (0x0UL)   /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Max (0x1UL)   /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Clear (0x1UL) /*!< Disable                                                              */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define CRACEN_INTENCLR_CRYPTOMASTER_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* RNG @Bit 1 : Write '1' to disable interrupt for event RNG */
  #define CRACEN_INTENCLR_RNG_Pos (1UL)              /*!< Position of RNG field.                                               */
  #define CRACEN_INTENCLR_RNG_Msk (0x1UL << CRACEN_INTENCLR_RNG_Pos) /*!< Bit mask of RNG field.                               */
  #define CRACEN_INTENCLR_RNG_Min (0x0UL)            /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Max (0x1UL)            /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTENCLR_RNG_Clear (0x1UL)          /*!< Disable                                                              */
  #define CRACEN_INTENCLR_RNG_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CRACEN_INTENCLR_RNG_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* PKEIKG @Bit 2 : Write '1' to disable interrupt for event PKEIKG */
  #define CRACEN_INTENCLR_PKEIKG_Pos (2UL)           /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTENCLR_PKEIKG_Msk (0x1UL << CRACEN_INTENCLR_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                      */
  #define CRACEN_INTENCLR_PKEIKG_Min (0x0UL)         /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENCLR_PKEIKG_Max (0x1UL)         /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTENCLR_PKEIKG_Clear (0x1UL)       /*!< Disable                                                              */
  #define CRACEN_INTENCLR_PKEIKG_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CRACEN_INTENCLR_PKEIKG_Enabled (0x1UL)     /*!< Read: Enabled                                                        */


/* CRACEN_INTPEND: Pending interrupts */
  #define CRACEN_INTPEND_ResetValue (0x00000000UL)   /*!< Reset value of INTPEND register.                                     */

/* CRYPTOMASTER @Bit 0 : Read pending status of interrupt for event CRYPTOMASTER */
  #define CRACEN_INTPEND_CRYPTOMASTER_Pos (0UL)      /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_INTPEND_CRYPTOMASTER_Msk (0x1UL << CRACEN_INTPEND_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.      */
  #define CRACEN_INTPEND_CRYPTOMASTER_Min (0x0UL)    /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTPEND_CRYPTOMASTER_Max (0x1UL)    /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_INTPEND_CRYPTOMASTER_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define CRACEN_INTPEND_CRYPTOMASTER_Pending (0x1UL) /*!< Read: Pending                                                       */

/* RNG @Bit 1 : Read pending status of interrupt for event RNG */
  #define CRACEN_INTPEND_RNG_Pos (1UL)               /*!< Position of RNG field.                                               */
  #define CRACEN_INTPEND_RNG_Msk (0x1UL << CRACEN_INTPEND_RNG_Pos) /*!< Bit mask of RNG field.                                 */
  #define CRACEN_INTPEND_RNG_Min (0x0UL)             /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_Max (0x1UL)             /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_INTPEND_RNG_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define CRACEN_INTPEND_RNG_Pending (0x1UL)         /*!< Read: Pending                                                        */

/* PKEIKG @Bit 2 : Read pending status of interrupt for event PKEIKG */
  #define CRACEN_INTPEND_PKEIKG_Pos (2UL)            /*!< Position of PKEIKG field.                                            */
  #define CRACEN_INTPEND_PKEIKG_Msk (0x1UL << CRACEN_INTPEND_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                        */
  #define CRACEN_INTPEND_PKEIKG_Min (0x0UL)          /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_INTPEND_PKEIKG_Max (0x1UL)          /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_INTPEND_PKEIKG_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define CRACEN_INTPEND_PKEIKG_Pending (0x1UL)      /*!< Read: Pending                                                        */


/* CRACEN_ENABLE: Enable CRACEN peripheral modules. */
  #define CRACEN_ENABLE_ResetValue (0x00000000UL)    /*!< Reset value of ENABLE register.                                      */

/* CRYPTOMASTER @Bit 0 : Enable cryptomaster */
  #define CRACEN_ENABLE_CRYPTOMASTER_Pos (0UL)       /*!< Position of CRYPTOMASTER field.                                      */
  #define CRACEN_ENABLE_CRYPTOMASTER_Msk (0x1UL << CRACEN_ENABLE_CRYPTOMASTER_Pos) /*!< Bit mask of CRYPTOMASTER field.        */
  #define CRACEN_ENABLE_CRYPTOMASTER_Min (0x0UL)     /*!< Min enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_ENABLE_CRYPTOMASTER_Max (0x1UL)     /*!< Max enumerator value of CRYPTOMASTER field.                          */
  #define CRACEN_ENABLE_CRYPTOMASTER_Disabled (0x0UL) /*!< Cryptomaster disabled.                                              */
  #define CRACEN_ENABLE_CRYPTOMASTER_Enabled (0x1UL) /*!< Cryptomaster enabled.                                                */

/* RNG @Bit 1 : Enable RNG */
  #define CRACEN_ENABLE_RNG_Pos (1UL)                /*!< Position of RNG field.                                               */
  #define CRACEN_ENABLE_RNG_Msk (0x1UL << CRACEN_ENABLE_RNG_Pos) /*!< Bit mask of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Min (0x0UL)              /*!< Min enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Max (0x1UL)              /*!< Max enumerator value of RNG field.                                   */
  #define CRACEN_ENABLE_RNG_Disabled (0x0UL)         /*!< RNG disabled.                                                        */
  #define CRACEN_ENABLE_RNG_Enabled (0x1UL)          /*!< RNG enabled.                                                         */

/* PKEIKG @Bit 2 : Enable PKE and IKG */
  #define CRACEN_ENABLE_PKEIKG_Pos (2UL)             /*!< Position of PKEIKG field.                                            */
  #define CRACEN_ENABLE_PKEIKG_Msk (0x1UL << CRACEN_ENABLE_PKEIKG_Pos) /*!< Bit mask of PKEIKG field.                          */
  #define CRACEN_ENABLE_PKEIKG_Min (0x0UL)           /*!< Min enumerator value of PKEIKG field.                                */
  #define CRACEN_ENABLE_PKEIKG_Max (0x1UL)           /*!< Max enumerator value of PKEIKG field.                                */
  #define CRACEN_ENABLE_PKEIKG_Disabled (0x0UL)      /*!< PKE and IKG disabled.                                                */
  #define CRACEN_ENABLE_PKEIKG_Enabled (0x1UL)       /*!< PKE and IKG enabled.                                                 */


/* CRACEN_SEEDVALID: Indicates the SEED register is valid. Writing this register has no effect. */
  #define CRACEN_SEEDVALID_ResetValue (0x00000000UL) /*!< Reset value of SEEDVALID register.                                   */

/* VALID @Bit 0 : Marks the SEED as valid */
  #define CRACEN_SEEDVALID_VALID_Pos (0UL)           /*!< Position of VALID field.                                             */
  #define CRACEN_SEEDVALID_VALID_Msk (0x1UL << CRACEN_SEEDVALID_VALID_Pos) /*!< Bit mask of VALID field.                       */
  #define CRACEN_SEEDVALID_VALID_Min (0x0UL)         /*!< Min enumerator value of VALID field.                                 */
  #define CRACEN_SEEDVALID_VALID_Max (0x1UL)         /*!< Max enumerator value of VALID field.                                 */
  #define CRACEN_SEEDVALID_VALID_Disabled (0x0UL)    /*!< Valid disabled.                                                      */
  #define CRACEN_SEEDVALID_VALID_Enabled (0x1UL)     /*!< Valid enabled.                                                       */


/* CRACEN_SEED: Seed word [n] for symmetric and asymmetric key generation. This register is only writable from KMU. */
  #define CRACEN_SEED_MaxCount (12UL)                /*!< Max size of SEED[12] array.                                          */
  #define CRACEN_SEED_MaxIndex (11UL)                /*!< Max index of SEED[12] array.                                         */
  #define CRACEN_SEED_MinIndex (0UL)                 /*!< Min index of SEED[12] array.                                         */
  #define CRACEN_SEED_ResetValue (0x00000000UL)      /*!< Reset value of SEED[12] register.                                    */

/* VAL @Bits 0..31 : Seed value */
  #define CRACEN_SEED_VAL_Pos (0UL)                  /*!< Position of VAL field.                                               */
  #define CRACEN_SEED_VAL_Msk (0xFFFFFFFFUL << CRACEN_SEED_VAL_Pos) /*!< Bit mask of VAL field.                                */


/* CRACEN_SEEDLOCK: Indicates the access to the SEED register is locked. Writing this register has no effect. */
  #define CRACEN_SEEDLOCK_ResetValue (0x00000000UL)  /*!< Reset value of SEEDLOCK register.                                    */

/* ENABLE @Bit 0 : Enable the lock */
  #define CRACEN_SEEDLOCK_ENABLE_Pos (0UL)           /*!< Position of ENABLE field.                                            */
  #define CRACEN_SEEDLOCK_ENABLE_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE_Pos) /*!< Bit mask of ENABLE field.                      */
  #define CRACEN_SEEDLOCK_ENABLE_Min (0x0UL)         /*!< Min enumerator value of ENABLE field.                                */
  #define CRACEN_SEEDLOCK_ENABLE_Max (0x1UL)         /*!< Max enumerator value of ENABLE field.                                */
  #define CRACEN_SEEDLOCK_ENABLE_Disabled (0x0UL)    /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE_Enabled (0x1UL)     /*!< Lock enabled.                                                        */


/* CRACEN_PROTECTEDRAMLOCK: Lock the access to the protected RAM. */
  #define CRACEN_PROTECTEDRAMLOCK_ResetValue (0x00000000UL) /*!< Reset value of PROTECTEDRAMLOCK register.                     */

/* ENABLE @Bit 0 : Enable the lock */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Msk (0x1UL << CRACEN_PROTECTEDRAMLOCK_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Disabled (0x0UL) /*!< Lock disabled.                                                  */
  #define CRACEN_PROTECTEDRAMLOCK_ENABLE_Enabled (0x1UL) /*!< Lock enabled.                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                        CRACENCORE                                        ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ============================================= Struct CRACENCORE_CRYPTMSTRDMA ============================================== */
/**
  * @brief CRYPTMSTRDMA [CRACENCORE_CRYPTMSTRDMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  FETCHADDRLSB;                      /*!< (@ 0x00000000) Fetch Address Least Significant Word                  */
  __IOM uint32_t  FETCHADDRMSB;                      /*!< (@ 0x00000004) Fetch Address Most Significant Word                   */
  __IOM uint32_t  FETCHLEN;                          /*!< (@ 0x00000008) Fetch DMA Length (only used in direct mode)           */
  __IOM uint32_t  FETCHTAG;                          /*!< (@ 0x0000000C) Fetch User Tag (only used in direct mode)             */
  __IOM uint32_t  PUSHADDRLSB;                       /*!< (@ 0x00000010) Push Address Least Significant Word                   */
  __IOM uint32_t  PUSHADDRMSB;                       /*!< (@ 0x00000014) Push Address Most Significant Word                    */
  __IOM uint32_t  PUSHLEN;                           /*!< (@ 0x00000018) Push Length (only used in direct mode)                */
  __IOM uint32_t  INTEN;                             /*!< (@ 0x0000001C) Interrupt Enable mask                                 */
  __IOM uint32_t  INTENSET;                          /*!< (@ 0x00000020) Interrupt Set                                         */
  __IOM uint32_t  INTENCLR;                          /*!< (@ 0x00000024) Interrupt Clear                                       */
  __IOM uint32_t  INTSTATRAW;                        /*!< (@ 0x00000028) Interrupt Status Raw                                  */
  __IOM uint32_t  INTSTAT;                           /*!< (@ 0x0000002C) Interrupt Status                                      */
  __IOM uint32_t  INTSTATCLR;                        /*!< (@ 0x00000030) Interrupt Status Clear                                */
  __IOM uint32_t  CONFIG;                            /*!< (@ 0x00000034) Cryptomaster configuration                            */
  __IOM uint32_t  START;                             /*!< (@ 0x00000038) Start                                                 */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x0000003C) Status                                                */
} NRF_CRACENCORE_CRYPTMSTRDMA_Type;                  /*!< Size = 64 (0x040)                                                    */

/* CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB: Fetch Address Least Significant Word */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRLSB register.            */

/* FETCHADDRLSB @Bits 0..31 : Address */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos (0UL) /*!< Position of FETCHADDRLSB field.                     */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Msk (0xFFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHADDRLSB_FETCHADDRLSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRLSB field.*/


/* CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB: Fetch Address Most Significant Word */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_ResetValue (0x00000000UL) /*!< Reset value of FETCHADDRMSB register.            */

/* FETCHADDRMSB @Bits 0..31 : (unspecified) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos (0UL) /*!< Position of FETCHADDRMSB field.                     */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Msk (0xFFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHADDRMSB_FETCHADDRMSB_Pos)
                                                                            /*!< Bit mask of FETCHADDRMSB field.*/


/* CRACENCORE_CRYPTMSTRDMA_FETCHLEN: Fetch DMA Length (only used in direct mode) */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_ResetValue (0x00000000UL) /*!< Reset value of FETCHLEN register.                    */

/* FETCHLEN @Bits 0..27 : Length of data block */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos (0UL) /*!< Position of FETCHLEN field.                                 */
  #define CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Msk (0xFFFFFFFUL << CRACENCORE_CRYPTMSTRDMA_FETCHLEN_FETCHLEN_Pos) /*!< Bit
                                                                            mask of FETCHLEN field.*/

