NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
  #define ETM_TRCVICTLR_EXLEVEL1_S_Pos (17UL)        /*!< Position of EXLEVEL1_S field.                                        */
  #define ETM_TRCVICTLR_EXLEVEL1_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL1_S_Pos) /*!< Bit mask of EXLEVEL1_S field.              */
  #define ETM_TRCVICTLR_EXLEVEL1_S_Min (0x0UL)       /*!< Min enumerator value of EXLEVEL1_S field.                            */
  #define ETM_TRCVICTLR_EXLEVEL1_S_Max (0x1UL)       /*!< Max enumerator value of EXLEVEL1_S field.                            */
  #define ETM_TRCVICTLR_EXLEVEL1_S_Disabled (0x1UL)  /*!< The trace unit does not generate instruction trace, in Secure state,
                                                          for Exception level 1.*/
  #define ETM_TRCVICTLR_EXLEVEL1_S_Enabled (0x0UL)   /*!< The trace unit generates instruction trace, in Secure state, for
                                                          Exception level 1.*/

/* EXLEVEL2_S @Bit 18 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding
                        Exception level 2. */

  #define ETM_TRCVICTLR_EXLEVEL2_S_Pos (18UL)        /*!< Position of EXLEVEL2_S field.                                        */
  #define ETM_TRCVICTLR_EXLEVEL2_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL2_S_Pos) /*!< Bit mask of EXLEVEL2_S field.              */
  #define ETM_TRCVICTLR_EXLEVEL2_S_Min (0x0UL)       /*!< Min enumerator value of EXLEVEL2_S field.                            */
  #define ETM_TRCVICTLR_EXLEVEL2_S_Max (0x1UL)       /*!< Max enumerator value of EXLEVEL2_S field.                            */
  #define ETM_TRCVICTLR_EXLEVEL2_S_Disabled (0x1UL)  /*!< The trace unit does not generate instruction trace, in Secure state,
                                                          for Exception level 2.*/
  #define ETM_TRCVICTLR_EXLEVEL2_S_Enabled (0x0UL)   /*!< The trace unit generates instruction trace, in Secure state, for
                                                          Exception level 2.*/

/* EXLEVEL3_S @Bit 19 : In Secure state, each bit controls whether instruction tracing is enabled for the corresponding
                        Exception level 3. */

  #define ETM_TRCVICTLR_EXLEVEL3_S_Pos (19UL)        /*!< Position of EXLEVEL3_S field.                                        */
  #define ETM_TRCVICTLR_EXLEVEL3_S_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL3_S_Pos) /*!< Bit mask of EXLEVEL3_S field.              */
  #define ETM_TRCVICTLR_EXLEVEL3_S_Min (0x0UL)       /*!< Min enumerator value of EXLEVEL3_S field.                            */
  #define ETM_TRCVICTLR_EXLEVEL3_S_Max (0x1UL)       /*!< Max enumerator value of EXLEVEL3_S field.                            */
  #define ETM_TRCVICTLR_EXLEVEL3_S_Disabled (0x1UL)  /*!< The trace unit does not generate instruction trace, in Secure state,
                                                          for Exception level 3.*/
  #define ETM_TRCVICTLR_EXLEVEL3_S_Enabled (0x0UL)   /*!< The trace unit generates instruction trace, in Secure state, for
                                                          Exception level 3.*/

/* EXLEVEL0_NS @Bit 20 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 0. */

  #define ETM_TRCVICTLR_EXLEVEL0_NS_Pos (20UL)       /*!< Position of EXLEVEL0_NS field.                                       */
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL0_NS_Pos) /*!< Bit mask of EXLEVEL0_NS field.           */
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Min (0x0UL)      /*!< Min enumerator value of EXLEVEL0_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Max (0x1UL)      /*!< Max enumerator value of EXLEVEL0_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 0.*/
  #define ETM_TRCVICTLR_EXLEVEL0_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 0.*/

/* EXLEVEL1_NS @Bit 21 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 1. */

  #define ETM_TRCVICTLR_EXLEVEL1_NS_Pos (21UL)       /*!< Position of EXLEVEL1_NS field.                                       */
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL1_NS_Pos) /*!< Bit mask of EXLEVEL1_NS field.           */
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Min (0x0UL)      /*!< Min enumerator value of EXLEVEL1_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Max (0x1UL)      /*!< Max enumerator value of EXLEVEL1_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 1.*/
  #define ETM_TRCVICTLR_EXLEVEL1_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 1.*/

/* EXLEVEL2_NS @Bit 22 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 2. */

  #define ETM_TRCVICTLR_EXLEVEL2_NS_Pos (22UL)       /*!< Position of EXLEVEL2_NS field.                                       */
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL2_NS_Pos) /*!< Bit mask of EXLEVEL2_NS field.           */
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Min (0x0UL)      /*!< Min enumerator value of EXLEVEL2_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Max (0x1UL)      /*!< Max enumerator value of EXLEVEL2_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 2.*/
  #define ETM_TRCVICTLR_EXLEVEL2_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 2.*/

/* EXLEVEL3_NS @Bit 23 : In Non-secure state, each bit controls whether instruction tracing is enabled for the corresponding
                         Exception level 3. */

  #define ETM_TRCVICTLR_EXLEVEL3_NS_Pos (23UL)       /*!< Position of EXLEVEL3_NS field.                                       */
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Msk (0x1UL << ETM_TRCVICTLR_EXLEVEL3_NS_Pos) /*!< Bit mask of EXLEVEL3_NS field.           */
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Min (0x0UL)      /*!< Min enumerator value of EXLEVEL3_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Max (0x1UL)      /*!< Max enumerator value of EXLEVEL3_NS field.                           */
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Disabled (0x1UL) /*!< The trace unit does not generate instruction trace, in Non-secure
                                                          state, for Exception level 3.*/
  #define ETM_TRCVICTLR_EXLEVEL3_NS_Enabled (0x0UL)  /*!< The trace unit generates instruction trace, in Non-secure state, for
                                                          Exception level 3.*/


/* ETM_TRCVIIECTLR: ViewInst exclude control. Might ignore writes when the trace unit is enabled or not idle. This register must
                     be programmed when one or more address comparators are implemented. */

  #define ETM_TRCVIIECTLR_ResetValue (0x00000000UL)  /*!< Reset value of TRCVIIECTLR register.                                 */

/* INCLUDE0 @Bit 0 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

  #define ETM_TRCVIIECTLR_INCLUDE0_Pos (0UL)         /*!< Position of INCLUDE0 field.                                          */
  #define ETM_TRCVIIECTLR_INCLUDE0_Msk (0x1UL << ETM_TRCVIIECTLR_INCLUDE0_Pos) /*!< Bit mask of INCLUDE0 field.                */
  #define ETM_TRCVIIECTLR_INCLUDE0_Min (0x0UL)       /*!< Min enumerator value of INCLUDE0 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE0_Max (0x1UL)       /*!< Max enumerator value of INCLUDE0 field.                              */
  #define ETM_TRCVIIECTLR_INCLUDE0_Disabled (0x0UL)  /*!< The address range that address range comparator pair 0 defines, is not
                                                          selected for ViewInst include control.*/
  #define ETM_TRCVIIECTLR_INCLUDE0_Enabled (0x1UL)   /*!< The address range that address range comparator pair 0 defines, is
                                                          selected for ViewInst include control.*/

/* INCLUDE1 @Bit 1 : Include range field. Selects which address range comparator pairs are in use with ViewInst include control.
                     */

