NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* EXCLUDE0 @Bit 16 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE0_Pos (16UL)        /*!< Position of EXCLUDE0 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE0_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE0_Pos) /*!< Bit mask of EXCLUDE0 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE0_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE0 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE0_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE0 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE0_Disabled (0x0UL)  /*!< The address range that address range comparator pair 0 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE0_Enabled (0x1UL)   /*!< The address range that address range comparator pair 0 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE1 @Bit 17 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE1_Pos (17UL)        /*!< Position of EXCLUDE1 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE1_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE1_Pos) /*!< Bit mask of EXCLUDE1 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE1_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE1 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE1_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE1 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE1_Disabled (0x0UL)  /*!< The address range that address range comparator pair 1 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE1_Enabled (0x1UL)   /*!< The address range that address range comparator pair 1 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE2 @Bit 18 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE2_Pos (18UL)        /*!< Position of EXCLUDE2 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE2_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE2_Pos) /*!< Bit mask of EXCLUDE2 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE2_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE2 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE2_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE2 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE2_Disabled (0x0UL)  /*!< The address range that address range comparator pair 2 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE2_Enabled (0x1UL)   /*!< The address range that address range comparator pair 2 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE3 @Bit 19 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE3_Pos (19UL)        /*!< Position of EXCLUDE3 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE3_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE3_Pos) /*!< Bit mask of EXCLUDE3 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE3_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE3 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE3_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE3 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE3_Disabled (0x0UL)  /*!< The address range that address range comparator pair 3 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE3_Enabled (0x1UL)   /*!< The address range that address range comparator pair 3 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE4 @Bit 20 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE4_Pos (20UL)        /*!< Position of EXCLUDE4 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE4_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE4_Pos) /*!< Bit mask of EXCLUDE4 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE4_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE4 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE4_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE4 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE4_Disabled (0x0UL)  /*!< The address range that address range comparator pair 4 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE4_Enabled (0x1UL)   /*!< The address range that address range comparator pair 4 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE5 @Bit 21 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE5_Pos (21UL)        /*!< Position of EXCLUDE5 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE5_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE5_Pos) /*!< Bit mask of EXCLUDE5 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE5_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE5 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE5_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE5 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE5_Disabled (0x0UL)  /*!< The address range that address range comparator pair 5 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE5_Enabled (0x1UL)   /*!< The address range that address range comparator pair 5 defines, is
                                                          selected for ViewInst exclude control.*/

