NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* EVENT4 @Bit 4 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT4_Pos (4UL)             /*!< Position of EVENT4 field.                                            */
  #define ETM_TRCVDCTLR_EVENT4_Msk (0x1UL << ETM_TRCVDCTLR_EVENT4_Pos) /*!< Bit mask of EVENT4 field.                          */
  #define ETM_TRCVDCTLR_EVENT4_Min (0x0UL)           /*!< Min enumerator value of EVENT4 field.                                */
  #define ETM_TRCVDCTLR_EVENT4_Max (0x1UL)           /*!< Max enumerator value of EVENT4 field.                                */
  #define ETM_TRCVDCTLR_EVENT4_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT4_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

/* EVENT5 @Bit 5 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT5_Pos (5UL)             /*!< Position of EVENT5 field.                                            */
  #define ETM_TRCVDCTLR_EVENT5_Msk (0x1UL << ETM_TRCVDCTLR_EVENT5_Pos) /*!< Bit mask of EVENT5 field.                          */
  #define ETM_TRCVDCTLR_EVENT5_Min (0x0UL)           /*!< Min enumerator value of EVENT5 field.                                */
  #define ETM_TRCVDCTLR_EVENT5_Max (0x1UL)           /*!< Max enumerator value of EVENT5 field.                                */
  #define ETM_TRCVDCTLR_EVENT5_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT5_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

/* EVENT6 @Bit 6 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT6_Pos (6UL)             /*!< Position of EVENT6 field.                                            */
  #define ETM_TRCVDCTLR_EVENT6_Msk (0x1UL << ETM_TRCVDCTLR_EVENT6_Pos) /*!< Bit mask of EVENT6 field.                          */
  #define ETM_TRCVDCTLR_EVENT6_Min (0x0UL)           /*!< Min enumerator value of EVENT6 field.                                */
  #define ETM_TRCVDCTLR_EVENT6_Max (0x1UL)           /*!< Max enumerator value of EVENT6 field.                                */
  #define ETM_TRCVDCTLR_EVENT6_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT6_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

/* EVENT7 @Bit 7 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT7_Pos (7UL)             /*!< Position of EVENT7 field.                                            */
  #define ETM_TRCVDCTLR_EVENT7_Msk (0x1UL << ETM_TRCVDCTLR_EVENT7_Pos) /*!< Bit mask of EVENT7 field.                          */
  #define ETM_TRCVDCTLR_EVENT7_Min (0x0UL)           /*!< Min enumerator value of EVENT7 field.                                */
  #define ETM_TRCVDCTLR_EVENT7_Max (0x1UL)           /*!< Max enumerator value of EVENT7 field.                                */
  #define ETM_TRCVDCTLR_EVENT7_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT7_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

/* SPREL @Bits 8..9 : Controls whether a trace unit traces data for transfers that are relative to the Stack Pointer (SP). */
  #define ETM_TRCVDCTLR_SPREL_Pos (8UL)              /*!< Position of SPREL field.                                             */
  #define ETM_TRCVDCTLR_SPREL_Msk (0x3UL << ETM_TRCVDCTLR_SPREL_Pos) /*!< Bit mask of SPREL field.                             */
  #define ETM_TRCVDCTLR_SPREL_Min (0x0UL)            /*!< Min enumerator value of SPREL field.                                 */
  #define ETM_TRCVDCTLR_SPREL_Max (0x3UL)            /*!< Max enumerator value of SPREL field.                                 */
  #define ETM_TRCVDCTLR_SPREL_Enabled (0x0UL)        /*!< The trace unit does not affect the tracing of SP-relative transfers. */
  #define ETM_TRCVDCTLR_SPREL_DataOnly (0x2UL)       /*!< The trace unit does not trace the address portion of SP-relative
                                                          transfers. If data value tracing is enabled then the trace unit
                                                          generates a P1 data address element.*/
  #define ETM_TRCVDCTLR_SPREL_Disabled (0x3UL)       /*!< The trace unit does not trace the address or value portions of
                                                          SP-relative transfers.*/

/* PCREL @Bit 10 : Controls whether a trace unit traces data for transfers that are relative to the Program Counter (PC). */
  #define ETM_TRCVDCTLR_PCREL_Pos (10UL)             /*!< Position of PCREL field.                                             */
  #define ETM_TRCVDCTLR_PCREL_Msk (0x1UL << ETM_TRCVDCTLR_PCREL_Pos) /*!< Bit mask of PCREL field.                             */
  #define ETM_TRCVDCTLR_PCREL_Min (0x0UL)            /*!< Min enumerator value of PCREL field.                                 */
  #define ETM_TRCVDCTLR_PCREL_Max (0x1UL)            /*!< Max enumerator value of PCREL field.                                 */
  #define ETM_TRCVDCTLR_PCREL_Enabled (0x0UL)        /*!< The trace unit does not affect the tracing of PC-relative transfers. */
  #define ETM_TRCVDCTLR_PCREL_Disabled (0x1UL)       /*!< The trace unit does not trace the address or value portions of
                                                          PC-relative transfers.*/

/* TBI @Bit 11 : Controls which information a trace unit populates in bits[63:56] of the data address. */
  #define ETM_TRCVDCTLR_TBI_Pos (11UL)               /*!< Position of TBI field.                                               */
  #define ETM_TRCVDCTLR_TBI_Msk (0x1UL << ETM_TRCVDCTLR_TBI_Pos) /*!< Bit mask of TBI field.                                   */
  #define ETM_TRCVDCTLR_TBI_Min (0x0UL)              /*!< Min enumerator value of TBI field.                                   */
  #define ETM_TRCVDCTLR_TBI_Max (0x1UL)              /*!< Max enumerator value of TBI field.                                   */
  #define ETM_TRCVDCTLR_TBI_SignExtend (0x0UL)       /*!< The trace unit assigns bits[63:56] to have the same value as bit[55]
                                                          of the data address, that is, it sign-extends the value.*/
  #define ETM_TRCVDCTLR_TBI_Copy (0x1UL)             /*!< The trace unit assigns bits[63:56] to have the same value as
                                                          bits[63:56] of the data address.*/

/* TRCEXDATA @Bit 12 : Controls the tracing of data transfers for exceptions and exception returns on Armv6-M, Armv7-M, and
                       Armv8-M PEs. */

  #define ETM_TRCVDCTLR_TRCEXDATA_Pos (12UL)         /*!< Position of TRCEXDATA field.                                         */
  #define ETM_TRCVDCTLR_TRCEXDATA_Msk (0x1UL << ETM_TRCVDCTLR_TRCEXDATA_Pos) /*!< Bit mask of TRCEXDATA field.                 */
  #define ETM_TRCVDCTLR_TRCEXDATA_Min (0x0UL)        /*!< Min enumerator value of TRCEXDATA field.                             */
  #define ETM_TRCVDCTLR_TRCEXDATA_Max (0x1UL)        /*!< Max enumerator value of TRCEXDATA field.                             */
  #define ETM_TRCVDCTLR_TRCEXDATA_Disabled (0x0UL)   /*!< Exception and exception return data transfers are not traced.        */
  #define ETM_TRCVDCTLR_TRCEXDATA_Enabled (0x1UL)    /*!< Exception and exception return data transfers are traced if the other
                                                          aspects of ViewData indicate that the data transfers must be traced.*/


