NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* CNTEVENT @Bits 0..7 : Selects an event, that when it occurs causes counter n to decrement. */
  #define ETM_TRCCNTCTLR_CNTEVENT_Pos (0UL)          /*!< Position of CNTEVENT field.                                          */
  #define ETM_TRCCNTCTLR_CNTEVENT_Msk (0xFFUL << ETM_TRCCNTCTLR_CNTEVENT_Pos) /*!< Bit mask of CNTEVENT field.                 */
  #define ETM_TRCCNTCTLR_CNTEVENT_Min (0x00UL)       /*!< Min value of CNTEVENT field.                                         */
  #define ETM_TRCCNTCTLR_CNTEVENT_Max (0xFFUL)       /*!< Max size of CNTEVENT field.                                          */

/* RLDEVENT @Bits 8..15 : Selects an event, that when it occurs causes a reload event for counter n. */
  #define ETM_TRCCNTCTLR_RLDEVENT_Pos (8UL)          /*!< Position of RLDEVENT field.                                          */
  #define ETM_TRCCNTCTLR_RLDEVENT_Msk (0xFFUL << ETM_TRCCNTCTLR_RLDEVENT_Pos) /*!< Bit mask of RLDEVENT field.                 */
  #define ETM_TRCCNTCTLR_RLDEVENT_Min (0x00UL)       /*!< Min value of RLDEVENT field.                                         */
  #define ETM_TRCCNTCTLR_RLDEVENT_Max (0xFFUL)       /*!< Max size of RLDEVENT field.                                          */

/* RLDSELF @Bit 16 : Controls whether a reload event occurs for counter n, when counter n reaches zero. */
  #define ETM_TRCCNTCTLR_RLDSELF_Pos (16UL)          /*!< Position of RLDSELF field.                                           */
  #define ETM_TRCCNTCTLR_RLDSELF_Msk (0x1UL << ETM_TRCCNTCTLR_RLDSELF_Pos) /*!< Bit mask of RLDSELF field.                     */
  #define ETM_TRCCNTCTLR_RLDSELF_Min (0x0UL)         /*!< Min enumerator value of RLDSELF field.                               */
  #define ETM_TRCCNTCTLR_RLDSELF_Max (0x1UL)         /*!< Max enumerator value of RLDSELF field.                               */
  #define ETM_TRCCNTCTLR_RLDSELF_Disabled (0x0UL)    /*!< The counter is in Normal mode.                                       */
  #define ETM_TRCCNTCTLR_RLDSELF_Enabled (0x1UL)     /*!< The counter is in Self-reload mode.                                  */

/* CNTCHAIN @Bit 17 : For TRCCNTCTLR3 and TRCCNTCTLR1, this bit controls whether counter n decrements when a reload event occurs
                      for counter n-1. */

  #define ETM_TRCCNTCTLR_CNTCHAIN_Pos (17UL)         /*!< Position of CNTCHAIN field.                                          */
  #define ETM_TRCCNTCTLR_CNTCHAIN_Msk (0x1UL << ETM_TRCCNTCTLR_CNTCHAIN_Pos) /*!< Bit mask of CNTCHAIN field.                  */
  #define ETM_TRCCNTCTLR_CNTCHAIN_Min (0x0UL)        /*!< Min enumerator value of CNTCHAIN field.                              */
  #define ETM_TRCCNTCTLR_CNTCHAIN_Max (0x1UL)        /*!< Max enumerator value of CNTCHAIN field.                              */
  #define ETM_TRCCNTCTLR_CNTCHAIN_Disabled (0x0UL)   /*!< Counter n does not decrement when a reload event for counter n-1
                                                          occurs.*/
  #define ETM_TRCCNTCTLR_CNTCHAIN_Enabled (0x1UL)    /*!< Counter n decrements when a reload event for counter n-1 occurs. This
                                                          concatenates counter n and counter n-1, to provide a larger count
                                                          value.*/


/* ETM_TRCCNTVR: This sets or returns the value of counter n. The count value is only stable when TRCSTATR.PMSTABLE == 1. If
                  software uses counter n then it must write to this register to set the initial counter value. Might ignore
                  writes when the trace unit is enabled or not idle. */

  #define ETM_TRCCNTVR_MaxCount (4UL)                /*!< Max size of TRCCNTVR[4] array.                                       */
  #define ETM_TRCCNTVR_MaxIndex (3UL)                /*!< Max index of TRCCNTVR[4] array.                                      */
  #define ETM_TRCCNTVR_MinIndex (0UL)                /*!< Min index of TRCCNTVR[4] array.                                      */
  #define ETM_TRCCNTVR_ResetValue (0x00000000UL)     /*!< Reset value of TRCCNTVR[4] register.                                 */

/* VALUE @Bits 0..15 : Contains the count value of counter n. */
  #define ETM_TRCCNTVR_VALUE_Pos (0UL)               /*!< Position of VALUE field.                                             */
  #define ETM_TRCCNTVR_VALUE_Msk (0xFFFFUL << ETM_TRCCNTVR_VALUE_Pos) /*!< Bit mask of VALUE field.                            */
  #define ETM_TRCCNTVR_VALUE_Min (0x0000UL)          /*!< Min value of VALUE field.                                            */
  #define ETM_TRCCNTVR_VALUE_Max (0xFFFFUL)          /*!< Max size of VALUE field.                                             */


/* ETM_TRCRSCTLR: Controls the selection of the resources in the trace unit. Might ignore writes when the trace unit is enabled
                   or not idle. If software selects a non-implemented resource then CONSTRAINED UNPREDICTABLE behavior of the
                   resource selector occurs, so the resource selector might fire unexpectedly or might not fire. Reads of the
                   TRCRSCTLRn might return UNKNOWN. */

  #define ETM_TRCRSCTLR_MaxCount (30UL)              /*!< Max size of TRCRSCTLR[32] array.                                     */
  #define ETM_TRCRSCTLR_MaxIndex (31UL)              /*!< Max index of TRCRSCTLR[32] array.                                    */
  #define ETM_TRCRSCTLR_MinIndex (2UL)               /*!< Min index of TRCRSCTLR[32] array.                                    */
  #define ETM_TRCRSCTLR_ResetValue (0x00000000UL)    /*!< Reset value of TRCRSCTLR[32] register.                               */

/* EN @Bit 0 : Trace unit enable bit */
  #define ETM_TRCRSCTLR_EN_Pos (0UL)                 /*!< Position of EN field.                                                */
  #define ETM_TRCRSCTLR_EN_Msk (0x1UL << ETM_TRCRSCTLR_EN_Pos) /*!< Bit mask of EN field.                                      */
  #define ETM_TRCRSCTLR_EN_Min (0x0UL)               /*!< Min enumerator value of EN field.                                    */
  #define ETM_TRCRSCTLR_EN_Max (0x1UL)               /*!< Max enumerator value of EN field.                                    */
  #define ETM_TRCRSCTLR_EN_Disabled (0x0UL)          /*!< The trace unit is disabled. All trace resources are inactive and no
                                                          trace is generated.*/
  #define ETM_TRCRSCTLR_EN_Enabled (0x1UL)           /*!< The trace unit is enabled.                                           */


