NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* DEVICEADDR @Bits 0..31 : 48 bit device address */
  #define FICR_DEVICEADDR_DEVICEADDR_Pos (0UL)       /*!< Position of DEVICEADDR field.                                        */
  #define FICR_DEVICEADDR_DEVICEADDR_Msk (0xFFFFFFFFUL << FICR_DEVICEADDR_DEVICEADDR_Pos) /*!< Bit mask of DEVICEADDR field.   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         GLITCHDET                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ==================================================== Struct GLITCHDET ===================================================== */
/**
  * @brief Voltage glitch detectors
  */
  typedef struct {                                   /*!< GLITCHDET Structure                                                  */
    __IM uint32_t RESERVED[360];
    __IOM uint32_t CONFIG;                           /*!< (@ 0x000005A0) Configuration for glitch detector                     */
  } NRF_GLITCHDET_Type;                              /*!< Size = 1444 (0x5A4)                                                  */

/* GLITCHDET_CONFIG: Configuration for glitch detector */
  #define GLITCHDET_CONFIG_ResetValue (0x00000000UL) /*!< Reset value of CONFIG register.                                      */

/* REQUESTEDSTATE @Bits 0..1 : Requested state of the glitch detector. */
  #define GLITCHDET_CONFIG_REQUESTEDSTATE_Pos (0UL)  /*!< Position of REQUESTEDSTATE field.                                    */
  #define GLITCHDET_CONFIG_REQUESTEDSTATE_Msk (0x3UL << GLITCHDET_CONFIG_REQUESTEDSTATE_Pos) /*!< Bit mask of REQUESTEDSTATE
                                                                            field.*/
  #define GLITCHDET_CONFIG_REQUESTEDSTATE_Min (0x0UL) /*!< Min enumerator value of REQUESTEDSTATE field.                       */
  #define GLITCHDET_CONFIG_REQUESTEDSTATE_Max (0x2UL) /*!< Max enumerator value of REQUESTEDSTATE field.                       */
  #define GLITCHDET_CONFIG_REQUESTEDSTATE_Disabled (0x0UL) /*!< Disabled: Glitch detector shall be disabled                    */
  #define GLITCHDET_CONFIG_REQUESTEDSTATE_Enabled (0x1UL) /*!< Enabled: Glitch detector shall be enabled                       */
  #define GLITCHDET_CONFIG_REQUESTEDSTATE_Keep (0x2UL) /*!< Keep: Do not change the state of glitch detector, keep it as it is.*/

/* MODE @Bit 4 : Glitch detector mode */
  #define GLITCHDET_CONFIG_MODE_Pos (4UL)            /*!< Position of MODE field.                                              */
  #define GLITCHDET_CONFIG_MODE_Msk (0x1UL << GLITCHDET_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                          */
  #define GLITCHDET_CONFIG_MODE_Min (0x0UL)          /*!< Min enumerator value of MODE field.                                  */
  #define GLITCHDET_CONFIG_MODE_Max (0x1UL)          /*!< Max enumerator value of MODE field.                                  */
  #define GLITCHDET_CONFIG_MODE_HighPassFilter (0x0UL) /*!< High pass filter mode                                              */
  #define GLITCHDET_CONFIG_MODE_CapDiv (0x1UL)       /*!< Cap divider mode                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           GPIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct GPIO ======================================================= */
/**
  * @brief GPIO Port
  */
  typedef struct {                                   /*!< GPIO Structure                                                       */
    __IOM uint32_t OUT;                              /*!< (@ 0x00000000) Write GPIO port                                       */
    __IOM uint32_t OUTSET;                           /*!< (@ 0x00000004) Set individual bits in GPIO port                      */
    __IOM uint32_t OUTCLR;                           /*!< (@ 0x00000008) Clear individual bits in GPIO port                    */
    __IM uint32_t IN;                                /*!< (@ 0x0000000C) Read GPIO port                                        */
    __IOM uint32_t DIR;                              /*!< (@ 0x00000010) Direction of GPIO pins                                */
    __IOM uint32_t DIRSET;                           /*!< (@ 0x00000014) DIR set register                                      */
    __IOM uint32_t DIRCLR;                           /*!< (@ 0x00000018) DIR clear register                                    */
    __IM uint32_t RESERVED;
    __IOM uint32_t LATCH;                            /*!< (@ 0x00000020) Latch register indicating what GPIO pins that have met
                                                                         the criteria set in the PIN_CNF[n].SENSE registers*/
    __IOM uint32_t DETECTMODE;                       /*!< (@ 0x00000024) Select between default DETECT signal behavior and
                                                                         LDETECT mode*/
    __IM uint32_t RESERVED1[22];
    __IOM uint32_t PIN_CNF[32];                      /*!< (@ 0x00000080) Pin n configuration of GPIO pin                       */
  } NRF_GPIO_Type;                                   /*!< Size = 256 (0x100)                                                   */

/* GPIO_OUT: Write GPIO port */
  #define GPIO_OUT_ResetValue (0x00000000UL)         /*!< Reset value of OUT register.                                         */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUT_PIN0_Pos (0UL)                    /*!< Position of PIN0 field.                                              */
  #define GPIO_OUT_PIN0_Msk (0x1UL << GPIO_OUT_PIN0_Pos) /*!< Bit mask of PIN0 field.                                          */
  #define GPIO_OUT_PIN0_Min (0x0UL)                  /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Max (0x1UL)                  /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_OUT_PIN0_Low (0x0UL)                  /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN0_High (0x1UL)                 /*!< Pin driver is high                                                   */

