NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* GPIOHSPADCTRL_BIAS: Bias control */
  #define GPIOHSPADCTRL_BIAS_ResetValue (0x00000000UL) /*!< Reset value of BIAS register.                                      */

/* HSBIAS @Bits 0..1 : Slew setting for high-speed pad (higher value is faster) */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Pos (0UL)        /*!< Position of HSBIAS field.                                            */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Msk (0x3UL << GPIOHSPADCTRL_BIAS_HSBIAS_Pos) /*!< Bit mask of HSBIAS field.                */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Min (0x0UL)      /*!< Min value of HSBIAS field.                                           */
  #define GPIOHSPADCTRL_BIAS_HSBIAS_Max (0x3UL)      /*!< Max size of HSBIAS field.                                            */

/* REPLICABIAS00 @Bit 2 : Slew setting for replica clock (used by the MSPI00 peripheral) */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Pos (2UL) /*!< Position of REPLICABIAS00 field.                                     */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Msk (0x1UL << GPIOHSPADCTRL_BIAS_REPLICABIAS00_Pos) /*!< Bit mask of REPLICABIAS00
                                                                            field.*/
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Min (0x0UL) /*!< Min value of REPLICABIAS00 field.                                  */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS00_Max (0x1UL) /*!< Max size of REPLICABIAS00 field.                                   */

/* REPLICABIAS01 @Bit 3 : Slew setting for replica clock (used by the MSPI01 peripheral) */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Pos (3UL) /*!< Position of REPLICABIAS01 field.                                     */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Msk (0x1UL << GPIOHSPADCTRL_BIAS_REPLICABIAS01_Pos) /*!< Bit mask of REPLICABIAS01
                                                                            field.*/
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Min (0x0UL) /*!< Min value of REPLICABIAS01 field.                                  */
  #define GPIOHSPADCTRL_BIAS_REPLICABIAS01_Max (0x1UL) /*!< Max size of REPLICABIAS01 field.                                   */


/* GPIOHSPADCTRL_OVERRIDE: Override control */
  #define GPIOHSPADCTRL_OVERRIDE_ResetValue (0x00000000UL) /*!< Reset value of OVERRIDE register.                              */

/* FORCEON @Bit 0 : Force on */
  #define GPIOHSPADCTRL_OVERRIDE_FORCEON_Pos (0UL)   /*!< Position of FORCEON field.                                           */
  #define GPIOHSPADCTRL_OVERRIDE_FORCEON_Msk (0x1UL << GPIOHSPADCTRL_OVERRIDE_FORCEON_Pos) /*!< Bit mask of FORCEON field.     */

/* ATB0 @Bits 1..3 : ATB0 settings */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Pos (1UL)      /*!< Position of ATB0 field.                                              */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Msk (0x7UL << GPIOHSPADCTRL_OVERRIDE_ATB0_Pos) /*!< Bit mask of ATB0 field.              */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Min (0x5UL)    /*!< Min enumerator value of ATB0 field.                                  */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_Max (0x7UL)    /*!< Max enumerator value of ATB0 field.                                  */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_BiasTrim (0x7UL) /*!< (unspecified)                                                      */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_BiasSupply (0x6UL) /*!< (unspecified)                                                    */
  #define GPIOHSPADCTRL_OVERRIDE_ATB0_BiasPTAT (0x5UL) /*!< (unspecified)                                                      */

/* DUALDRIVE @Bit 4 : Drive pad from both high-speed pad and regular pad (when highspeed is enabled) */
  #define GPIOHSPADCTRL_OVERRIDE_DUALDRIVE_Pos (4UL) /*!< Position of DUALDRIVE field.                                         */
  #define GPIOHSPADCTRL_OVERRIDE_DUALDRIVE_Msk (0x1UL << GPIOHSPADCTRL_OVERRIDE_DUALDRIVE_Pos) /*!< Bit mask of DUALDRIVE
                                                                            field.*/


/* GPIOHSPADCTRL_CTRL: Input sampling and buffering control (used by the MSPI0n peripheral) */
  #define GPIOHSPADCTRL_CTRL_MaxCount (2UL)          /*!< Max size of CTRL[2] array.                                           */
  #define GPIOHSPADCTRL_CTRL_MaxIndex (1UL)          /*!< Max index of CTRL[2] array.                                          */
  #define GPIOHSPADCTRL_CTRL_MinIndex (0UL)          /*!< Min index of CTRL[2] array.                                          */
  #define GPIOHSPADCTRL_CTRL_ResetValue (0x00000000UL) /*!< Reset value of CTRL[2] register.                                   */

/* RXDELAY @Bits 0..2 : Delay selection */
  #define GPIOHSPADCTRL_CTRL_RXDELAY_Pos (0UL)       /*!< Position of RXDELAY field.                                           */
  #define GPIOHSPADCTRL_CTRL_RXDELAY_Msk (0x7UL << GPIOHSPADCTRL_CTRL_RXDELAY_Pos) /*!< Bit mask of RXDELAY field.             */

/* SCKEN @Bit 3 : Enable SCK */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Pos (3UL)         /*!< Position of SCKEN field.                                             */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Msk (0x1UL << GPIOHSPADCTRL_CTRL_SCKEN_Pos) /*!< Bit mask of SCKEN field.                   */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Min (0x0UL)       /*!< Min enumerator value of SCKEN field.                                 */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Max (0x1UL)       /*!< Max enumerator value of SCKEN field.                                 */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Disabled (0x0UL)  /*!< Delay chain is reset and delayed sampling is disabled                */
  #define GPIOHSPADCTRL_CTRL_SCKEN_Enabled (0x1UL)   /*!< Delay chain and delayed sampling is active                           */

/* SCKPHASE @Bit 4 : Feedback serial clock (SCKFB) sampling edge for input data */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Pos (4UL)      /*!< Position of SCKPHASE field.                                          */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Msk (0x1UL << GPIOHSPADCTRL_CTRL_SCKPHASE_Pos) /*!< Bit mask of SCKPHASE field.          */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Min (0x0UL)    /*!< Min enumerator value of SCKPHASE field.                              */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Max (0x1UL)    /*!< Max enumerator value of SCKPHASE field.                              */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Rising (0x0UL) /*!< Sample on SCK rising edge                                            */
  #define GPIOHSPADCTRL_CTRL_SCKPHASE_Falling (0x1UL) /*!< Sample on SCK falling edge                                          */

