NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* CLKOUTREADY @Bit 30 : Write '1' to disable interrupt for event CLKOUTREADY */
  #define GRTC_INTENCLR2_CLKOUTREADY_Pos (30UL)      /*!< Position of CLKOUTREADY field.                                       */
  #define GRTC_INTENCLR2_CLKOUTREADY_Msk (0x1UL << GRTC_INTENCLR2_CLKOUTREADY_Pos) /*!< Bit mask of CLKOUTREADY field.         */
  #define GRTC_INTENCLR2_CLKOUTREADY_Min (0x0UL)     /*!< Min enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTENCLR2_CLKOUTREADY_Max (0x1UL)     /*!< Max enumerator value of CLKOUTREADY field.                           */
  #define GRTC_INTENCLR2_CLKOUTREADY_Clear (0x1UL)   /*!< Disable                                                              */
  #define GRTC_INTENCLR2_CLKOUTREADY_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define GRTC_INTENCLR2_CLKOUTREADY_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* GRTC_INTPEND2: Pending interrupts */
  #define GRTC_INTPEND2_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND2 register.                                    */

/* COMPARE0 @Bit 0 : Read pending status of interrupt for event COMPARE[0] */
  #define GRTC_INTPEND2_COMPARE0_Pos (0UL)           /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTPEND2_COMPARE0_Msk (0x1UL << GRTC_INTPEND2_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                    */
  #define GRTC_INTPEND2_COMPARE0_Min (0x0UL)         /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTPEND2_COMPARE0_Max (0x1UL)         /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTPEND2_COMPARE0_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND2_COMPARE0_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE1 @Bit 1 : Read pending status of interrupt for event COMPARE[1] */
  #define GRTC_INTPEND2_COMPARE1_Pos (1UL)           /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTPEND2_COMPARE1_Msk (0x1UL << GRTC_INTPEND2_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                    */
  #define GRTC_INTPEND2_COMPARE1_Min (0x0UL)         /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTPEND2_COMPARE1_Max (0x1UL)         /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTPEND2_COMPARE1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND2_COMPARE1_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE2 @Bit 2 : Read pending status of interrupt for event COMPARE[2] */
  #define GRTC_INTPEND2_COMPARE2_Pos (2UL)           /*!< Position of COMPARE2 field.                                          */
  #define GRTC_INTPEND2_COMPARE2_Msk (0x1UL << GRTC_INTPEND2_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                    */
  #define GRTC_INTPEND2_COMPARE2_Min (0x0UL)         /*!< Min enumerator value of COMPARE2 field.                              */
  #define GRTC_INTPEND2_COMPARE2_Max (0x1UL)         /*!< Max enumerator value of COMPARE2 field.                              */
  #define GRTC_INTPEND2_COMPARE2_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND2_COMPARE2_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE3 @Bit 3 : Read pending status of interrupt for event COMPARE[3] */
  #define GRTC_INTPEND2_COMPARE3_Pos (3UL)           /*!< Position of COMPARE3 field.                                          */
  #define GRTC_INTPEND2_COMPARE3_Msk (0x1UL << GRTC_INTPEND2_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                    */
  #define GRTC_INTPEND2_COMPARE3_Min (0x0UL)         /*!< Min enumerator value of COMPARE3 field.                              */
  #define GRTC_INTPEND2_COMPARE3_Max (0x1UL)         /*!< Max enumerator value of COMPARE3 field.                              */
  #define GRTC_INTPEND2_COMPARE3_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND2_COMPARE3_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE4 @Bit 4 : Read pending status of interrupt for event COMPARE[4] */
  #define GRTC_INTPEND2_COMPARE4_Pos (4UL)           /*!< Position of COMPARE4 field.                                          */
  #define GRTC_INTPEND2_COMPARE4_Msk (0x1UL << GRTC_INTPEND2_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                    */
  #define GRTC_INTPEND2_COMPARE4_Min (0x0UL)         /*!< Min enumerator value of COMPARE4 field.                              */
  #define GRTC_INTPEND2_COMPARE4_Max (0x1UL)         /*!< Max enumerator value of COMPARE4 field.                              */
  #define GRTC_INTPEND2_COMPARE4_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND2_COMPARE4_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* COMPARE5 @Bit 5 : Read pending status of interrupt for event COMPARE[5] */
  #define GRTC_INTPEND2_COMPARE5_Pos (5UL)           /*!< Position of COMPARE5 field.                                          */
  #define GRTC_INTPEND2_COMPARE5_Msk (0x1UL << GRTC_INTPEND2_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                    */
  #define GRTC_INTPEND2_COMPARE5_Min (0x0UL)         /*!< Min enumerator value of COMPARE5 field.                              */
  #define GRTC_INTPEND2_COMPARE5_Max (0x1UL)         /*!< Max enumerator value of COMPARE5 field.                              */
  #define GRTC_INTPEND2_COMPARE5_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define GRTC_INTPEND2_COMPARE5_Pending (0x1UL)     /*!< Read: Pending                                                        */

