NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* COMPARE12 @Bit 12 : Write '1' to disable interrupt for event COMPARE[12] */
  #define GRTC_INTENCLR3_COMPARE12_Pos (12UL)        /*!< Position of COMPARE12 field.                                         */
  #define GRTC_INTENCLR3_COMPARE12_Msk (0x1UL << GRTC_INTENCLR3_COMPARE12_Pos) /*!< Bit mask of COMPARE12 field.               */
  #define GRTC_INTENCLR3_COMPARE12_Min (0x0UL)       /*!< Min enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENCLR3_COMPARE12_Max (0x1UL)       /*!< Max enumerator value of COMPARE12 field.                             */
  #define GRTC_INTENCLR3_COMPARE12_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR3_COMPARE12_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR3_COMPARE12_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE13 @Bit 13 : Write '1' to disable interrupt for event COMPARE[13] */
  #define GRTC_INTENCLR3_COMPARE13_Pos (13UL)        /*!< Position of COMPARE13 field.                                         */
  #define GRTC_INTENCLR3_COMPARE13_Msk (0x1UL << GRTC_INTENCLR3_COMPARE13_Pos) /*!< Bit mask of COMPARE13 field.               */
  #define GRTC_INTENCLR3_COMPARE13_Min (0x0UL)       /*!< Min enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENCLR3_COMPARE13_Max (0x1UL)       /*!< Max enumerator value of COMPARE13 field.                             */
  #define GRTC_INTENCLR3_COMPARE13_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR3_COMPARE13_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR3_COMPARE13_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE14 @Bit 14 : Write '1' to disable interrupt for event COMPARE[14] */
  #define GRTC_INTENCLR3_COMPARE14_Pos (14UL)        /*!< Position of COMPARE14 field.                                         */
  #define GRTC_INTENCLR3_COMPARE14_Msk (0x1UL << GRTC_INTENCLR3_COMPARE14_Pos) /*!< Bit mask of COMPARE14 field.               */
  #define GRTC_INTENCLR3_COMPARE14_Min (0x0UL)       /*!< Min enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENCLR3_COMPARE14_Max (0x1UL)       /*!< Max enumerator value of COMPARE14 field.                             */
  #define GRTC_INTENCLR3_COMPARE14_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR3_COMPARE14_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR3_COMPARE14_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* COMPARE15 @Bit 15 : Write '1' to disable interrupt for event COMPARE[15] */
  #define GRTC_INTENCLR3_COMPARE15_Pos (15UL)        /*!< Position of COMPARE15 field.                                         */
  #define GRTC_INTENCLR3_COMPARE15_Msk (0x1UL << GRTC_INTENCLR3_COMPARE15_Pos) /*!< Bit mask of COMPARE15 field.               */
  #define GRTC_INTENCLR3_COMPARE15_Min (0x0UL)       /*!< Min enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENCLR3_COMPARE15_Max (0x1UL)       /*!< Max enumerator value of COMPARE15 field.                             */
  #define GRTC_INTENCLR3_COMPARE15_Clear (0x1UL)     /*!< Disable                                                              */
  #define GRTC_INTENCLR3_COMPARE15_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR3_COMPARE15_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RTCOMPARESYNC @Bit 25 : Write '1' to disable interrupt for event RTCOMPARESYNC */
  #define GRTC_INTENCLR3_RTCOMPARESYNC_Pos (25UL)    /*!< Position of RTCOMPARESYNC field.                                     */
  #define GRTC_INTENCLR3_RTCOMPARESYNC_Msk (0x1UL << GRTC_INTENCLR3_RTCOMPARESYNC_Pos) /*!< Bit mask of RTCOMPARESYNC field.   */
  #define GRTC_INTENCLR3_RTCOMPARESYNC_Min (0x0UL)   /*!< Min enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR3_RTCOMPARESYNC_Max (0x1UL)   /*!< Max enumerator value of RTCOMPARESYNC field.                         */
  #define GRTC_INTENCLR3_RTCOMPARESYNC_Clear (0x1UL) /*!< Disable                                                              */
  #define GRTC_INTENCLR3_RTCOMPARESYNC_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define GRTC_INTENCLR3_RTCOMPARESYNC_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* PWMPERIODEND @Bit 27 : Write '1' to disable interrupt for event PWMPERIODEND */
  #define GRTC_INTENCLR3_PWMPERIODEND_Pos (27UL)     /*!< Position of PWMPERIODEND field.                                      */
  #define GRTC_INTENCLR3_PWMPERIODEND_Msk (0x1UL << GRTC_INTENCLR3_PWMPERIODEND_Pos) /*!< Bit mask of PWMPERIODEND field.      */
  #define GRTC_INTENCLR3_PWMPERIODEND_Min (0x0UL)    /*!< Min enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENCLR3_PWMPERIODEND_Max (0x1UL)    /*!< Max enumerator value of PWMPERIODEND field.                          */
  #define GRTC_INTENCLR3_PWMPERIODEND_Clear (0x1UL)  /*!< Disable                                                              */
  #define GRTC_INTENCLR3_PWMPERIODEND_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define GRTC_INTENCLR3_PWMPERIODEND_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* PWMREADY @Bit 29 : Write '1' to disable interrupt for event PWMREADY */
  #define GRTC_INTENCLR3_PWMREADY_Pos (29UL)         /*!< Position of PWMREADY field.                                          */
  #define GRTC_INTENCLR3_PWMREADY_Msk (0x1UL << GRTC_INTENCLR3_PWMREADY_Pos) /*!< Bit mask of PWMREADY field.                  */
  #define GRTC_INTENCLR3_PWMREADY_Min (0x0UL)        /*!< Min enumerator value of PWMREADY field.                              */
  #define GRTC_INTENCLR3_PWMREADY_Max (0x1UL)        /*!< Max enumerator value of PWMREADY field.                              */
  #define GRTC_INTENCLR3_PWMREADY_Clear (0x1UL)      /*!< Disable                                                              */
  #define GRTC_INTENCLR3_PWMREADY_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define GRTC_INTENCLR3_PWMREADY_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

