NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* ERRORTCXO @Bit 4 : Write '1' to disable interrupt for event ERRORTCXO */
  #define HFXO64M_INTENCLR_ERRORTCXO_Pos (4UL)       /*!< Position of ERRORTCXO field.                                         */
  #define HFXO64M_INTENCLR_ERRORTCXO_Msk (0x1UL << HFXO64M_INTENCLR_ERRORTCXO_Pos) /*!< Bit mask of ERRORTCXO field.           */
  #define HFXO64M_INTENCLR_ERRORTCXO_Min (0x0UL)     /*!< Min enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTENCLR_ERRORTCXO_Max (0x1UL)     /*!< Max enumerator value of ERRORTCXO field.                             */
  #define HFXO64M_INTENCLR_ERRORTCXO_Clear (0x1UL)   /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_ERRORTCXO_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define HFXO64M_INTENCLR_ERRORTCXO_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* STARTREQ @Bit 5 : Write '1' to disable interrupt for event STARTREQ */
  #define HFXO64M_INTENCLR_STARTREQ_Pos (5UL)        /*!< Position of STARTREQ field.                                          */
  #define HFXO64M_INTENCLR_STARTREQ_Msk (0x1UL << HFXO64M_INTENCLR_STARTREQ_Pos) /*!< Bit mask of STARTREQ field.              */
  #define HFXO64M_INTENCLR_STARTREQ_Min (0x0UL)      /*!< Min enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTENCLR_STARTREQ_Max (0x1UL)      /*!< Max enumerator value of STARTREQ field.                              */
  #define HFXO64M_INTENCLR_STARTREQ_Clear (0x1UL)    /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_STARTREQ_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENCLR_STARTREQ_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* STOPREQ @Bit 6 : Write '1' to disable interrupt for event STOPREQ */
  #define HFXO64M_INTENCLR_STOPREQ_Pos (6UL)         /*!< Position of STOPREQ field.                                           */
  #define HFXO64M_INTENCLR_STOPREQ_Msk (0x1UL << HFXO64M_INTENCLR_STOPREQ_Pos) /*!< Bit mask of STOPREQ field.                 */
  #define HFXO64M_INTENCLR_STOPREQ_Min (0x0UL)       /*!< Min enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTENCLR_STOPREQ_Max (0x1UL)       /*!< Max enumerator value of STOPREQ field.                               */
  #define HFXO64M_INTENCLR_STOPREQ_Clear (0x1UL)     /*!< Disable                                                              */
  #define HFXO64M_INTENCLR_STOPREQ_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define HFXO64M_INTENCLR_STOPREQ_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* HFXO64M_INTPEND: Pending interrupts */
  #define HFXO64M_INTPEND_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND register.                                     */

/* STARTED @Bit 0 : Read pending status of interrupt for event STARTED */
  #define HFXO64M_INTPEND_STARTED_Pos (0UL)          /*!< Position of STARTED field.                                           */
  #define HFXO64M_INTPEND_STARTED_Msk (0x1UL << HFXO64M_INTPEND_STARTED_Pos) /*!< Bit mask of STARTED field.                   */
  #define HFXO64M_INTPEND_STARTED_Min (0x0UL)        /*!< Min enumerator value of STARTED field.                               */
  #define HFXO64M_INTPEND_STARTED_Max (0x1UL)        /*!< Max enumerator value of STARTED field.                               */
  #define HFXO64M_INTPEND_STARTED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define HFXO64M_INTPEND_STARTED_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* STOPPED @Bit 1 : Read pending status of interrupt for event STOPPED */
  #define HFXO64M_INTPEND_STOPPED_Pos (1UL)          /*!< Position of STOPPED field.                                           */
  #define HFXO64M_INTPEND_STOPPED_Msk (0x1UL << HFXO64M_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                   */
  #define HFXO64M_INTPEND_STOPPED_Min (0x0UL)        /*!< Min enumerator value of STOPPED field.                               */
  #define HFXO64M_INTPEND_STOPPED_Max (0x1UL)        /*!< Max enumerator value of STOPPED field.                               */
  #define HFXO64M_INTPEND_STOPPED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define HFXO64M_INTPEND_STOPPED_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* ERRORBIAS @Bit 2 : Read pending status of interrupt for event ERRORBIAS */
  #define HFXO64M_INTPEND_ERRORBIAS_Pos (2UL)        /*!< Position of ERRORBIAS field.                                         */
  #define HFXO64M_INTPEND_ERRORBIAS_Msk (0x1UL << HFXO64M_INTPEND_ERRORBIAS_Pos) /*!< Bit mask of ERRORBIAS field.             */
  #define HFXO64M_INTPEND_ERRORBIAS_Min (0x0UL)      /*!< Min enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTPEND_ERRORBIAS_Max (0x1UL)      /*!< Max enumerator value of ERRORBIAS field.                             */
  #define HFXO64M_INTPEND_ERRORBIAS_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define HFXO64M_INTPEND_ERRORBIAS_Pending (0x1UL)  /*!< Read: Pending                                                        */

/* ERRORDETECTOR @Bit 3 : Read pending status of interrupt for event ERRORDETECTOR */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Pos (3UL)    /*!< Position of ERRORDETECTOR field.                                     */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Msk (0x1UL << HFXO64M_INTPEND_ERRORDETECTOR_Pos) /*!< Bit mask of ERRORDETECTOR field. */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Min (0x0UL)  /*!< Min enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Max (0x1UL)  /*!< Max enumerator value of ERRORDETECTOR field.                         */
  #define HFXO64M_INTPEND_ERRORDETECTOR_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define HFXO64M_INTPEND_ERRORDETECTOR_Pending (0x1UL) /*!< Read: Pending                                                     */

