NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* IPCT_INTEN1: Enable or disable interrupt */
  #define IPCT_INTEN1_ResetValue (0x00000000UL)      /*!< Reset value of INTEN1 register.                                      */

/* RECEIVE0 @Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
  #define IPCT_INTEN1_RECEIVE0_Pos (0UL)             /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTEN1_RECEIVE0_Msk (0x1UL << IPCT_INTEN1_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                        */
  #define IPCT_INTEN1_RECEIVE0_Min (0x0UL)           /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN1_RECEIVE0_Max (0x1UL)           /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTEN1_RECEIVE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE1 @Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
  #define IPCT_INTEN1_RECEIVE1_Pos (1UL)             /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTEN1_RECEIVE1_Msk (0x1UL << IPCT_INTEN1_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                        */
  #define IPCT_INTEN1_RECEIVE1_Min (0x0UL)           /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN1_RECEIVE1_Max (0x1UL)           /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTEN1_RECEIVE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE2 @Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
  #define IPCT_INTEN1_RECEIVE2_Pos (2UL)             /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTEN1_RECEIVE2_Msk (0x1UL << IPCT_INTEN1_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                        */
  #define IPCT_INTEN1_RECEIVE2_Min (0x0UL)           /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN1_RECEIVE2_Max (0x1UL)           /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTEN1_RECEIVE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE2_Enabled (0x1UL)       /*!< Enable                                                               */

/* RECEIVE3 @Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
  #define IPCT_INTEN1_RECEIVE3_Pos (3UL)             /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTEN1_RECEIVE3_Msk (0x1UL << IPCT_INTEN1_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                        */
  #define IPCT_INTEN1_RECEIVE3_Min (0x0UL)           /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN1_RECEIVE3_Max (0x1UL)           /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTEN1_RECEIVE3_Disabled (0x0UL)      /*!< Disable                                                              */
  #define IPCT_INTEN1_RECEIVE3_Enabled (0x1UL)       /*!< Enable                                                               */

/* READY0 @Bit 16 : Enable or disable interrupt for event READY[0] */
  #define IPCT_INTEN1_READY0_Pos (16UL)              /*!< Position of READY0 field.                                            */
  #define IPCT_INTEN1_READY0_Msk (0x1UL << IPCT_INTEN1_READY0_Pos) /*!< Bit mask of READY0 field.                              */
  #define IPCT_INTEN1_READY0_Min (0x0UL)             /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTEN1_READY0_Max (0x1UL)             /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTEN1_READY0_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY0_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY1 @Bit 17 : Enable or disable interrupt for event READY[1] */
  #define IPCT_INTEN1_READY1_Pos (17UL)              /*!< Position of READY1 field.                                            */
  #define IPCT_INTEN1_READY1_Msk (0x1UL << IPCT_INTEN1_READY1_Pos) /*!< Bit mask of READY1 field.                              */
  #define IPCT_INTEN1_READY1_Min (0x0UL)             /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTEN1_READY1_Max (0x1UL)             /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTEN1_READY1_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY1_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY2 @Bit 18 : Enable or disable interrupt for event READY[2] */
  #define IPCT_INTEN1_READY2_Pos (18UL)              /*!< Position of READY2 field.                                            */
  #define IPCT_INTEN1_READY2_Msk (0x1UL << IPCT_INTEN1_READY2_Pos) /*!< Bit mask of READY2 field.                              */
  #define IPCT_INTEN1_READY2_Min (0x0UL)             /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTEN1_READY2_Max (0x1UL)             /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTEN1_READY2_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY2_Enabled (0x1UL)         /*!< Enable                                                               */

/* READY3 @Bit 19 : Enable or disable interrupt for event READY[3] */
  #define IPCT_INTEN1_READY3_Pos (19UL)              /*!< Position of READY3 field.                                            */
  #define IPCT_INTEN1_READY3_Msk (0x1UL << IPCT_INTEN1_READY3_Pos) /*!< Bit mask of READY3 field.                              */
  #define IPCT_INTEN1_READY3_Min (0x0UL)             /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTEN1_READY3_Max (0x1UL)             /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTEN1_READY3_Disabled (0x0UL)        /*!< Disable                                                              */
  #define IPCT_INTEN1_READY3_Enabled (0x1UL)         /*!< Enable                                                               */


/* IPCT_INTENSET1: Enable interrupt */
  #define IPCT_INTENSET1_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET1 register.                                   */

