NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* READY2 @Bit 18 : Write '1' to disable interrupt for event READY[2] */
  #define IPCT_INTENCLR3_READY2_Pos (18UL)           /*!< Position of READY2 field.                                            */
  #define IPCT_INTENCLR3_READY2_Msk (0x1UL << IPCT_INTENCLR3_READY2_Pos) /*!< Bit mask of READY2 field.                        */
  #define IPCT_INTENCLR3_READY2_Min (0x0UL)          /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTENCLR3_READY2_Max (0x1UL)          /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTENCLR3_READY2_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR3_READY2_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR3_READY2_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* READY3 @Bit 19 : Write '1' to disable interrupt for event READY[3] */
  #define IPCT_INTENCLR3_READY3_Pos (19UL)           /*!< Position of READY3 field.                                            */
  #define IPCT_INTENCLR3_READY3_Msk (0x1UL << IPCT_INTENCLR3_READY3_Pos) /*!< Bit mask of READY3 field.                        */
  #define IPCT_INTENCLR3_READY3_Min (0x0UL)          /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTENCLR3_READY3_Max (0x1UL)          /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTENCLR3_READY3_Clear (0x1UL)        /*!< Disable                                                              */
  #define IPCT_INTENCLR3_READY3_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define IPCT_INTENCLR3_READY3_Enabled (0x1UL)      /*!< Read: Enabled                                                        */


/* IPCT_INTPEND3: Pending interrupts */
  #define IPCT_INTPEND3_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND3 register.                                    */

/* RECEIVE0 @Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
  #define IPCT_INTPEND3_RECEIVE0_Pos (0UL)           /*!< Position of RECEIVE0 field.                                          */
  #define IPCT_INTPEND3_RECEIVE0_Msk (0x1UL << IPCT_INTPEND3_RECEIVE0_Pos) /*!< Bit mask of RECEIVE0 field.                    */
  #define IPCT_INTPEND3_RECEIVE0_Min (0x0UL)         /*!< Min enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTPEND3_RECEIVE0_Max (0x1UL)         /*!< Max enumerator value of RECEIVE0 field.                              */
  #define IPCT_INTPEND3_RECEIVE0_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_RECEIVE0_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE1 @Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
  #define IPCT_INTPEND3_RECEIVE1_Pos (1UL)           /*!< Position of RECEIVE1 field.                                          */
  #define IPCT_INTPEND3_RECEIVE1_Msk (0x1UL << IPCT_INTPEND3_RECEIVE1_Pos) /*!< Bit mask of RECEIVE1 field.                    */
  #define IPCT_INTPEND3_RECEIVE1_Min (0x0UL)         /*!< Min enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTPEND3_RECEIVE1_Max (0x1UL)         /*!< Max enumerator value of RECEIVE1 field.                              */
  #define IPCT_INTPEND3_RECEIVE1_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_RECEIVE1_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE2 @Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
  #define IPCT_INTPEND3_RECEIVE2_Pos (2UL)           /*!< Position of RECEIVE2 field.                                          */
  #define IPCT_INTPEND3_RECEIVE2_Msk (0x1UL << IPCT_INTPEND3_RECEIVE2_Pos) /*!< Bit mask of RECEIVE2 field.                    */
  #define IPCT_INTPEND3_RECEIVE2_Min (0x0UL)         /*!< Min enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTPEND3_RECEIVE2_Max (0x1UL)         /*!< Max enumerator value of RECEIVE2 field.                              */
  #define IPCT_INTPEND3_RECEIVE2_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_RECEIVE2_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* RECEIVE3 @Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
  #define IPCT_INTPEND3_RECEIVE3_Pos (3UL)           /*!< Position of RECEIVE3 field.                                          */
  #define IPCT_INTPEND3_RECEIVE3_Msk (0x1UL << IPCT_INTPEND3_RECEIVE3_Pos) /*!< Bit mask of RECEIVE3 field.                    */
  #define IPCT_INTPEND3_RECEIVE3_Min (0x0UL)         /*!< Min enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTPEND3_RECEIVE3_Max (0x1UL)         /*!< Max enumerator value of RECEIVE3 field.                              */
  #define IPCT_INTPEND3_RECEIVE3_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_RECEIVE3_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* READY0 @Bit 16 : Read pending status of interrupt for event READY[0] */
  #define IPCT_INTPEND3_READY0_Pos (16UL)            /*!< Position of READY0 field.                                            */
  #define IPCT_INTPEND3_READY0_Msk (0x1UL << IPCT_INTPEND3_READY0_Pos) /*!< Bit mask of READY0 field.                          */
  #define IPCT_INTPEND3_READY0_Min (0x0UL)           /*!< Min enumerator value of READY0 field.                                */
  #define IPCT_INTPEND3_READY0_Max (0x1UL)           /*!< Max enumerator value of READY0 field.                                */
  #define IPCT_INTPEND3_READY0_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_READY0_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY1 @Bit 17 : Read pending status of interrupt for event READY[1] */
  #define IPCT_INTPEND3_READY1_Pos (17UL)            /*!< Position of READY1 field.                                            */
  #define IPCT_INTPEND3_READY1_Msk (0x1UL << IPCT_INTPEND3_READY1_Pos) /*!< Bit mask of READY1 field.                          */
  #define IPCT_INTPEND3_READY1_Min (0x0UL)           /*!< Min enumerator value of READY1 field.                                */
  #define IPCT_INTPEND3_READY1_Max (0x1UL)           /*!< Max enumerator value of READY1 field.                                */
  #define IPCT_INTPEND3_READY1_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_READY1_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY2 @Bit 18 : Read pending status of interrupt for event READY[2] */
  #define IPCT_INTPEND3_READY2_Pos (18UL)            /*!< Position of READY2 field.                                            */
  #define IPCT_INTPEND3_READY2_Msk (0x1UL << IPCT_INTPEND3_READY2_Pos) /*!< Bit mask of READY2 field.                          */
  #define IPCT_INTPEND3_READY2_Min (0x0UL)           /*!< Min enumerator value of READY2 field.                                */
  #define IPCT_INTPEND3_READY2_Max (0x1UL)           /*!< Max enumerator value of READY2 field.                                */
  #define IPCT_INTPEND3_READY2_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_READY2_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* READY3 @Bit 19 : Read pending status of interrupt for event READY[3] */
  #define IPCT_INTPEND3_READY3_Pos (19UL)            /*!< Position of READY3 field.                                            */
  #define IPCT_INTPEND3_READY3_Msk (0x1UL << IPCT_INTPEND3_READY3_Pos) /*!< Bit mask of READY3 field.                          */
  #define IPCT_INTPEND3_READY3_Min (0x0UL)           /*!< Min enumerator value of READY3 field.                                */
  #define IPCT_INTPEND3_READY3_Max (0x1UL)           /*!< Max enumerator value of READY3 field.                                */
  #define IPCT_INTPEND3_READY3_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define IPCT_INTPEND3_READY3_Pending (0x1UL)       /*!< Read: Pending                                                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            KMU                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct KMU ======================================================== */
/**
  * @brief Key management unit
  */
  typedef struct {                                   /*!< KMU Structure                                                        */
    __OM uint32_t TASKS_PROVISION;                   /*!< (@ 0x00000000) Provision key slot                                    */
    __OM uint32_t TASKS_PUSH;                        /*!< (@ 0x00000004) Push key slot                                         */
    __OM uint32_t TASKS_REVOKE;                      /*!< (@ 0x00000008) Revoke key slot                                       */
    __OM uint32_t TASKS_READMETADATA;                /*!< (@ 0x0000000C) Read key slot metadata into METADATA register         */
    __OM uint32_t TASKS_PUSHBLOCK;                   /*!< (@ 0x00000010) Block only the PUSH operation of a key slot, preventing
                                                                         the key slot from being PUSHED until next reset. The
                                                                         task is kept for backwards compatibility.*/
    __OM uint32_t TASKS_BLOCK;                       /*!< (@ 0x00000014) Block the PROVISION, PUSH, and REVOKE operations of a
                                                                         key slot, preventing the key slot from being
                                                                         PROVISIONED, PUSHED, or REVOKED until next reset*/
    __IM uint32_t RESERVED[58];
    __IOM uint32_t EVENTS_PROVISIONED;               /*!< (@ 0x00000100) Key slot successfully provisioned                     */
    __IOM uint32_t EVENTS_PUSHED;                    /*!< (@ 0x00000104) Key slot successfully pushed                          */
    __IOM uint32_t EVENTS_REVOKED;                   /*!< (@ 0x00000108) Key slot has been revoked and can no longer be used   */
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x0000010C) Error generated during PROVISION, PUSH, READMETADATA or
                                                                         REVOKE operations. Triggering the PROVISION, PUSH and
                                                                         REVOKE tasks on a BLOCKED keyslot will also generate
                                                                         this event.*/
    __IOM uint32_t EVENTS_METADATAREAD;              /*!< (@ 0x00000110) Key slot metadata has been read into METADATA register*/
    __IOM uint32_t EVENTS_PUSHBLOCKED;               /*!< (@ 0x00000114) The PUSHBLOCK operation was successful. The event is
                                                                         kept for backwards compatibility.*/
    __IOM uint32_t EVENTS_BLOCKED;                   /*!< (@ 0x00000118) The BLOCK operation was successful                    */
    __IM uint32_t RESERVED1[185];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) KMU status register                                   */
    __IM uint32_t ERRORSTATUS;                       /*!< (@ 0x00000404) Error status and cause information                    */
    __IM uint32_t RESERVED2[62];
    __IOM uint32_t KEYSLOT;                          /*!< (@ 0x00000500) Select key slot to operate on                         */
    __IOM uint32_t SRC;                              /*!< (@ 0x00000504) Source address for provisioning                       */
    __IOM uint32_t METADATA;                         /*!< (@ 0x00000508) Key slot metadata as read by TASKS_READMETADATA.      */
    __IOM uint32_t METADATAEXT;                      /*!< (@ 0x0000050C) Second word of key slot metadata as read by
                                                                         TASKS_READMETADATA.*/
  } NRF_KMU_Type;                                    /*!< Size = 1296 (0x510)                                                  */

/* KMU_TASKS_PROVISION: Provision key slot */
  #define KMU_TASKS_PROVISION_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PROVISION register.                          */

/* TASKS_PROVISION @Bit 0 : Provision key slot */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Pos (0UL) /*!< Position of TASKS_PROVISION field.                                */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Msk (0x1UL << KMU_TASKS_PROVISION_TASKS_PROVISION_Pos) /*!< Bit mask of
                                                                            TASKS_PROVISION field.*/
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Min (0x1UL) /*!< Min enumerator value of TASKS_PROVISION field.                  */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Max (0x1UL) /*!< Max enumerator value of TASKS_PROVISION field.                  */
  #define KMU_TASKS_PROVISION_TASKS_PROVISION_Trigger (0x1UL) /*!< Trigger task                                                */


/* KMU_TASKS_PUSH: Push key slot */
  #define KMU_TASKS_PUSH_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_PUSH register.                                  */

/* TASKS_PUSH @Bit 0 : Push key slot */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Pos (0UL)        /*!< Position of TASKS_PUSH field.                                        */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Msk (0x1UL << KMU_TASKS_PUSH_TASKS_PUSH_Pos) /*!< Bit mask of TASKS_PUSH field.            */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Min (0x1UL)      /*!< Min enumerator value of TASKS_PUSH field.                            */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Max (0x1UL)      /*!< Max enumerator value of TASKS_PUSH field.                            */
  #define KMU_TASKS_PUSH_TASKS_PUSH_Trigger (0x1UL)  /*!< Trigger task                                                         */


/* KMU_TASKS_REVOKE: Revoke key slot */
  #define KMU_TASKS_REVOKE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_REVOKE register.                                */

/* TASKS_REVOKE @Bit 0 : Revoke key slot */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Pos (0UL)    /*!< Position of TASKS_REVOKE field.                                      */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Msk (0x1UL << KMU_TASKS_REVOKE_TASKS_REVOKE_Pos) /*!< Bit mask of TASKS_REVOKE field.  */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Min (0x1UL)  /*!< Min enumerator value of TASKS_REVOKE field.                          */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Max (0x1UL)  /*!< Max enumerator value of TASKS_REVOKE field.                          */
  #define KMU_TASKS_REVOKE_TASKS_REVOKE_Trigger (0x1UL) /*!< Trigger task                                                      */


/* KMU_TASKS_READMETADATA: Read key slot metadata into METADATA register */
  #define KMU_TASKS_READMETADATA_ResetValue (0x00000000UL) /*!< Reset value of TASKS_READMETADATA register.                    */

/* TASKS_READMETADATA @Bit 0 : Read key slot metadata into METADATA register */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Pos (0UL) /*!< Position of TASKS_READMETADATA field.                       */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Msk (0x1UL << KMU_TASKS_READMETADATA_TASKS_READMETADATA_Pos) /*!< Bit mask
                                                                            of TASKS_READMETADATA field.*/
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Min (0x1UL) /*!< Min enumerator value of TASKS_READMETADATA field.         */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Max (0x1UL) /*!< Max enumerator value of TASKS_READMETADATA field.         */
  #define KMU_TASKS_READMETADATA_TASKS_READMETADATA_Trigger (0x1UL) /*!< Trigger task                                          */


/* KMU_TASKS_PUSHBLOCK: Block only the PUSH operation of a key slot, preventing the key slot from being PUSHED until next reset.
                         The task is kept for backwards compatibility. */

  #define KMU_TASKS_PUSHBLOCK_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PUSHBLOCK register.                          */

