NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* EVENTS_METADATAREAD @Bit 0 : Key slot metadata has been read into METADATA register */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Pos (0UL) /*!< Position of EVENTS_METADATAREAD field.                    */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Msk (0x1UL << KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Pos) /*!< Bit
                                                                            mask of EVENTS_METADATAREAD field.*/
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Min (0x0UL) /*!< Min enumerator value of EVENTS_METADATAREAD field.      */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Max (0x1UL) /*!< Max enumerator value of EVENTS_METADATAREAD field.      */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Generated (0x1UL) /*!< Event generated                                   */


/* KMU_EVENTS_PUSHBLOCKED: The PUSHBLOCK operation was successful. The event is kept for backwards compatibility. */
  #define KMU_EVENTS_PUSHBLOCKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PUSHBLOCKED register.                    */

/* EVENTS_PUSHBLOCKED @Bit 0 : The PUSHBLOCK operation was successful. The event is kept for backwards compatibility. */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Pos (0UL) /*!< Position of EVENTS_PUSHBLOCKED field.                       */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Msk (0x1UL << KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Pos) /*!< Bit mask
                                                                            of EVENTS_PUSHBLOCKED field.*/
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PUSHBLOCKED field.         */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PUSHBLOCKED field.         */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Generated (0x1UL) /*!< Event generated                                     */


/* KMU_EVENTS_BLOCKED: The BLOCK operation was successful */
  #define KMU_EVENTS_BLOCKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_BLOCKED register.                            */

/* EVENTS_BLOCKED @Bit 0 : The BLOCK operation was successful */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Pos (0UL) /*!< Position of EVENTS_BLOCKED field.                                   */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Msk (0x1UL << KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Pos) /*!< Bit mask of EVENTS_BLOCKED
                                                                            field.*/
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_BLOCKED field.                     */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_BLOCKED field.                     */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define KMU_EVENTS_BLOCKED_EVENTS_BLOCKED_Generated (0x1UL) /*!< Event generated                                             */


/* KMU_STATUS: KMU status register */
  #define KMU_STATUS_ResetValue (0x00000000UL)       /*!< Reset value of STATUS register.                                      */

/* STATUS @Bit 0 : KMU status */
  #define KMU_STATUS_STATUS_Pos (0UL)                /*!< Position of STATUS field.                                            */
  #define KMU_STATUS_STATUS_Msk (0x1UL << KMU_STATUS_STATUS_Pos) /*!< Bit mask of STATUS field.                                */
  #define KMU_STATUS_STATUS_Min (0x0UL)              /*!< Min enumerator value of STATUS field.                                */
  #define KMU_STATUS_STATUS_Max (0x1UL)              /*!< Max enumerator value of STATUS field.                                */
  #define KMU_STATUS_STATUS_Ready (0x0UL)            /*!< KMU is ready for new operation                                       */
  #define KMU_STATUS_STATUS_Busy (0x1UL)             /*!< KMU is busy, an operation is in progress                             */


/* KMU_ERRORSTATUS: Error status and cause information */
  #define KMU_ERRORSTATUS_ResetValue (0x00000000UL)  /*!< Reset value of ERRORSTATUS register.                                 */

/* ERRORSTATUS @Bits 0..3 : Error information for last KMU operation */
  #define KMU_ERRORSTATUS_ERRORSTATUS_Pos (0UL)      /*!< Position of ERRORSTATUS field.                                       */
  #define KMU_ERRORSTATUS_ERRORSTATUS_Msk (0xFUL << KMU_ERRORSTATUS_ERRORSTATUS_Pos) /*!< Bit mask of ERRORSTATUS field.       */
  #define KMU_ERRORSTATUS_ERRORSTATUS_Min (0x0UL)    /*!< Min enumerator value of ERRORSTATUS field.                           */
  #define KMU_ERRORSTATUS_ERRORSTATUS_Max (0x8UL)    /*!< Max enumerator value of ERRORSTATUS field.                           */
  #define KMU_ERRORSTATUS_ERRORSTATUS_NoError (0x0UL) /*!< The last KMU operation had no errors                                */
  #define KMU_ERRORSTATUS_ERRORSTATUS_ProvAlreadyProv (0x1UL) /*!< TASKS_PROVISION failed due to keyslot already provisioned   */
  #define KMU_ERRORSTATUS_ERRORSTATUS_ProvSrcError (0x2UL) /*!< TASKS_PROVISION failed due to illegal SRC                      */
  #define KMU_ERRORSTATUS_ERRORSTATUS_ProvDestError (0x3UL) /*!< TASKS_PROVISION failed due to illegal DEST                    */
  #define KMU_ERRORSTATUS_ERRORSTATUS_PushNotProv (0x4UL) /*!< TASKS_PUSH failed due to keyslot revoked or not provisioned     */
  #define KMU_ERRORSTATUS_ERRORSTATUS_RevokeNotProv (0x5UL) /*!< TASKS_REVOKE failed due to keyslot already revoked, not
                                                                 provisioned or LOCKED revocation policy*/
  #define KMU_ERRORSTATUS_ERRORSTATUS_ReadmetaNotProv (0x6UL) /*!< TASKS_READMETADATA failed due to keyslot revoked or not
                                                                   provisioned*/
  #define KMU_ERRORSTATUS_ERRORSTATUS_KeyslotBlocked (0x7UL) /*!< Failed TASKS_PROVISION, TASKS_PUSH or TASKS_REVOKE due to
                                                                  keyslot blocked*/
  #define KMU_ERRORSTATUS_ERRORSTATUS_KeyslotPushblocked (0x8UL) /*!< Failed TASKS_PUSH due to keyslot pushblocked             */

/* LOCKUPSTATUS @Bits 8..10 : Status on KMU lockup */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_Pos (8UL)     /*!< Position of LOCKUPSTATUS field.                                      */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_Msk (0x7UL << KMU_ERRORSTATUS_LOCKUPSTATUS_Pos) /*!< Bit mask of LOCKUPSTATUS field.    */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_Min (0x0UL)   /*!< Min enumerator value of LOCKUPSTATUS field.                          */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_Max (0x4UL)   /*!< Max enumerator value of LOCKUPSTATUS field.                          */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_NoLockup (0x0UL) /*!< KMU is not in lockup state                                        */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_LockupPush (0x1UL) /*!< KMU is in lockup state due to a bus fault during TASKS_PUSH     */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_LockupProvision (0x2UL) /*!< KMU is in lockup state due to a bus fault during
                                                                    TASKS_PROVISION*/
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_LockupRevoke (0x3UL) /*!< KMU is in lockup state due to a bus fault during TASKS_REVOKE */
  #define KMU_ERRORSTATUS_LOCKUPSTATUS_LockupReadmeta (0x4UL) /*!< KMU is in lockup state due to a bus fault during
                                                                   TASKS_READMETADATA*/


/* KMU_KEYSLOT: Select key slot to operate on */
  #define KMU_KEYSLOT_ResetValue (0x00000000UL)      /*!< Reset value of KEYSLOT register.                                     */

/* ID @Bits 0..7 : Select key slot ID to provision, push, read METADATA, revoke or block when the corresponding task is
                   triggered. */

  #define KMU_KEYSLOT_ID_Pos (0UL)                   /*!< Position of ID field.                                                */
  #define KMU_KEYSLOT_ID_Msk (0xFFUL << KMU_KEYSLOT_ID_Pos) /*!< Bit mask of ID field.                                         */
  #define KMU_KEYSLOT_ID_Min (0x00UL)                /*!< Min value of ID field.                                               */
  #define KMU_KEYSLOT_ID_Max (0xF9UL)                /*!< Max size of ID field.                                                */


/* KMU_SRC: Source address for provisioning */
  #define KMU_SRC_ResetValue (0x00000000UL)          /*!< Reset value of SRC register.                                         */

