NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* SRC @Bits 0..31 : Source address for TASKS_PROVISION. */
  #define KMU_SRC_SRC_Pos (0UL)                      /*!< Position of SRC field.                                               */
  #define KMU_SRC_SRC_Msk (0xFFFFFFFFUL << KMU_SRC_SRC_Pos) /*!< Bit mask of SRC field.                                        */


/* KMU_METADATA: Key slot metadata as read by TASKS_READMETADATA. */
  #define KMU_METADATA_ResetValue (0x00000000UL)     /*!< Reset value of METADATA register.                                    */

/* METADATA @Bits 0..31 : Read metadata. */
  #define KMU_METADATA_METADATA_Pos (0UL)            /*!< Position of METADATA field.                                          */
  #define KMU_METADATA_METADATA_Msk (0xFFFFFFFFUL << KMU_METADATA_METADATA_Pos) /*!< Bit mask of METADATA field.               */


/* KMU_METADATAEXT: Second word of key slot metadata as read by TASKS_READMETADATA. */
  #define KMU_METADATAEXT_ResetValue (0x00000000UL)  /*!< Reset value of METADATAEXT register.                                 */

/* METADATAEXT @Bits 0..31 : Read metadata. */
  #define KMU_METADATAEXT_METADATAEXT_Pos (0UL)      /*!< Position of METADATAEXT field.                                       */
  #define KMU_METADATAEXT_METADATAEXT_Msk (0xFFFFFFFFUL << KMU_METADATAEXT_METADATAEXT_Pos) /*!< Bit mask of METADATAEXT field.*/


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           LFRC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ===================================================== Struct LFRC_CAL ===================================================== */
/**
  * @brief CAL [LFRC_CAL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LENGTH;                            /*!< (@ 0x00000000) Measurement cycle count length used while calibration */
} NRF_LFRC_CAL_Type;                                 /*!< Size = 4 (0x004)                                                     */

/* LFRC_CAL_LENGTH: Measurement cycle count length used while calibration */
  #define LFRC_CAL_LENGTH_ResetValue (0x00000002UL)  /*!< Reset value of LENGTH register.                                      */

/* LENGTH @Bits 0..2 : Number of cycles */
  #define LFRC_CAL_LENGTH_LENGTH_Pos (0UL)           /*!< Position of LENGTH field.                                            */
  #define LFRC_CAL_LENGTH_LENGTH_Msk (0x7UL << LFRC_CAL_LENGTH_LENGTH_Pos) /*!< Bit mask of LENGTH field.                      */
  #define LFRC_CAL_LENGTH_LENGTH_Min (0x0UL)         /*!< Min enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_Max (0x3UL)         /*!< Max enumerator value of LENGTH field.                                */
  #define LFRC_CAL_LENGTH_LENGTH_N64 (0x0UL)         /*!< 64 cycles                                                            */
  #define LFRC_CAL_LENGTH_LENGTH_N128 (0x1UL)        /*!< 128 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N256 (0x2UL)        /*!< 256 cycles                                                           */
  #define LFRC_CAL_LENGTH_LENGTH_N512 (0x3UL)        /*!< 512 cycles                                                           */


/* ======================================================= Struct LFRC ======================================================= */
/**
  * @brief LFRC peripheral
  */
  typedef struct {                                   /*!< LFRC Structure                                                       */
    __OM uint32_t TASKS_CAL;                         /*!< (@ 0x00000000) Start the calibration of RC oscillator                */
    __OM uint32_t TASKS_CANCELCAL;                   /*!< (@ 0x00000004) Cancel the calibration                                */
    __IM uint32_t RESERVED[62];
    __IOM uint32_t EVENTS_CALDONE;                   /*!< (@ 0x00000100) Calibration done                                      */
    __IOM uint32_t EVENTS_TRIMDONE;                  /*!< (@ 0x00000104) Trim done                                             */
    __IOM uint32_t EVENTS_TRIMERROR;                 /*!< (@ 0x00000108) Trim error                                            */
    __IOM uint32_t EVENTS_CKSYNSTARTED;              /*!< (@ 0x0000010C) Synth clock started                                   */
    __IOM uint32_t EVENTS_CKLFRCSTARTED;             /*!< (@ 0x00000110) LFRC clock started                                    */
    __IM uint32_t RESERVED1[123];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[68];
    __IOM NRF_LFRC_CAL_Type CAL;                     /*!< (@ 0x00000420) (unspecified)                                         */
  } NRF_LFRC_Type;                                   /*!< Size = 1060 (0x424)                                                  */

/* LFRC_TASKS_CAL: Start the calibration of RC oscillator */
  #define LFRC_TASKS_CAL_ResetValue (0x00000000UL)   /*!< Reset value of TASKS_CAL register.                                   */

/* TASKS_CAL @Bit 0 : Start the calibration of RC oscillator */
  #define LFRC_TASKS_CAL_TASKS_CAL_Pos (0UL)         /*!< Position of TASKS_CAL field.                                         */
  #define LFRC_TASKS_CAL_TASKS_CAL_Msk (0x1UL << LFRC_TASKS_CAL_TASKS_CAL_Pos) /*!< Bit mask of TASKS_CAL field.               */
  #define LFRC_TASKS_CAL_TASKS_CAL_Min (0x1UL)       /*!< Min enumerator value of TASKS_CAL field.                             */
  #define LFRC_TASKS_CAL_TASKS_CAL_Max (0x1UL)       /*!< Max enumerator value of TASKS_CAL field.                             */
  #define LFRC_TASKS_CAL_TASKS_CAL_Trigger (0x1UL)   /*!< Trigger task                                                         */


/* LFRC_TASKS_CANCELCAL: Cancel the calibration */
  #define LFRC_TASKS_CANCELCAL_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CANCELCAL register.                         */

