NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* DFS @Bits 0..5 : (unspecified) */
  #define MSPI_FORMAT_DFS_DFS_Pos (0UL)              /*!< Position of DFS field.                                               */
  #define MSPI_FORMAT_DFS_DFS_Msk (0x3FUL << MSPI_FORMAT_DFS_DFS_Pos) /*!< Bit mask of DFS field.                              */


/* MSPI_FORMAT_BPP: Bits per pixel */
  #define MSPI_FORMAT_BPP_ResetValue (0x00000000UL)  /*!< Reset value of BPP register.                                         */

/* BPP @Bits 0..5 : (unspecified) */
  #define MSPI_FORMAT_BPP_BPP_Pos (0UL)              /*!< Position of BPP field.                                               */
  #define MSPI_FORMAT_BPP_BPP_Msk (0x3FUL << MSPI_FORMAT_BPP_BPP_Pos) /*!< Bit mask of BPP field.                              */
  #define MSPI_FORMAT_BPP_BPP_Min (0x00UL)           /*!< Min enumerator value of BPP field.                                   */
  #define MSPI_FORMAT_BPP_BPP_Max (0x10UL)           /*!< Max enumerator value of BPP field.                                   */
  #define MSPI_FORMAT_BPP_BPP_0 (0x00UL)             /*!< Reordering of pixels disabled                                        */
  #define MSPI_FORMAT_BPP_BPP_4 (0x04UL)             /*!< 4 Bits per pixel                                                     */
  #define MSPI_FORMAT_BPP_BPP_8 (0x08UL)             /*!< 8 Bits per pixel                                                     */
  #define MSPI_FORMAT_BPP_BPP_16 (0x10UL)            /*!< 16 Bits per pixel                                                    */


/* MSPI_FORMAT_PIXELS: Number of pixels following the command */
  #define MSPI_FORMAT_PIXELS_ResetValue (0x00000000UL) /*!< Reset value of PIXELS register.                                    */

/* PIXELS @Bits 0..17 : Number of pixels */
  #define MSPI_FORMAT_PIXELS_PIXELS_Pos (0UL)        /*!< Position of PIXELS field.                                            */
  #define MSPI_FORMAT_PIXELS_PIXELS_Msk (0x3FFFFUL << MSPI_FORMAT_PIXELS_PIXELS_Pos) /*!< Bit mask of PIXELS field.            */


/* MSPI_FORMAT_CILEN: Command/Instruction length */
  #define MSPI_FORMAT_CILEN_ResetValue (0x00000000UL) /*!< Reset value of CILEN register.                                      */

/* CILEN @Bits 0..1 : Number of words */
  #define MSPI_FORMAT_CILEN_CILEN_Pos (0UL)          /*!< Position of CILEN field.                                             */
  #define MSPI_FORMAT_CILEN_CILEN_Msk (0x3UL << MSPI_FORMAT_CILEN_CILEN_Pos) /*!< Bit mask of CILEN field.                     */


/* MSPI_FORMAT_BITORDER: This register selects if the data collected from system memory is transmitted MSB first or LSB first. */
  #define MSPI_FORMAT_BITORDER_ResetValue (0x00000000UL) /*!< Reset value of BITORDER register.                                */

/* COMMAND @Bit 0 : Selects the bit order of command and address */
  #define MSPI_FORMAT_BITORDER_COMMAND_Pos (0UL)     /*!< Position of COMMAND field.                                           */
  #define MSPI_FORMAT_BITORDER_COMMAND_Msk (0x1UL << MSPI_FORMAT_BITORDER_COMMAND_Pos) /*!< Bit mask of COMMAND field.         */
  #define MSPI_FORMAT_BITORDER_COMMAND_Min (0x0UL)   /*!< Min enumerator value of COMMAND field.                               */
  #define MSPI_FORMAT_BITORDER_COMMAND_Max (0x1UL)   /*!< Max enumerator value of COMMAND field.                               */
  #define MSPI_FORMAT_BITORDER_COMMAND_MSB (0x0UL)   /*!< Transmit MSB first                                                   */
  #define MSPI_FORMAT_BITORDER_COMMAND_LSB (0x1UL)   /*!< Transmit LSB first                                                   */

/* DATA @Bit 1 : Selects the bit order of data */
  #define MSPI_FORMAT_BITORDER_DATA_Pos (1UL)        /*!< Position of DATA field.                                              */
  #define MSPI_FORMAT_BITORDER_DATA_Msk (0x1UL << MSPI_FORMAT_BITORDER_DATA_Pos) /*!< Bit mask of DATA field.                  */
  #define MSPI_FORMAT_BITORDER_DATA_Min (0x0UL)      /*!< Min enumerator value of DATA field.                                  */
  #define MSPI_FORMAT_BITORDER_DATA_Max (0x1UL)      /*!< Max enumerator value of DATA field.                                  */
  #define MSPI_FORMAT_BITORDER_DATA_MSB (0x0UL)      /*!< Transmit MSB first                                                   */
  #define MSPI_FORMAT_BITORDER_DATA_LSB (0x1UL)      /*!< Transmit LSB first                                                   */



/* =================================================== Struct MSPI_CUSTCMD =================================================== */
/**
  * @brief CUSTCMD [MSPI_CUSTCMD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Custom command enable                                 */
  __IOM uint32_t  VALUE;                             /*!< (@ 0x00000004) Custom command value                                  */
} NRF_MSPI_CUSTCMD_Type;                             /*!< Size = 8 (0x008)                                                     */

/* MSPI_CUSTCMD_ENABLE: Custom command enable */
  #define MSPI_CUSTCMD_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                                   */

/* IO2 @Bit 0 : Enable custom command mode for IO2 */
  #define MSPI_CUSTCMD_ENABLE_IO2_Pos (0UL)          /*!< Position of IO2 field.                                               */
  #define MSPI_CUSTCMD_ENABLE_IO2_Msk (0x1UL << MSPI_CUSTCMD_ENABLE_IO2_Pos) /*!< Bit mask of IO2 field.                       */
  #define MSPI_CUSTCMD_ENABLE_IO2_Min (0x0UL)        /*!< Min enumerator value of IO2 field.                                   */
  #define MSPI_CUSTCMD_ENABLE_IO2_Max (0x1UL)        /*!< Max enumerator value of IO2 field.                                   */
  #define MSPI_CUSTCMD_ENABLE_IO2_Disabled (0x0UL)   /*!< (unspecified)                                                        */
  #define MSPI_CUSTCMD_ENABLE_IO2_Enabled (0x1UL)    /*!< (unspecified)                                                        */

/* IO3 @Bit 1 : Enable custom command mode for IO3 */
  #define MSPI_CUSTCMD_ENABLE_IO3_Pos (1UL)          /*!< Position of IO3 field.                                               */
  #define MSPI_CUSTCMD_ENABLE_IO3_Msk (0x1UL << MSPI_CUSTCMD_ENABLE_IO3_Pos) /*!< Bit mask of IO3 field.                       */
  #define MSPI_CUSTCMD_ENABLE_IO3_Min (0x0UL)        /*!< Min enumerator value of IO3 field.                                   */
  #define MSPI_CUSTCMD_ENABLE_IO3_Max (0x1UL)        /*!< Max enumerator value of IO3 field.                                   */
  #define MSPI_CUSTCMD_ENABLE_IO3_Disabled (0x0UL)   /*!< (unspecified)                                                        */
  #define MSPI_CUSTCMD_ENABLE_IO3_Enabled (0x1UL)    /*!< (unspecified)                                                        */


/* MSPI_CUSTCMD_VALUE: Custom command value */
  #define MSPI_CUSTCMD_VALUE_ResetValue (0x00000000UL) /*!< Reset value of VALUE register.                                     */

/* IO2 @Bit 0 : Value to override IO2 to in custom command mode */
  #define MSPI_CUSTCMD_VALUE_IO2_Pos (0UL)           /*!< Position of IO2 field.                                               */
  #define MSPI_CUSTCMD_VALUE_IO2_Msk (0x1UL << MSPI_CUSTCMD_VALUE_IO2_Pos) /*!< Bit mask of IO2 field.                         */

