NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* MSPI_DMA_CONFIG_LISTPARTTHRESH: Number of jobs to process before generating event EVENTS_DONE.LISTPART to signal that
                                    descriptor list is partially completed. */

  #define MSPI_DMA_CONFIG_LISTPARTTHRESH_ResetValue (0x00000000UL) /*!< Reset value of LISTPARTTHRESH register.                */

/* LISTPARTTHRESH @Bits 0..15 : Threshold value. */
  #define MSPI_DMA_CONFIG_LISTPARTTHRESH_LISTPARTTHRESH_Pos (0UL) /*!< Position of LISTPARTTHRESH field.                       */
  #define MSPI_DMA_CONFIG_LISTPARTTHRESH_LISTPARTTHRESH_Msk (0xFFFFUL << MSPI_DMA_CONFIG_LISTPARTTHRESH_LISTPARTTHRESH_Pos) /*!<
                                                                            Bit mask of LISTPARTTHRESH field.*/



/* ===================================================== Struct MSPI_DMA ===================================================== */
/**
  * @brief DMA [MSPI_DMA] (unspecified)
  */
typedef struct {
  __IOM NRF_MSPI_DMA_STATUS_Type STATUS;             /*!< (@ 0x00000000) EasyVDMA status registers.                            */
  __IM  uint32_t  RESERVED[57];
  __IOM NRF_MSPI_DMA_CONFIG_Type CONFIG;             /*!< (@ 0x00000100) EasyVDMA configuration registers                      */
} NRF_MSPI_DMA_Type;                                 /*!< Size = 268 (0x10C)                                                   */


/* ============================================= Struct MSPI_CONTROLLERCORE_CORE ============================================= */
/**
  * @brief CORE [MSPI_CONTROLLERCORE_CORE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CTRLR0;                            /*!< (@ 0x00000000) Control Register 0                                    */
  __IOM uint32_t  CTRLR1;                            /*!< (@ 0x00000004) Control Register 1                                    */
  __IOM uint32_t  SSIENR;                            /*!< (@ 0x00000008) SSI Enable Register                                   */
  __IOM uint32_t  MWCR;                              /*!< (@ 0x0000000C) Microwire Control Register                            */
  __IOM uint32_t  SER;                               /*!< (@ 0x00000010) Target Enable Register                                */
  __IOM uint32_t  BAUDR;                             /*!< (@ 0x00000014) Baud Rate Select                                      */
  __IOM uint32_t  TXFTLR;                            /*!< (@ 0x00000018) Transmit FIFO Threshold Level                         */
  __IOM uint32_t  RXFTLR;                            /*!< (@ 0x0000001C) Receive FIFO Threshold Level                          */
  __IOM uint32_t  TXFLR;                             /*!< (@ 0x00000020) Transmit FIFO Level Register                          */
  __IOM uint32_t  RXFLR;                             /*!< (@ 0x00000024) Receive FIFO Level Register                           */
  __IOM uint32_t  SR;                                /*!< (@ 0x00000028) Status Register                                       */
  __IOM uint32_t  IMR;                               /*!< (@ 0x0000002C) Interrupt Mask Register                               */
  __IOM uint32_t  ISR;                               /*!< (@ 0x00000030) Interrupt Status Register                             */
  __IOM uint32_t  RISR;                              /*!< (@ 0x00000034) Raw Interrupt Status Register                         */
  __IOM uint32_t  TXEICR;                            /*!< (@ 0x00000038) Transmit FIFO Error Interrupt Clear Register Register */
  __IOM uint32_t  RXOICR;                            /*!< (@ 0x0000003C) Receive FIFO Overflow Interrupt Clear Register        */
  __IOM uint32_t  RXUICR;                            /*!< (@ 0x00000040) Receive FIFO Underflow Interrupt Clear Register       */
  __IOM uint32_t  MSTICR;                            /*!< (@ 0x00000044) Multi-Controller Interrupt Clear Register             */
  __IOM uint32_t  ICR;                               /*!< (@ 0x00000048) Interrupt Clear Register                              */
  __IOM uint32_t  DMACR;                             /*!< (@ 0x0000004C) DMA Control Register                                  */
  __IOM uint32_t  DMATDLR;                           /*!< (@ 0x00000050) DMA Transmit Data Level                               */
  __IOM uint32_t  DMARDLR;                           /*!< (@ 0x00000054) DMA Receive Data Level                                */
  __IOM uint32_t  IDR;                               /*!< (@ 0x00000058) Identification Register                               */
  __IOM uint32_t  SSICVERSIONID;                     /*!< (@ 0x0000005C) MSPI CORE component version                           */
  __IOM uint32_t  DR[36];                            /*!< (@ 0x00000060) MSPI CORE Data Register 0                             */
  __IOM uint32_t  RXSAMPLEDELAY;                     /*!< (@ 0x000000F0) RX Sample Delay Register                              */
  __IOM uint32_t  SPICTRLR0;                         /*!< (@ 0x000000F4) SPI_CTRLR0 - SPI Control Register                     */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  SPICTRLR1;                         /*!< (@ 0x00000118) SPI Control 1 register                                */
  __IOM uint32_t  SPITECR;                           /*!< (@ 0x0000011C) SPI Transmit Error Interrupt Clear Register           */
  __IM  uint32_t  RESERVED1[56];
} NRF_MSPI_CONTROLLERCORE_CORE_Type;                 /*!< Size = 512 (0x200)                                                   */

/* MSPI_CONTROLLERCORE_CORE_CTRLR0: Control Register 0 */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_ResetValue (0x00000007UL) /*!< Reset value of CTRLR0 register.                       */

/* DFS @Bits 0..4 : Data Frame Size. */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_Pos (0UL) /*!< Position of DFS field.                                            */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_Msk (0x1FUL << MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_Pos) /*!< Bit mask of DFS
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_Min (0x03UL) /*!< Min enumerator value of DFS field.                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_Max (0x1FUL) /*!< Max enumerator value of DFS field.                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_04_BIT (0x03UL) /*!< 04-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_05_BIT (0x04UL) /*!< 05-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_06_BIT (0x05UL) /*!< 06-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_07_BIT (0x06UL) /*!< 07-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_08_BIT (0x07UL) /*!< 08-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_09_BIT (0x08UL) /*!< 09-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_10_BIT (0x09UL) /*!< 10-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_11_BIT (0x0AUL) /*!< 11-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_12_BIT (0x0BUL) /*!< 12-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_13_BIT (0x0CUL) /*!< 13-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_14_BIT (0x0DUL) /*!< 14-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_15_BIT (0x0EUL) /*!< 15-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_16_BIT (0x0FUL) /*!< 16-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_17_BIT (0x10UL) /*!< 17-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_18_BIT (0x11UL) /*!< 18-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_19_BIT (0x12UL) /*!< 19-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_20_BIT (0x13UL) /*!< 20-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_21_BIT (0x14UL) /*!< 21-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_22_BIT (0x15UL) /*!< 22-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_23_BIT (0x16UL) /*!< 23-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_24_BIT (0x17UL) /*!< 24-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_25_BIT (0x18UL) /*!< 25-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_26_BIT (0x19UL) /*!< 26-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_27_BIT (0x1AUL) /*!< 27-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_28_BIT (0x1BUL) /*!< 28-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_29_BIT (0x1CUL) /*!< 29-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_30_BIT (0x1DUL) /*!< 30-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_31_BIT (0x1EUL) /*!< 31-bit serial data transfer                             */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_DFS_DFS_32_BIT (0x1FUL) /*!< 32-bit serial data transfer                             */

/* RSVDCTRLR05 @Bit 5 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR05_Pos (5UL) /*!< Position of RSVDCTRLR05 field.                            */
  #define MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR05_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_CTRLR0_RSVDCTRLR05_Pos) /*!< Bit
                                                                            mask of RSVDCTRLR05 field.*/

