NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* TXEIM @Bit 0 : Transmit FIFO Empty Interrupt Mask */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXEIM_Pos (0UL) /*!< Position of TXEIM field.                                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXEIM_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_TXEIM_Pos) /*!< Bit mask of TXEIM
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXEIM_Min (0x0UL) /*!< Min enumerator value of TXEIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXEIM_Max (0x1UL) /*!< Max enumerator value of TXEIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXEIM_MASKED (0x0UL) /*!< ssi_txe_intr interrupt is masked                              */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXEIM_UNMASKED (0x1UL) /*!< ssi_txe_intr interrupt is not masked                        */

/* TXOIM @Bit 1 : Transmit FIFO Overflow Interrupt Mask */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXOIM_Pos (1UL) /*!< Position of TXOIM field.                                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXOIM_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_TXOIM_Pos) /*!< Bit mask of TXOIM
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXOIM_Min (0x0UL) /*!< Min enumerator value of TXOIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXOIM_Max (0x1UL) /*!< Max enumerator value of TXOIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXOIM_MASKED (0x0UL) /*!< ssi_txo_intr interrupt is masked                              */
  #define MSPI_CONTROLLERCORE_CORE_IMR_TXOIM_UNMASKED (0x1UL) /*!< ssi_txo_intr interrupt is not masked                        */

/* RXUIM @Bit 2 : Receive FIFO Underflow Interrupt Mask */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXUIM_Pos (2UL) /*!< Position of RXUIM field.                                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXUIM_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RXUIM_Pos) /*!< Bit mask of RXUIM
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXUIM_Min (0x0UL) /*!< Min enumerator value of RXUIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXUIM_Max (0x1UL) /*!< Max enumerator value of RXUIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXUIM_MASKED (0x0UL) /*!< ssi_rxu_intr interrupt is masked                              */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXUIM_UNMASKED (0x1UL) /*!< ssi_rxu_intr interrupt is not masked                        */

/* RXOIM @Bit 3 : Receive FIFO Overflow Interrupt Mask */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXOIM_Pos (3UL) /*!< Position of RXOIM field.                                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXOIM_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RXOIM_Pos) /*!< Bit mask of RXOIM
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXOIM_Min (0x0UL) /*!< Min enumerator value of RXOIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXOIM_Max (0x1UL) /*!< Max enumerator value of RXOIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXOIM_MASKED (0x0UL) /*!< ssi_rxo_intr interrupt is masked                              */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXOIM_UNMASKED (0x1UL) /*!< ssi_rxo_intr interrupt is not masked                        */

/* RXFIM @Bit 4 : Receive FIFO Full Interrupt Mask */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXFIM_Pos (4UL) /*!< Position of RXFIM field.                                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXFIM_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RXFIM_Pos) /*!< Bit mask of RXFIM
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXFIM_Min (0x0UL) /*!< Min enumerator value of RXFIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXFIM_Max (0x1UL) /*!< Max enumerator value of RXFIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXFIM_MASKED (0x0UL) /*!< ssi_rxf_intr interrupt is masked                              */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RXFIM_UNMASKED (0x1UL) /*!< ssi_rxf_intr interrupt is not masked                        */

/* MSTIM @Bit 5 : Multi-Controller Contention Interrupt Mask. This bit field is not present if the MSPI CORE is configured as a
                  serial-target device. */

  #define MSPI_CONTROLLERCORE_CORE_IMR_MSTIM_Pos (5UL) /*!< Position of MSTIM field.                                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_MSTIM_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_MSTIM_Pos) /*!< Bit mask of MSTIM
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_IMR_MSTIM_Min (0x0UL) /*!< Min enumerator value of MSTIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_MSTIM_Max (0x1UL) /*!< Max enumerator value of MSTIM field.                             */
  #define MSPI_CONTROLLERCORE_CORE_IMR_MSTIM_MASKED (0x0UL) /*!< ssi_mst_intr interrupt is masked                              */
  #define MSPI_CONTROLLERCORE_CORE_IMR_MSTIM_UNMASKED (0x1UL) /*!< ssi_mst_intr interrupt is not masked                        */

/* RSVDIMR6 @Bit 6 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR6_Pos (6UL) /*!< Position of RSVDIMR6 field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR6_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR6_Pos) /*!< Bit mask of
                                                                            RSVDIMR6 field.*/

/* RSVDIMR7 @Bit 7 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR7_Pos (7UL) /*!< Position of RSVDIMR7 field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR7_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR7_Pos) /*!< Bit mask of
                                                                            RSVDIMR7 field.*/

/* RSVDIMR8 @Bit 8 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR8_Pos (8UL) /*!< Position of RSVDIMR8 field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR8_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR8_Pos) /*!< Bit mask of
                                                                            RSVDIMR8 field.*/

/* RSVD9IMR @Bit 9 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVD9IMR_Pos (9UL) /*!< Position of RSVD9IMR field.                                     */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVD9IMR_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RSVD9IMR_Pos) /*!< Bit mask of
                                                                            RSVD9IMR field.*/

/* SPITEM @Bit 10 : SPI Transmit Error Interrupt Mask */
  #define MSPI_CONTROLLERCORE_CORE_IMR_SPITEM_Pos (10UL) /*!< Position of SPITEM field.                                        */
  #define MSPI_CONTROLLERCORE_CORE_IMR_SPITEM_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_SPITEM_Pos) /*!< Bit mask of SPITEM
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_IMR_SPITEM_Min (0x0UL) /*!< Min enumerator value of SPITEM field.                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_SPITEM_Max (0x1UL) /*!< Max enumerator value of SPITEM field.                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_SPITEM_MASKED (0x0UL) /*!< ssi_spite_intr interrupt is masked                           */
  #define MSPI_CONTROLLERCORE_CORE_IMR_SPITEM_UNMASKED (0x1UL) /*!< ssi_spite_intr interrupt is not masked                     */

/* RSVDIMR11 @Bit 11 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR11_Pos (11UL) /*!< Position of RSVDIMR11 field.                                  */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR11_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_IMR_RSVDIMR11_Pos) /*!< Bit mask of
                                                                            RSVDIMR11 field.*/

/* RSVD1231IMR @Bits 12..31 : (unspecified) */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVD1231IMR_Pos (12UL) /*!< Position of RSVD1231IMR field.                              */
  #define MSPI_CONTROLLERCORE_CORE_IMR_RSVD1231IMR_Msk (0xFFFFFUL << MSPI_CONTROLLERCORE_CORE_IMR_RSVD1231IMR_Pos) /*!< Bit mask
                                                                            of RSVD1231IMR field.*/


/* MSPI_CONTROLLERCORE_CORE_ISR: Interrupt Status Register */
  #define MSPI_CONTROLLERCORE_CORE_ISR_ResetValue (0x00000000UL) /*!< Reset value of ISR register.                             */

/* TXEIS @Bit 0 : Transmit FIFO Empty Interrupt Status */
  #define MSPI_CONTROLLERCORE_CORE_ISR_TXEIS_Pos (0UL) /*!< Position of TXEIS field.                                           */
  #define MSPI_CONTROLLERCORE_CORE_ISR_TXEIS_Msk (0x1UL << MSPI_CONTROLLERCORE_CORE_ISR_TXEIS_Pos) /*!< Bit mask of TXEIS
                                                                            field.*/
  #define MSPI_CONTROLLERCORE_CORE_ISR_TXEIS_Min (0x0UL) /*!< Min enumerator value of TXEIS field.                             */
  #define MSPI_CONTROLLERCORE_CORE_ISR_TXEIS_Max (0x1UL) /*!< Max enumerator value of TXEIS field.                             */
  #define MSPI_CONTROLLERCORE_CORE_ISR_TXEIS_INACTIVE (0x0UL) /*!< ssi_txe_intr interrupt is not active after masking          */
  #define MSPI_CONTROLLERCORE_CORE_ISR_TXEIS_ACTIVE (0x1UL) /*!< ssi_txe_intr interrupt is active after masking                */

