NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* TFT @Bits 0..3 : Transmit FIFO Threshold. */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_TFT_Pos (0UL) /*!< Position of TFT field.                                            */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_TFT_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_TXFTLR_TFT_Pos) /*!< Bit mask of TFT
                                                                            field.*/

/* RSVDTXFTLR @Bits 4..15 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_RSVDTXFTLR_Pos (4UL) /*!< Position of RSVDTXFTLR field.                              */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_RSVDTXFTLR_Msk (0xFFFUL << MSPI_PERIPHERALCORE_CORE_TXFTLR_RSVDTXFTLR_Pos) /*!< Bit
                                                                            mask of RSVDTXFTLR field.*/

/* TXFTHR @Bits 16..19 : Transfer start FIFO level. */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_TXFTHR_Pos (16UL) /*!< Position of TXFTHR field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_TXFTHR_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_TXFTLR_TXFTHR_Pos) /*!< Bit mask of
                                                                            TXFTHR field.*/

/* RSVDTXFTHR @Bits 20..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_RSVDTXFTHR_Pos (20UL) /*!< Position of RSVDTXFTHR field.                             */
  #define MSPI_PERIPHERALCORE_CORE_TXFTLR_RSVDTXFTHR_Msk (0xFFFUL << MSPI_PERIPHERALCORE_CORE_TXFTLR_RSVDTXFTHR_Pos) /*!< Bit
                                                                            mask of RSVDTXFTHR field.*/


/* MSPI_PERIPHERALCORE_CORE_RXFTLR: Receive FIFO Threshold Level */
  #define MSPI_PERIPHERALCORE_CORE_RXFTLR_ResetValue (0x00000000UL) /*!< Reset value of RXFTLR register.                       */

/* RFT @Bits 0..3 : Receive FIFO Threshold. */
  #define MSPI_PERIPHERALCORE_CORE_RXFTLR_RFT_Pos (0UL) /*!< Position of RFT field.                                            */
  #define MSPI_PERIPHERALCORE_CORE_RXFTLR_RFT_Msk (0xFUL << MSPI_PERIPHERALCORE_CORE_RXFTLR_RFT_Pos) /*!< Bit mask of RFT
                                                                            field.*/

/* RSVDRXFTLR @Bits 4..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RXFTLR_RSVDRXFTLR_Pos (4UL) /*!< Position of RSVDRXFTLR field.                              */
  #define MSPI_PERIPHERALCORE_CORE_RXFTLR_RSVDRXFTLR_Msk (0xFFFFFFFUL << MSPI_PERIPHERALCORE_CORE_RXFTLR_RSVDRXFTLR_Pos) /*!<
                                                                            Bit mask of RSVDRXFTLR field.*/


/* MSPI_PERIPHERALCORE_CORE_TXFLR: Transmit FIFO Level Register */
  #define MSPI_PERIPHERALCORE_CORE_TXFLR_ResetValue (0x00000000UL) /*!< Reset value of TXFLR register.                         */

/* TXTFL @Bits 0..4 : Transmit FIFO Level. */
  #define MSPI_PERIPHERALCORE_CORE_TXFLR_TXTFL_Pos (0UL) /*!< Position of TXTFL field.                                         */
  #define MSPI_PERIPHERALCORE_CORE_TXFLR_TXTFL_Msk (0x1FUL << MSPI_PERIPHERALCORE_CORE_TXFLR_TXTFL_Pos) /*!< Bit mask of TXTFL
                                                                            field.*/

/* RSVDTXFLR @Bits 5..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_TXFLR_RSVDTXFLR_Pos (5UL) /*!< Position of RSVDTXFLR field.                                 */
  #define MSPI_PERIPHERALCORE_CORE_TXFLR_RSVDTXFLR_Msk (0x7FFFFFFUL << MSPI_PERIPHERALCORE_CORE_TXFLR_RSVDTXFLR_Pos) /*!< Bit
                                                                            mask of RSVDTXFLR field.*/


/* MSPI_PERIPHERALCORE_CORE_RXFLR: Receive FIFO Level Register */
  #define MSPI_PERIPHERALCORE_CORE_RXFLR_ResetValue (0x00000000UL) /*!< Reset value of RXFLR register.                         */

/* RXTFL @Bits 0..4 : Receive FIFO Level. */
  #define MSPI_PERIPHERALCORE_CORE_RXFLR_RXTFL_Pos (0UL) /*!< Position of RXTFL field.                                         */
  #define MSPI_PERIPHERALCORE_CORE_RXFLR_RXTFL_Msk (0x1FUL << MSPI_PERIPHERALCORE_CORE_RXFLR_RXTFL_Pos) /*!< Bit mask of RXTFL
                                                                            field.*/

/* RSVDRXFLR @Bits 5..31 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_RXFLR_RSVDRXFLR_Pos (5UL) /*!< Position of RSVDRXFLR field.                                 */
  #define MSPI_PERIPHERALCORE_CORE_RXFLR_RSVDRXFLR_Msk (0x7FFFFFFUL << MSPI_PERIPHERALCORE_CORE_RXFLR_RSVDRXFLR_Pos) /*!< Bit
                                                                            mask of RSVDRXFLR field.*/


/* MSPI_PERIPHERALCORE_CORE_SR: Status Register */
  #define MSPI_PERIPHERALCORE_CORE_SR_ResetValue (0x00000006UL) /*!< Reset value of SR register.                               */

/* BUSY @Bit 0 : SSI Busy Flag. */
  #define MSPI_PERIPHERALCORE_CORE_SR_BUSY_Pos (0UL) /*!< Position of BUSY field.                                              */
  #define MSPI_PERIPHERALCORE_CORE_SR_BUSY_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SR_BUSY_Pos) /*!< Bit mask of BUSY field.    */
  #define MSPI_PERIPHERALCORE_CORE_SR_BUSY_Min (0x0UL) /*!< Min enumerator value of BUSY field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_BUSY_Max (0x1UL) /*!< Max enumerator value of BUSY field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_BUSY_INACTIVE (0x0UL) /*!< MSPI CORE is idle or disabled                                 */
  #define MSPI_PERIPHERALCORE_CORE_SR_BUSY_ACTIVE (0x1UL) /*!< MSPI CORE is actively transferring data                         */

/* TFNF @Bit 1 : Transmit FIFO Not Full. */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFNF_Pos (1UL) /*!< Position of TFNF field.                                              */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFNF_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_SR_TFNF_Pos) /*!< Bit mask of TFNF field.    */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFNF_Min (0x0UL) /*!< Min enumerator value of TFNF field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFNF_Max (0x1UL) /*!< Max enumerator value of TFNF field.                                */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFNF_FULL (0x0UL) /*!< Tx FIFO is full                                                   */
  #define MSPI_PERIPHERALCORE_CORE_SR_TFNF_NOT_FULL (0x1UL) /*!< Tx FIFO is not Full                                           */

