NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* TXOIS @Bit 1 : Transmit FIFO Overflow Interrupt Status */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXOIS_Pos (1UL) /*!< Position of TXOIS field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXOIS_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_TXOIS_Pos) /*!< Bit mask of TXOIS
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXOIS_Min (0x0UL) /*!< Min enumerator value of TXOIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXOIS_Max (0x1UL) /*!< Max enumerator value of TXOIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXOIS_INACTIVE (0x0UL) /*!< ssi_txo_intr interrupt is not active after masking          */
  #define MSPI_PERIPHERALCORE_CORE_ISR_TXOIS_ACTIVE (0x1UL) /*!< ssi_txo_intr interrupt is active after masking                */

/* RXUIS @Bit 2 : Receive FIFO Underflow Interrupt Status */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXUIS_Pos (2UL) /*!< Position of RXUIS field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXUIS_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_RXUIS_Pos) /*!< Bit mask of RXUIS
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXUIS_Min (0x0UL) /*!< Min enumerator value of RXUIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXUIS_Max (0x1UL) /*!< Max enumerator value of RXUIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXUIS_INACTIVE (0x0UL) /*!< ssi_rxu_intr interrupt is not active after masking          */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXUIS_ACTIVE (0x1UL) /*!< ssi_rxu_intr interrupt is active after masking                */

/* RXOIS @Bit 3 : Receive FIFO Overflow Interrupt Status */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXOIS_Pos (3UL) /*!< Position of RXOIS field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXOIS_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_RXOIS_Pos) /*!< Bit mask of RXOIS
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXOIS_Min (0x0UL) /*!< Min enumerator value of RXOIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXOIS_Max (0x1UL) /*!< Max enumerator value of RXOIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXOIS_INACTIVE (0x0UL) /*!< ssi_rxo_intr interrupt is not active after masking          */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXOIS_ACTIVE (0x1UL) /*!< ssi_rxo_intr interrupt is active after masking                */

/* RXFIS @Bit 4 : Receive FIFO Full Interrupt Status */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXFIS_Pos (4UL) /*!< Position of RXFIS field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXFIS_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_RXFIS_Pos) /*!< Bit mask of RXFIS
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXFIS_Min (0x0UL) /*!< Min enumerator value of RXFIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXFIS_Max (0x1UL) /*!< Max enumerator value of RXFIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXFIS_INACTIVE (0x0UL) /*!< ssi_rxf_intr interrupt is not active after masking          */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RXFIS_ACTIVE (0x1UL) /*!< ssi_rxf_intr interrupt is active after masking                */

/* MSTIS @Bit 5 : Multi-Controller Contention Interrupt Status. This bit field is not present */
  #define MSPI_PERIPHERALCORE_CORE_ISR_MSTIS_Pos (5UL) /*!< Position of MSTIS field.                                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_MSTIS_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_MSTIS_Pos) /*!< Bit mask of MSTIS
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_ISR_MSTIS_Min (0x0UL) /*!< Min enumerator value of MSTIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_MSTIS_Max (0x1UL) /*!< Max enumerator value of MSTIS field.                             */
  #define MSPI_PERIPHERALCORE_CORE_ISR_MSTIS_INACTIVE (0x0UL) /*!< ssi_mst_intr interrupt is not active after masking          */
  #define MSPI_PERIPHERALCORE_CORE_ISR_MSTIS_ACTIVE (0x1UL) /*!< ssi_mst_intr interrupt is active after masking                */

/* RSVDISR6 @Bit 6 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR6_Pos (6UL) /*!< Position of RSVDISR6 field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR6_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR6_Pos) /*!< Bit mask of
                                                                            RSVDISR6 field.*/

/* RSVDISR7 @Bit 7 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR7_Pos (7UL) /*!< Position of RSVDISR7 field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR7_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR7_Pos) /*!< Bit mask of
                                                                            RSVDISR7 field.*/

/* RSVDISR8 @Bit 8 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR8_Pos (8UL) /*!< Position of RSVDISR8 field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR8_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_RSVDISR8_Pos) /*!< Bit mask of
                                                                            RSVDISR8 field.*/

/* RSVD9ISR @Bit 9 : (unspecified) */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVD9ISR_Pos (9UL) /*!< Position of RSVD9ISR field.                                     */
  #define MSPI_PERIPHERALCORE_CORE_ISR_RSVD9ISR_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_RSVD9ISR_Pos) /*!< Bit mask of
                                                                            RSVD9ISR field.*/

/* SPITES @Bit 10 : SPI Transmit Error Interrupt */
  #define MSPI_PERIPHERALCORE_CORE_ISR_SPITES_Pos (10UL) /*!< Position of SPITES field.                                        */
  #define MSPI_PERIPHERALCORE_CORE_ISR_SPITES_Msk (0x1UL << MSPI_PERIPHERALCORE_CORE_ISR_SPITES_Pos) /*!< Bit mask of SPITES
                                                                            field.*/
  #define MSPI_PERIPHERALCORE_CORE_ISR_SPITES_Min (0x0UL) /*!< Min enumerator value of SPITES field.                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_SPITES_Max (0x1UL) /*!< Max enumerator value of SPITES field.                           */
  #define MSPI_PERIPHERALCORE_CORE_ISR_SPITES_INACTIVE (0x0UL) /*!< ssi_spite_intr interrupt is not active after masking       */
  #define MSPI_PERIPHERALCORE_CORE_ISR_SPITES_ACTIVE (0x1UL) /*!< ssi_spite_intr interrupt is active after masking             */

