NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* MHS @Bit 2 : Microwire Handshaking. */
  #define MSPI_XIPCORE_CORE_MWCR_MHS_Pos (2UL)       /*!< Position of MHS field.                                               */
  #define MSPI_XIPCORE_CORE_MWCR_MHS_Msk (0x1UL << MSPI_XIPCORE_CORE_MWCR_MHS_Pos) /*!< Bit mask of MHS field.                 */
  #define MSPI_XIPCORE_CORE_MWCR_MHS_Min (0x0UL)     /*!< Min enumerator value of MHS field.                                   */
  #define MSPI_XIPCORE_CORE_MWCR_MHS_Max (0x1UL)     /*!< Max enumerator value of MHS field.                                   */
  #define MSPI_XIPCORE_CORE_MWCR_MHS_DISABLE (0x0UL) /*!< handshaking interface is disabled                                    */
  #define MSPI_XIPCORE_CORE_MWCR_MHS_ENABLED (0x1UL) /*!< handshaking interface is enabled                                     */

/* RSVDMWCR @Bits 3..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_MWCR_RSVDMWCR_Pos (3UL)  /*!< Position of RSVDMWCR field.                                          */
  #define MSPI_XIPCORE_CORE_MWCR_RSVDMWCR_Msk (0x1FFFFFFFUL << MSPI_XIPCORE_CORE_MWCR_RSVDMWCR_Pos) /*!< Bit mask of RSVDMWCR
                                                                            field.*/


/* MSPI_XIPCORE_CORE_SER: Target Enable Register */
  #define MSPI_XIPCORE_CORE_SER_ResetValue (0x00000000UL) /*!< Reset value of SER register.                                    */

/* SER @Bits 0..3 : Chip Select Enable Flag. */
  #define MSPI_XIPCORE_CORE_SER_SER_Pos (0UL)        /*!< Position of SER field.                                               */
  #define MSPI_XIPCORE_CORE_SER_SER_Msk (0xFUL << MSPI_XIPCORE_CORE_SER_SER_Pos) /*!< Bit mask of SER field.                   */

/* RSVDSER @Bits 4..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_SER_RSVDSER_Pos (4UL)    /*!< Position of RSVDSER field.                                           */
  #define MSPI_XIPCORE_CORE_SER_RSVDSER_Msk (0xFFFFFFFUL << MSPI_XIPCORE_CORE_SER_RSVDSER_Pos) /*!< Bit mask of RSVDSER field. */


/* MSPI_XIPCORE_CORE_BAUDR: Baud Rate Select */
  #define MSPI_XIPCORE_CORE_BAUDR_ResetValue (0x00000002UL) /*!< Reset value of BAUDR register.                                */

/* RSVDBAUDR0 @Bit 0 : (unspecified) */
  #define MSPI_XIPCORE_CORE_BAUDR_RSVDBAUDR0_Pos (0UL) /*!< Position of RSVDBAUDR0 field.                                      */
  #define MSPI_XIPCORE_CORE_BAUDR_RSVDBAUDR0_Msk (0x1UL << MSPI_XIPCORE_CORE_BAUDR_RSVDBAUDR0_Pos) /*!< Bit mask of RSVDBAUDR0
                                                                            field.*/

/* SCKDV @Bits 1..15 : SSI Clock Divider. */
  #define MSPI_XIPCORE_CORE_BAUDR_SCKDV_Pos (1UL)    /*!< Position of SCKDV field.                                             */
  #define MSPI_XIPCORE_CORE_BAUDR_SCKDV_Msk (0x7FFFUL << MSPI_XIPCORE_CORE_BAUDR_SCKDV_Pos) /*!< Bit mask of SCKDV field.      */

/* RSVDBAUDR1631 @Bits 16..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_BAUDR_RSVDBAUDR1631_Pos (16UL) /*!< Position of RSVDBAUDR1631 field.                               */
  #define MSPI_XIPCORE_CORE_BAUDR_RSVDBAUDR1631_Msk (0xFFFFUL << MSPI_XIPCORE_CORE_BAUDR_RSVDBAUDR1631_Pos) /*!< Bit mask of
                                                                            RSVDBAUDR1631 field.*/


/* MSPI_XIPCORE_CORE_TXFTLR: Transmit FIFO Threshold Level */
  #define MSPI_XIPCORE_CORE_TXFTLR_ResetValue (0x00080000UL) /*!< Reset value of TXFTLR register.                              */

/* TFT @Bits 0..3 : Transmit FIFO Threshold. */
  #define MSPI_XIPCORE_CORE_TXFTLR_TFT_Pos (0UL)     /*!< Position of TFT field.                                               */
  #define MSPI_XIPCORE_CORE_TXFTLR_TFT_Msk (0xFUL << MSPI_XIPCORE_CORE_TXFTLR_TFT_Pos) /*!< Bit mask of TFT field.             */

/* RSVDTXFTLR @Bits 4..15 : (unspecified) */
  #define MSPI_XIPCORE_CORE_TXFTLR_RSVDTXFTLR_Pos (4UL) /*!< Position of RSVDTXFTLR field.                                     */
  #define MSPI_XIPCORE_CORE_TXFTLR_RSVDTXFTLR_Msk (0xFFFUL << MSPI_XIPCORE_CORE_TXFTLR_RSVDTXFTLR_Pos) /*!< Bit mask of
                                                                            RSVDTXFTLR field.*/

/* TXFTHR @Bits 16..19 : Transfer start FIFO level. */
  #define MSPI_XIPCORE_CORE_TXFTLR_TXFTHR_Pos (16UL) /*!< Position of TXFTHR field.                                            */
  #define MSPI_XIPCORE_CORE_TXFTLR_TXFTHR_Msk (0xFUL << MSPI_XIPCORE_CORE_TXFTLR_TXFTHR_Pos) /*!< Bit mask of TXFTHR field.    */

/* RSVDTXFTHR @Bits 20..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_TXFTLR_RSVDTXFTHR_Pos (20UL) /*!< Position of RSVDTXFTHR field.                                    */
  #define MSPI_XIPCORE_CORE_TXFTLR_RSVDTXFTHR_Msk (0xFFFUL << MSPI_XIPCORE_CORE_TXFTLR_RSVDTXFTHR_Pos) /*!< Bit mask of
                                                                            RSVDTXFTHR field.*/


/* MSPI_XIPCORE_CORE_RXFTLR: Receive FIFO Threshold Level */
  #define MSPI_XIPCORE_CORE_RXFTLR_ResetValue (0x00000000UL) /*!< Reset value of RXFTLR register.                              */

/* RFT @Bits 0..3 : Receive FIFO Threshold. */
  #define MSPI_XIPCORE_CORE_RXFTLR_RFT_Pos (0UL)     /*!< Position of RFT field.                                               */
  #define MSPI_XIPCORE_CORE_RXFTLR_RFT_Msk (0xFUL << MSPI_XIPCORE_CORE_RXFTLR_RFT_Pos) /*!< Bit mask of RFT field.             */

/* RSVDRXFTLR @Bits 4..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RXFTLR_RSVDRXFTLR_Pos (4UL) /*!< Position of RSVDRXFTLR field.                                     */
  #define MSPI_XIPCORE_CORE_RXFTLR_RSVDRXFTLR_Msk (0xFFFFFFFUL << MSPI_XIPCORE_CORE_RXFTLR_RSVDRXFTLR_Pos) /*!< Bit mask of
                                                                            RSVDRXFTLR field.*/


/* MSPI_XIPCORE_CORE_TXFLR: Transmit FIFO Level Register */
  #define MSPI_XIPCORE_CORE_TXFLR_ResetValue (0x00000000UL) /*!< Reset value of TXFLR register.                                */

/* TXTFL @Bits 0..4 : Transmit FIFO Level. */
  #define MSPI_XIPCORE_CORE_TXFLR_TXTFL_Pos (0UL)    /*!< Position of TXTFL field.                                             */
  #define MSPI_XIPCORE_CORE_TXFLR_TXTFL_Msk (0x1FUL << MSPI_XIPCORE_CORE_TXFLR_TXTFL_Pos) /*!< Bit mask of TXTFL field.        */

/* RSVDTXFLR @Bits 5..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_TXFLR_RSVDTXFLR_Pos (5UL) /*!< Position of RSVDTXFLR field.                                        */
  #define MSPI_XIPCORE_CORE_TXFLR_RSVDTXFLR_Msk (0x7FFFFFFUL << MSPI_XIPCORE_CORE_TXFLR_RSVDTXFLR_Pos) /*!< Bit mask of
                                                                            RSVDTXFLR field.*/


/* MSPI_XIPCORE_CORE_RXFLR: Receive FIFO Level Register */
  #define MSPI_XIPCORE_CORE_RXFLR_ResetValue (0x00000000UL) /*!< Reset value of RXFLR register.                                */

/* RXTFL @Bits 0..4 : Receive FIFO Level. */
  #define MSPI_XIPCORE_CORE_RXFLR_RXTFL_Pos (0UL)    /*!< Position of RXTFL field.                                             */
  #define MSPI_XIPCORE_CORE_RXFLR_RXTFL_Msk (0x1FUL << MSPI_XIPCORE_CORE_RXFLR_RXTFL_Pos) /*!< Bit mask of RXTFL field.        */

/* RSVDRXFLR @Bits 5..31 : (unspecified) */
  #define MSPI_XIPCORE_CORE_RXFLR_RSVDRXFLR_Pos (5UL) /*!< Position of RSVDRXFLR field.                                        */
  #define MSPI_XIPCORE_CORE_RXFLR_RSVDRXFLR_Msk (0x7FFFFFFUL << MSPI_XIPCORE_CORE_RXFLR_RSVDRXFLR_Pos) /*!< Bit mask of
                                                                            RSVDRXFLR field.*/


/* MSPI_XIPCORE_CORE_SR: Status Register */
  #define MSPI_XIPCORE_CORE_SR_ResetValue (0x00000006UL) /*!< Reset value of SR register.                                      */

/* BUSY @Bit 0 : SSI Busy Flag. */
  #define MSPI_XIPCORE_CORE_SR_BUSY_Pos (0UL)        /*!< Position of BUSY field.                                              */
  #define MSPI_XIPCORE_CORE_SR_BUSY_Msk (0x1UL << MSPI_XIPCORE_CORE_SR_BUSY_Pos) /*!< Bit mask of BUSY field.                  */
  #define MSPI_XIPCORE_CORE_SR_BUSY_Min (0x0UL)      /*!< Min enumerator value of BUSY field.                                  */
  #define MSPI_XIPCORE_CORE_SR_BUSY_Max (0x1UL)      /*!< Max enumerator value of BUSY field.                                  */
  #define MSPI_XIPCORE_CORE_SR_BUSY_INACTIVE (0x0UL) /*!< MSPI CORE is idle or disabled                                        */
  #define MSPI_XIPCORE_CORE_SR_BUSY_ACTIVE (0x1UL)   /*!< MSPI CORE is actively transferring data                              */

/* TFNF @Bit 1 : Transmit FIFO Not Full. */
  #define MSPI_XIPCORE_CORE_SR_TFNF_Pos (1UL)        /*!< Position of TFNF field.                                              */
  #define MSPI_XIPCORE_CORE_SR_TFNF_Msk (0x1UL << MSPI_XIPCORE_CORE_SR_TFNF_Pos) /*!< Bit mask of TFNF field.                  */
  #define MSPI_XIPCORE_CORE_SR_TFNF_Min (0x0UL)      /*!< Min enumerator value of TFNF field.                                  */
  #define MSPI_XIPCORE_CORE_SR_TFNF_Max (0x1UL)      /*!< Max enumerator value of TFNF field.                                  */
  #define MSPI_XIPCORE_CORE_SR_TFNF_FULL (0x0UL)     /*!< Tx FIFO is full                                                      */
  #define MSPI_XIPCORE_CORE_SR_TFNF_NOT_FULL (0x1UL) /*!< Tx FIFO is not Full                                                  */

