NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* MSPI_XIPCORE_CORE_ISR: Interrupt Status Register */
  #define MSPI_XIPCORE_CORE_ISR_ResetValue (0x00000000UL) /*!< Reset value of ISR register.                                    */

/* TXEIS @Bit 0 : Transmit FIFO Empty Interrupt Status */
  #define MSPI_XIPCORE_CORE_ISR_TXEIS_Pos (0UL)      /*!< Position of TXEIS field.                                             */
  #define MSPI_XIPCORE_CORE_ISR_TXEIS_Msk (0x1UL << MSPI_XIPCORE_CORE_ISR_TXEIS_Pos) /*!< Bit mask of TXEIS field.             */
  #define MSPI_XIPCORE_CORE_ISR_TXEIS_Min (0x0UL)    /*!< Min enumerator value of TXEIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_TXEIS_Max (0x1UL)    /*!< Max enumerator value of TXEIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_TXEIS_INACTIVE (0x0UL) /*!< ssi_txe_intr interrupt is not active after masking                 */
  #define MSPI_XIPCORE_CORE_ISR_TXEIS_ACTIVE (0x1UL) /*!< ssi_txe_intr interrupt is active after masking                       */

/* TXOIS @Bit 1 : Transmit FIFO Overflow Interrupt Status */
  #define MSPI_XIPCORE_CORE_ISR_TXOIS_Pos (1UL)      /*!< Position of TXOIS field.                                             */
  #define MSPI_XIPCORE_CORE_ISR_TXOIS_Msk (0x1UL << MSPI_XIPCORE_CORE_ISR_TXOIS_Pos) /*!< Bit mask of TXOIS field.             */
  #define MSPI_XIPCORE_CORE_ISR_TXOIS_Min (0x0UL)    /*!< Min enumerator value of TXOIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_TXOIS_Max (0x1UL)    /*!< Max enumerator value of TXOIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_TXOIS_INACTIVE (0x0UL) /*!< ssi_txo_intr interrupt is not active after masking                 */
  #define MSPI_XIPCORE_CORE_ISR_TXOIS_ACTIVE (0x1UL) /*!< ssi_txo_intr interrupt is active after masking                       */

/* RXUIS @Bit 2 : Receive FIFO Underflow Interrupt Status */
  #define MSPI_XIPCORE_CORE_ISR_RXUIS_Pos (2UL)      /*!< Position of RXUIS field.                                             */
  #define MSPI_XIPCORE_CORE_ISR_RXUIS_Msk (0x1UL << MSPI_XIPCORE_CORE_ISR_RXUIS_Pos) /*!< Bit mask of RXUIS field.             */
  #define MSPI_XIPCORE_CORE_ISR_RXUIS_Min (0x0UL)    /*!< Min enumerator value of RXUIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_RXUIS_Max (0x1UL)    /*!< Max enumerator value of RXUIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_RXUIS_INACTIVE (0x0UL) /*!< ssi_rxu_intr interrupt is not active after masking                 */
  #define MSPI_XIPCORE_CORE_ISR_RXUIS_ACTIVE (0x1UL) /*!< ssi_rxu_intr interrupt is active after masking                       */

/* RXOIS @Bit 3 : Receive FIFO Overflow Interrupt Status */
  #define MSPI_XIPCORE_CORE_ISR_RXOIS_Pos (3UL)      /*!< Position of RXOIS field.                                             */
  #define MSPI_XIPCORE_CORE_ISR_RXOIS_Msk (0x1UL << MSPI_XIPCORE_CORE_ISR_RXOIS_Pos) /*!< Bit mask of RXOIS field.             */
  #define MSPI_XIPCORE_CORE_ISR_RXOIS_Min (0x0UL)    /*!< Min enumerator value of RXOIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_RXOIS_Max (0x1UL)    /*!< Max enumerator value of RXOIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_RXOIS_INACTIVE (0x0UL) /*!< ssi_rxo_intr interrupt is not active after masking                 */
  #define MSPI_XIPCORE_CORE_ISR_RXOIS_ACTIVE (0x1UL) /*!< ssi_rxo_intr interrupt is active after masking                       */

/* RXFIS @Bit 4 : Receive FIFO Full Interrupt Status */
  #define MSPI_XIPCORE_CORE_ISR_RXFIS_Pos (4UL)      /*!< Position of RXFIS field.                                             */
  #define MSPI_XIPCORE_CORE_ISR_RXFIS_Msk (0x1UL << MSPI_XIPCORE_CORE_ISR_RXFIS_Pos) /*!< Bit mask of RXFIS field.             */
  #define MSPI_XIPCORE_CORE_ISR_RXFIS_Min (0x0UL)    /*!< Min enumerator value of RXFIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_RXFIS_Max (0x1UL)    /*!< Max enumerator value of RXFIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_RXFIS_INACTIVE (0x0UL) /*!< ssi_rxf_intr interrupt is not active after masking                 */
  #define MSPI_XIPCORE_CORE_ISR_RXFIS_ACTIVE (0x1UL) /*!< ssi_rxf_intr interrupt is active after masking                       */

/* MSTIS @Bit 5 : Multi-Controller Contention Interrupt Status. This bit field is not present */
  #define MSPI_XIPCORE_CORE_ISR_MSTIS_Pos (5UL)      /*!< Position of MSTIS field.                                             */
  #define MSPI_XIPCORE_CORE_ISR_MSTIS_Msk (0x1UL << MSPI_XIPCORE_CORE_ISR_MSTIS_Pos) /*!< Bit mask of MSTIS field.             */
  #define MSPI_XIPCORE_CORE_ISR_MSTIS_Min (0x0UL)    /*!< Min enumerator value of MSTIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_MSTIS_Max (0x1UL)    /*!< Max enumerator value of MSTIS field.                                 */
  #define MSPI_XIPCORE_CORE_ISR_MSTIS_INACTIVE (0x0UL) /*!< ssi_mst_intr interrupt is not active after masking                 */
  #define MSPI_XIPCORE_CORE_ISR_MSTIS_ACTIVE (0x1UL) /*!< ssi_mst_intr interrupt is active after masking                       */

/* XRXOIS @Bit 6 : XIP Receive FIFO Overflow Interrupt Status */
  #define MSPI_XIPCORE_CORE_ISR_XRXOIS_Pos (6UL)     /*!< Position of XRXOIS field.                                            */
  #define MSPI_XIPCORE_CORE_ISR_XRXOIS_Msk (0x1UL << MSPI_XIPCORE_CORE_ISR_XRXOIS_Pos) /*!< Bit mask of XRXOIS field.          */
  #define MSPI_XIPCORE_CORE_ISR_XRXOIS_Min (0x0UL)   /*!< Min enumerator value of XRXOIS field.                                */
  #define MSPI_XIPCORE_CORE_ISR_XRXOIS_Max (0x1UL)   /*!< Max enumerator value of XRXOIS field.                                */
  #define MSPI_XIPCORE_CORE_ISR_XRXOIS_INACTIVE (0x0UL) /*!< ssi_xrxo_intr interrupt is not active after masking               */
  #define MSPI_XIPCORE_CORE_ISR_XRXOIS_ACTIVE (0x1UL) /*!< ssi_xrxo_intr interrupt is active after masking                     */

