NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* DMADONESELECTJOB @Bit 3 : Read pending status of interrupt for event DMADONESELECTJOB */
  #define MSPI_INTPEND_DMADONESELECTJOB_Pos (3UL)    /*!< Position of DMADONESELECTJOB field.                                  */
  #define MSPI_INTPEND_DMADONESELECTJOB_Msk (0x1UL << MSPI_INTPEND_DMADONESELECTJOB_Pos) /*!< Bit mask of DMADONESELECTJOB
                                                                            field.*/
  #define MSPI_INTPEND_DMADONESELECTJOB_Min (0x0UL)  /*!< Min enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTPEND_DMADONESELECTJOB_Max (0x1UL)  /*!< Max enumerator value of DMADONESELECTJOB field.                      */
  #define MSPI_INTPEND_DMADONESELECTJOB_NotPending (0x0UL) /*!< Read: Not pending                                              */
  #define MSPI_INTPEND_DMADONESELECTJOB_Pending (0x1UL) /*!< Read: Pending                                                     */

/* DMADONEDATA @Bit 4 : Read pending status of interrupt for event DMADONEDATA */
  #define MSPI_INTPEND_DMADONEDATA_Pos (4UL)         /*!< Position of DMADONEDATA field.                                       */
  #define MSPI_INTPEND_DMADONEDATA_Msk (0x1UL << MSPI_INTPEND_DMADONEDATA_Pos) /*!< Bit mask of DMADONEDATA field.             */
  #define MSPI_INTPEND_DMADONEDATA_Min (0x0UL)       /*!< Min enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTPEND_DMADONEDATA_Max (0x1UL)       /*!< Max enumerator value of DMADONEDATA field.                           */
  #define MSPI_INTPEND_DMADONEDATA_NotPending (0x0UL) /*!< Read: Not pending                                                   */
  #define MSPI_INTPEND_DMADONEDATA_Pending (0x1UL)   /*!< Read: Pending                                                        */

/* DMADONEJOB @Bit 5 : Read pending status of interrupt for event DMADONEJOB */
  #define MSPI_INTPEND_DMADONEJOB_Pos (5UL)          /*!< Position of DMADONEJOB field.                                        */
  #define MSPI_INTPEND_DMADONEJOB_Msk (0x1UL << MSPI_INTPEND_DMADONEJOB_Pos) /*!< Bit mask of DMADONEJOB field.                */
  #define MSPI_INTPEND_DMADONEJOB_Min (0x0UL)        /*!< Min enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTPEND_DMADONEJOB_Max (0x1UL)        /*!< Max enumerator value of DMADONEJOB field.                            */
  #define MSPI_INTPEND_DMADONEJOB_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_DMADONEJOB_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* DMAERROR @Bit 6 : Read pending status of interrupt for event DMAERROR */
  #define MSPI_INTPEND_DMAERROR_Pos (6UL)            /*!< Position of DMAERROR field.                                          */
  #define MSPI_INTPEND_DMAERROR_Msk (0x1UL << MSPI_INTPEND_DMAERROR_Pos) /*!< Bit mask of DMAERROR field.                      */
  #define MSPI_INTPEND_DMAERROR_Min (0x0UL)          /*!< Min enumerator value of DMAERROR field.                              */
  #define MSPI_INTPEND_DMAERROR_Max (0x1UL)          /*!< Max enumerator value of DMAERROR field.                              */
  #define MSPI_INTPEND_DMAERROR_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_DMAERROR_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* DMAPAUSED @Bit 7 : Read pending status of interrupt for event DMAPAUSED */
  #define MSPI_INTPEND_DMAPAUSED_Pos (7UL)           /*!< Position of DMAPAUSED field.                                         */
  #define MSPI_INTPEND_DMAPAUSED_Msk (0x1UL << MSPI_INTPEND_DMAPAUSED_Pos) /*!< Bit mask of DMAPAUSED field.                   */
  #define MSPI_INTPEND_DMAPAUSED_Min (0x0UL)         /*!< Min enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTPEND_DMAPAUSED_Max (0x1UL)         /*!< Max enumerator value of DMAPAUSED field.                             */
  #define MSPI_INTPEND_DMAPAUSED_NotPending (0x0UL)  /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_DMAPAUSED_Pending (0x1UL)     /*!< Read: Pending                                                        */

/* DMARESET @Bit 8 : Read pending status of interrupt for event DMARESET */
  #define MSPI_INTPEND_DMARESET_Pos (8UL)            /*!< Position of DMARESET field.                                          */
  #define MSPI_INTPEND_DMARESET_Msk (0x1UL << MSPI_INTPEND_DMARESET_Pos) /*!< Bit mask of DMARESET field.                      */
  #define MSPI_INTPEND_DMARESET_Min (0x0UL)          /*!< Min enumerator value of DMARESET field.                              */
  #define MSPI_INTPEND_DMARESET_Max (0x1UL)          /*!< Max enumerator value of DMARESET field.                              */
  #define MSPI_INTPEND_DMARESET_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_DMARESET_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* DMADONE @Bit 9 : Read pending status of interrupt for event DMADONE */
  #define MSPI_INTPEND_DMADONE_Pos (9UL)             /*!< Position of DMADONE field.                                           */
  #define MSPI_INTPEND_DMADONE_Msk (0x1UL << MSPI_INTPEND_DMADONE_Pos) /*!< Bit mask of DMADONE field.                         */
  #define MSPI_INTPEND_DMADONE_Min (0x0UL)           /*!< Min enumerator value of DMADONE field.                               */
  #define MSPI_INTPEND_DMADONE_Max (0x1UL)           /*!< Max enumerator value of DMADONE field.                               */
  #define MSPI_INTPEND_DMADONE_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_DMADONE_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* DMATXUNEXPECTEDIDLE @Bit 10 : Read pending status of interrupt for event DMATXUNEXPECTEDIDLE */
  #define MSPI_INTPEND_DMATXUNEXPECTEDIDLE_Pos (10UL) /*!< Position of DMATXUNEXPECTEDIDLE field.                              */
  #define MSPI_INTPEND_DMATXUNEXPECTEDIDLE_Msk (0x1UL << MSPI_INTPEND_DMATXUNEXPECTEDIDLE_Pos) /*!< Bit mask of
                                                                            DMATXUNEXPECTEDIDLE field.*/
  #define MSPI_INTPEND_DMATXUNEXPECTEDIDLE_Min (0x0UL) /*!< Min enumerator value of DMATXUNEXPECTEDIDLE field.                 */
  #define MSPI_INTPEND_DMATXUNEXPECTEDIDLE_Max (0x1UL) /*!< Max enumerator value of DMATXUNEXPECTEDIDLE field.                 */
  #define MSPI_INTPEND_DMATXUNEXPECTEDIDLE_NotPending (0x0UL) /*!< Read: Not pending                                           */
  #define MSPI_INTPEND_DMATXUNEXPECTEDIDLE_Pending (0x1UL) /*!< Read: Pending                                                  */

/* DMAINTERNALBUSERROR @Bit 11 : Read pending status of interrupt for event DMAINTERNALBUSERROR */
  #define MSPI_INTPEND_DMAINTERNALBUSERROR_Pos (11UL) /*!< Position of DMAINTERNALBUSERROR field.                              */
  #define MSPI_INTPEND_DMAINTERNALBUSERROR_Msk (0x1UL << MSPI_INTPEND_DMAINTERNALBUSERROR_Pos) /*!< Bit mask of
                                                                            DMAINTERNALBUSERROR field.*/
  #define MSPI_INTPEND_DMAINTERNALBUSERROR_Min (0x0UL) /*!< Min enumerator value of DMAINTERNALBUSERROR field.                 */
  #define MSPI_INTPEND_DMAINTERNALBUSERROR_Max (0x1UL) /*!< Max enumerator value of DMAINTERNALBUSERROR field.                 */
  #define MSPI_INTPEND_DMAINTERNALBUSERROR_NotPending (0x0UL) /*!< Read: Not pending                                           */
  #define MSPI_INTPEND_DMAINTERNALBUSERROR_Pending (0x1UL) /*!< Read: Pending                                                  */

/* DMAABORTED @Bit 12 : Read pending status of interrupt for event DMAABORTED */
  #define MSPI_INTPEND_DMAABORTED_Pos (12UL)         /*!< Position of DMAABORTED field.                                        */
  #define MSPI_INTPEND_DMAABORTED_Msk (0x1UL << MSPI_INTPEND_DMAABORTED_Pos) /*!< Bit mask of DMAABORTED field.                */
  #define MSPI_INTPEND_DMAABORTED_Min (0x0UL)        /*!< Min enumerator value of DMAABORTED field.                            */
  #define MSPI_INTPEND_DMAABORTED_Max (0x1UL)        /*!< Max enumerator value of DMAABORTED field.                            */
  #define MSPI_INTPEND_DMAABORTED_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define MSPI_INTPEND_DMAABORTED_Pending (0x1UL)    /*!< Read: Pending                                                        */

