NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* =================================================== Struct MVDMA_STATUS =================================================== */
/**
  * @brief STATUS [MVDMA_STATUS] MVDMA status registers.
  */
typedef struct {
  __IM  uint32_t  CRCRESULT;                         /*!< (@ 0x00000000) CRC checksum calculation result                       */
  __IM  uint32_t  FIFO;                              /*!< (@ 0x00000004) Status of intermediate fifo: empty, not empty and full
                                                                         information available.*/
  __IM  uint32_t  ACTIVE;                            /*!< (@ 0x00000008) Status of DMA transfer.                               */
} NRF_MVDMA_STATUS_Type;                             /*!< Size = 12 (0x00C)                                                    */

/* MVDMA_STATUS_CRCRESULT: CRC checksum calculation result */
  #define MVDMA_STATUS_CRCRESULT_ResetValue (0x00000000UL) /*!< Reset value of CRCRESULT register.                             */

/* CRC @Bits 0..31 : Result */
  #define MVDMA_STATUS_CRCRESULT_CRC_Pos (0UL)       /*!< Position of CRC field.                                               */
  #define MVDMA_STATUS_CRCRESULT_CRC_Msk (0xFFFFFFFFUL << MVDMA_STATUS_CRCRESULT_CRC_Pos) /*!< Bit mask of CRC field.          */


/* MVDMA_STATUS_FIFO: Status of intermediate fifo: empty, not empty and full information available. */
  #define MVDMA_STATUS_FIFO_ResetValue (0x00000000UL) /*!< Reset value of FIFO register.                                       */

/* FIFOSTATUS @Bits 0..1 : Result */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Pos (0UL)     /*!< Position of FIFOSTATUS field.                                        */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Msk (0x3UL << MVDMA_STATUS_FIFO_FIFOSTATUS_Pos) /*!< Bit mask of FIFOSTATUS field.      */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Min (0x0UL)   /*!< Min enumerator value of FIFOSTATUS field.                            */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Max (0x2UL)   /*!< Max enumerator value of FIFOSTATUS field.                            */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Empty (0x0UL) /*!< Fifo is empty.                                                       */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_NotEmpty (0x1UL) /*!< Fifo contains data.                                               */
  #define MVDMA_STATUS_FIFO_FIFOSTATUS_Full (0x2UL)  /*!< Fifo is full.                                                        */


/* MVDMA_STATUS_ACTIVE: Status of DMA transfer. */
  #define MVDMA_STATUS_ACTIVE_ResetValue (0x00000000UL) /*!< Reset value of ACTIVE register.                                   */

/* ACTIVE @Bit 0 : DMA activity */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Pos (0UL)       /*!< Position of ACTIVE field.                                            */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Msk (0x1UL << MVDMA_STATUS_ACTIVE_ACTIVE_Pos) /*!< Bit mask of ACTIVE field.              */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Min (0x0UL)     /*!< Min enumerator value of ACTIVE field.                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Max (0x1UL)     /*!< Max enumerator value of ACTIVE field.                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Idle (0x0UL)    /*!< DMA is in IDLE state.                                                */
  #define MVDMA_STATUS_ACTIVE_ACTIVE_Active (0x1UL)  /*!< Data being transferred.                                              */



/* =================================================== Struct MVDMA_CONFIG =================================================== */
/**
  * @brief CONFIG [MVDMA_CONFIG] MVDMA configuration registers.
  */
typedef struct {
  __IOM uint32_t  MODE;                              /*!< (@ 0x00000000) Configure MVDMA mode of operation.                    */
  __IOM uint32_t  AXIMODE;                           /*!< (@ 0x00000004) Mode that defines if the AXI bus is AXI or AXI-Lite
                                                                         (one-beat bursts)*/
} NRF_MVDMA_CONFIG_Type;                             /*!< Size = 8 (0x008)                                                     */

/* MVDMA_CONFIG_MODE: Configure MVDMA mode of operation. */
  #define MVDMA_CONFIG_MODE_ResetValue (0x00000000UL) /*!< Reset value of MODE register.                                       */

/* MODE @Bit 0 : (unspecified) */
  #define MVDMA_CONFIG_MODE_MODE_Pos (0UL)           /*!< Position of MODE field.                                              */
  #define MVDMA_CONFIG_MODE_MODE_Msk (0x1UL << MVDMA_CONFIG_MODE_MODE_Pos) /*!< Bit mask of MODE field.                        */
  #define MVDMA_CONFIG_MODE_MODE_Min (0x0UL)         /*!< Min enumerator value of MODE field.                                  */
  #define MVDMA_CONFIG_MODE_MODE_Max (0x1UL)         /*!< Max enumerator value of MODE field.                                  */
  #define MVDMA_CONFIG_MODE_MODE_SingleMode (0x0UL)  /*!< Registers SOURCE.LISTPTR and SINK.LISTPTR contain start address of a
                                                          single job list.*/
  #define MVDMA_CONFIG_MODE_MODE_MultiMode (0x1UL)   /*!< Registers SOURCE.LISTPTR and SINK.LISTPTR contain start address of a
                                                          list of job list pointers in memory.*/


/* MVDMA_CONFIG_AXIMODE: Mode that defines if the AXI bus is AXI or AXI-Lite (one-beat bursts) */
  #define MVDMA_CONFIG_AXIMODE_ResetValue (0x00000000UL) /*!< Reset value of AXIMODE register.                                 */

/* AXIMODE @Bit 0 : (unspecified) */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Pos (0UL)     /*!< Position of AXIMODE field.                                           */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Msk (0x1UL << MVDMA_CONFIG_AXIMODE_AXIMODE_Pos) /*!< Bit mask of AXIMODE field.         */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Min (0x0UL)   /*!< Min enumerator value of AXIMODE field.                               */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_Max (0x1UL)   /*!< Max enumerator value of AXIMODE field.                               */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_AXI (0x0UL)   /*!< AXI burst transactions may be longer than one beat.                  */
  #define MVDMA_CONFIG_AXIMODE_AXIMODE_AXILITE (0x1UL) /*!< All AXI transactions are one-beat accesses.                        */



/* =================================================== Struct MVDMA_SOURCE =================================================== */
/**
  * @brief SOURCE [MVDMA_SOURCE] Source channel configuration and status.
  */
typedef struct {
  __IOM uint32_t  LISTPTR;                           /*!< (@ 0x00000000) Start address of Source job list or list of job list
                                                                         pointers, depending on value of CONFIG.MODE.*/
  __IM  uint32_t  BUSERROR;                          /*!< (@ 0x00000004) Source bus error status.                              */
  __IM  uint32_t  ADDRESS;                           /*!< (@ 0x00000008) Latest address being accessed on the Source channel.If
                                                                         a bus error occurs, these registers will contain the
                                                                         address that cause the error.*/
  __IM  uint32_t  JOBCOUNT;                          /*!< (@ 0x0000000C) Number of completed jobs in the current Source
                                                                         descriptor list. This resets to 0 when a new job list
                                                                         is started.*/
} NRF_MVDMA_SOURCE_Type;                             /*!< Size = 16 (0x010)                                                    */

/* MVDMA_SOURCE_LISTPTR: Start address of Source job list or list of job list pointers, depending on value of CONFIG.MODE. */
  #define MVDMA_SOURCE_LISTPTR_ResetValue (0x00000000UL) /*!< Reset value of LISTPTR register.                                 */

