NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* AUTOCOLRESSTARTED @Bit 14 : Enable or disable interrupt for event AUTOCOLRESSTARTED */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Pos (14UL)    /*!< Position of AUTOCOLRESSTARTED field.                                 */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Msk (0x1UL << NFCT_INTEN_AUTOCOLRESSTARTED_Pos) /*!< Bit mask of AUTOCOLRESSTARTED
                                                                            field.*/
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Min (0x0UL)   /*!< Min enumerator value of AUTOCOLRESSTARTED field.                     */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Max (0x1UL)   /*!< Max enumerator value of AUTOCOLRESSTARTED field.                     */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Disabled (0x0UL) /*!< Disable                                                           */
  #define NFCT_INTEN_AUTOCOLRESSTARTED_Enabled (0x1UL) /*!< Enable                                                             */

/* COLLISION @Bit 18 : Enable or disable interrupt for event COLLISION */
  #define NFCT_INTEN_COLLISION_Pos (18UL)            /*!< Position of COLLISION field.                                         */
  #define NFCT_INTEN_COLLISION_Msk (0x1UL << NFCT_INTEN_COLLISION_Pos) /*!< Bit mask of COLLISION field.                       */
  #define NFCT_INTEN_COLLISION_Min (0x0UL)           /*!< Min enumerator value of COLLISION field.                             */
  #define NFCT_INTEN_COLLISION_Max (0x1UL)           /*!< Max enumerator value of COLLISION field.                             */
  #define NFCT_INTEN_COLLISION_Disabled (0x0UL)      /*!< Disable                                                              */
  #define NFCT_INTEN_COLLISION_Enabled (0x1UL)       /*!< Enable                                                               */

/* SELECTED @Bit 19 : Enable or disable interrupt for event SELECTED */
  #define NFCT_INTEN_SELECTED_Pos (19UL)             /*!< Position of SELECTED field.                                          */
  #define NFCT_INTEN_SELECTED_Msk (0x1UL << NFCT_INTEN_SELECTED_Pos) /*!< Bit mask of SELECTED field.                          */
  #define NFCT_INTEN_SELECTED_Min (0x0UL)            /*!< Min enumerator value of SELECTED field.                              */
  #define NFCT_INTEN_SELECTED_Max (0x1UL)            /*!< Max enumerator value of SELECTED field.                              */
  #define NFCT_INTEN_SELECTED_Disabled (0x0UL)       /*!< Disable                                                              */
  #define NFCT_INTEN_SELECTED_Enabled (0x1UL)        /*!< Enable                                                               */

/* STARTED @Bit 20 : Enable or disable interrupt for event STARTED */
  #define NFCT_INTEN_STARTED_Pos (20UL)              /*!< Position of STARTED field.                                           */
  #define NFCT_INTEN_STARTED_Msk (0x1UL << NFCT_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                             */
  #define NFCT_INTEN_STARTED_Min (0x0UL)             /*!< Min enumerator value of STARTED field.                               */
  #define NFCT_INTEN_STARTED_Max (0x1UL)             /*!< Max enumerator value of STARTED field.                               */
  #define NFCT_INTEN_STARTED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define NFCT_INTEN_STARTED_Enabled (0x1UL)         /*!< Enable                                                               */


/* NFCT_INTENSET: Enable interrupt */
  #define NFCT_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* READY @Bit 0 : Write '1' to enable interrupt for event READY */
  #define NFCT_INTENSET_READY_Pos (0UL)              /*!< Position of READY field.                                             */
  #define NFCT_INTENSET_READY_Msk (0x1UL << NFCT_INTENSET_READY_Pos) /*!< Bit mask of READY field.                             */
  #define NFCT_INTENSET_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define NFCT_INTENSET_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define NFCT_INTENSET_READY_Set (0x1UL)            /*!< Enable                                                               */
  #define NFCT_INTENSET_READY_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_READY_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* FIELDDETECTED @Bit 1 : Write '1' to enable interrupt for event FIELDDETECTED */
  #define NFCT_INTENSET_FIELDDETECTED_Pos (1UL)      /*!< Position of FIELDDETECTED field.                                     */
  #define NFCT_INTENSET_FIELDDETECTED_Msk (0x1UL << NFCT_INTENSET_FIELDDETECTED_Pos) /*!< Bit mask of FIELDDETECTED field.     */
  #define NFCT_INTENSET_FIELDDETECTED_Min (0x0UL)    /*!< Min enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTENSET_FIELDDETECTED_Max (0x1UL)    /*!< Max enumerator value of FIELDDETECTED field.                         */
  #define NFCT_INTENSET_FIELDDETECTED_Set (0x1UL)    /*!< Enable                                                               */
  #define NFCT_INTENSET_FIELDDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define NFCT_INTENSET_FIELDDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* FIELDLOST @Bit 2 : Write '1' to enable interrupt for event FIELDLOST */
  #define NFCT_INTENSET_FIELDLOST_Pos (2UL)          /*!< Position of FIELDLOST field.                                         */
  #define NFCT_INTENSET_FIELDLOST_Msk (0x1UL << NFCT_INTENSET_FIELDLOST_Pos) /*!< Bit mask of FIELDLOST field.                 */
  #define NFCT_INTENSET_FIELDLOST_Min (0x0UL)        /*!< Min enumerator value of FIELDLOST field.                             */
  #define NFCT_INTENSET_FIELDLOST_Max (0x1UL)        /*!< Max enumerator value of FIELDLOST field.                             */
  #define NFCT_INTENSET_FIELDLOST_Set (0x1UL)        /*!< Enable                                                               */
  #define NFCT_INTENSET_FIELDLOST_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_FIELDLOST_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* TXFRAMESTART @Bit 3 : Write '1' to enable interrupt for event TXFRAMESTART */
  #define NFCT_INTENSET_TXFRAMESTART_Pos (3UL)       /*!< Position of TXFRAMESTART field.                                      */
  #define NFCT_INTENSET_TXFRAMESTART_Msk (0x1UL << NFCT_INTENSET_TXFRAMESTART_Pos) /*!< Bit mask of TXFRAMESTART field.        */
  #define NFCT_INTENSET_TXFRAMESTART_Min (0x0UL)     /*!< Min enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTENSET_TXFRAMESTART_Max (0x1UL)     /*!< Max enumerator value of TXFRAMESTART field.                          */
  #define NFCT_INTENSET_TXFRAMESTART_Set (0x1UL)     /*!< Enable                                                               */
  #define NFCT_INTENSET_TXFRAMESTART_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define NFCT_INTENSET_TXFRAMESTART_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* TXFRAMEEND @Bit 4 : Write '1' to enable interrupt for event TXFRAMEEND */
  #define NFCT_INTENSET_TXFRAMEEND_Pos (4UL)         /*!< Position of TXFRAMEEND field.                                        */
  #define NFCT_INTENSET_TXFRAMEEND_Msk (0x1UL << NFCT_INTENSET_TXFRAMEEND_Pos) /*!< Bit mask of TXFRAMEEND field.              */
  #define NFCT_INTENSET_TXFRAMEEND_Min (0x0UL)       /*!< Min enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTENSET_TXFRAMEEND_Max (0x1UL)       /*!< Max enumerator value of TXFRAMEEND field.                            */
  #define NFCT_INTENSET_TXFRAMEEND_Set (0x1UL)       /*!< Enable                                                               */
  #define NFCT_INTENSET_TXFRAMEEND_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define NFCT_INTENSET_TXFRAMEEND_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* RXFRAMESTART @Bit 5 : Write '1' to enable interrupt for event RXFRAMESTART */
  #define NFCT_INTENSET_RXFRAMESTART_Pos (5UL)       /*!< Position of RXFRAMESTART field.                                      */
  #define NFCT_INTENSET_RXFRAMESTART_Msk (0x1UL << NFCT_INTENSET_RXFRAMESTART_Pos) /*!< Bit mask of RXFRAMESTART field.        */
  #define NFCT_INTENSET_RXFRAMESTART_Min (0x0UL)     /*!< Min enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTENSET_RXFRAMESTART_Max (0x1UL)     /*!< Max enumerator value of RXFRAMESTART field.                          */
  #define NFCT_INTENSET_RXFRAMESTART_Set (0x1UL)     /*!< Enable                                                               */
  #define NFCT_INTENSET_RXFRAMESTART_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define NFCT_INTENSET_RXFRAMESTART_Enabled (0x1UL) /*!< Read: Enabled                                                        */

