NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event STARTED will publish to */
  #define PDM_PUBLISH_STARTED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_STARTED_CHIDX_Msk (0xFFUL << PDM_PUBLISH_STARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PDM_PUBLISH_STARTED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PDM_PUBLISH_STARTED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_STARTED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_STARTED_EN_Msk (0x1UL << PDM_PUBLISH_STARTED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PDM_PUBLISH_STARTED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STARTED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STARTED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define PDM_PUBLISH_STARTED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* PDM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define PDM_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define PDM_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << PDM_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define PDM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define PDM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_STOPPED_EN_Msk (0x1UL << PDM_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define PDM_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define PDM_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* PDM_PUBLISH_END: Publish configuration for event END */
  #define PDM_PUBLISH_END_ResetValue (0x00000000UL)  /*!< Reset value of PUBLISH_END register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define PDM_PUBLISH_END_CHIDX_Pos (0UL)            /*!< Position of CHIDX field.                                             */
  #define PDM_PUBLISH_END_CHIDX_Msk (0xFFUL << PDM_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                        */
  #define PDM_PUBLISH_END_CHIDX_Min (0x00UL)         /*!< Min value of CHIDX field.                                            */
  #define PDM_PUBLISH_END_CHIDX_Max (0xFFUL)         /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PDM_PUBLISH_END_EN_Pos (31UL)              /*!< Position of EN field.                                                */
  #define PDM_PUBLISH_END_EN_Msk (0x1UL << PDM_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                                  */
  #define PDM_PUBLISH_END_EN_Min (0x0UL)             /*!< Min enumerator value of EN field.                                    */
  #define PDM_PUBLISH_END_EN_Max (0x1UL)             /*!< Max enumerator value of EN field.                                    */
  #define PDM_PUBLISH_END_EN_Disabled (0x0UL)        /*!< Disable publishing                                                   */
  #define PDM_PUBLISH_END_EN_Enabled (0x1UL)         /*!< Enable publishing                                                    */


/* PDM_INTEN: Enable or disable interrupt */
  #define PDM_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* STARTED @Bit 0 : Enable or disable interrupt for event STARTED */
  #define PDM_INTEN_STARTED_Pos (0UL)                /*!< Position of STARTED field.                                           */
  #define PDM_INTEN_STARTED_Msk (0x1UL << PDM_INTEN_STARTED_Pos) /*!< Bit mask of STARTED field.                               */
  #define PDM_INTEN_STARTED_Min (0x0UL)              /*!< Min enumerator value of STARTED field.                               */
  #define PDM_INTEN_STARTED_Max (0x1UL)              /*!< Max enumerator value of STARTED field.                               */
  #define PDM_INTEN_STARTED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PDM_INTEN_STARTED_Enabled (0x1UL)          /*!< Enable                                                               */

/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define PDM_INTEN_STOPPED_Pos (1UL)                /*!< Position of STOPPED field.                                           */
  #define PDM_INTEN_STOPPED_Msk (0x1UL << PDM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define PDM_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define PDM_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define PDM_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define PDM_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */

/* END @Bit 2 : Enable or disable interrupt for event END */
  #define PDM_INTEN_END_Pos (2UL)                    /*!< Position of END field.                                               */
  #define PDM_INTEN_END_Msk (0x1UL << PDM_INTEN_END_Pos) /*!< Bit mask of END field.                                           */
  #define PDM_INTEN_END_Min (0x0UL)                  /*!< Min enumerator value of END field.                                   */
  #define PDM_INTEN_END_Max (0x1UL)                  /*!< Max enumerator value of END field.                                   */
  #define PDM_INTEN_END_Disabled (0x0UL)             /*!< Disable                                                              */
  #define PDM_INTEN_END_Enabled (0x1UL)              /*!< Enable                                                               */

