NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* PWM_PUBLISH_SEQEND: Publish configuration for event SEQEND[n] */
  #define PWM_PUBLISH_SEQEND_MaxCount (2UL)          /*!< Max size of PUBLISH_SEQEND[2] array.                                 */
  #define PWM_PUBLISH_SEQEND_MaxIndex (1UL)          /*!< Max index of PUBLISH_SEQEND[2] array.                                */
  #define PWM_PUBLISH_SEQEND_MinIndex (0UL)          /*!< Min index of PUBLISH_SEQEND[2] array.                                */
  #define PWM_PUBLISH_SEQEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SEQEND[2] register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that event SEQEND[n] will publish to */
  #define PWM_PUBLISH_SEQEND_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_SEQEND_CHIDX_Msk (0xFFUL << PWM_PUBLISH_SEQEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define PWM_PUBLISH_SEQEND_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define PWM_PUBLISH_SEQEND_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_SEQEND_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_SEQEND_EN_Msk (0x1UL << PWM_PUBLISH_SEQEND_EN_Pos) /*!< Bit mask of EN field.                            */
  #define PWM_PUBLISH_SEQEND_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_SEQEND_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_SEQEND_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define PWM_PUBLISH_SEQEND_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* PWM_PUBLISH_PWMPERIODEND: Publish configuration for event PWMPERIODEND */
  #define PWM_PUBLISH_PWMPERIODEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_PWMPERIODEND register.                */

/* CHIDX @Bits 0..7 : DPPI channel that event PWMPERIODEND will publish to */
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Msk (0xFFUL << PWM_PUBLISH_PWMPERIODEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define PWM_PUBLISH_PWMPERIODEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_PWMPERIODEND_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_PWMPERIODEND_EN_Msk (0x1UL << PWM_PUBLISH_PWMPERIODEND_EN_Pos) /*!< Bit mask of EN field.                */
  #define PWM_PUBLISH_PWMPERIODEND_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_PWMPERIODEND_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_PWMPERIODEND_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define PWM_PUBLISH_PWMPERIODEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* PWM_PUBLISH_LOOPSDONE: Publish configuration for event LOOPSDONE */
  #define PWM_PUBLISH_LOOPSDONE_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_LOOPSDONE register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event LOOPSDONE will publish to */
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Msk (0xFFUL << PWM_PUBLISH_LOOPSDONE_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define PWM_PUBLISH_LOOPSDONE_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_LOOPSDONE_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_LOOPSDONE_EN_Msk (0x1UL << PWM_PUBLISH_LOOPSDONE_EN_Pos) /*!< Bit mask of EN field.                      */
  #define PWM_PUBLISH_LOOPSDONE_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_LOOPSDONE_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_LOOPSDONE_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define PWM_PUBLISH_LOOPSDONE_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* PWM_PUBLISH_RAMUNDERFLOW: Publish configuration for event RAMUNDERFLOW */
  #define PWM_PUBLISH_RAMUNDERFLOW_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RAMUNDERFLOW register.                */

/* CHIDX @Bits 0..7 : DPPI channel that event RAMUNDERFLOW will publish to */
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Msk (0xFFUL << PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define PWM_PUBLISH_RAMUNDERFLOW_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Msk (0x1UL << PWM_PUBLISH_RAMUNDERFLOW_EN_Pos) /*!< Bit mask of EN field.                */
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define PWM_PUBLISH_RAMUNDERFLOW_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* PWM_PUBLISH_COMPAREMATCH: Publish configuration for event COMPAREMATCH[n] */
  #define PWM_PUBLISH_COMPAREMATCH_MaxCount (4UL)    /*!< Max size of PUBLISH_COMPAREMATCH[4] array.                           */
  #define PWM_PUBLISH_COMPAREMATCH_MaxIndex (3UL)    /*!< Max index of PUBLISH_COMPAREMATCH[4] array.                          */
  #define PWM_PUBLISH_COMPAREMATCH_MinIndex (0UL)    /*!< Min index of PUBLISH_COMPAREMATCH[4] array.                          */
  #define PWM_PUBLISH_COMPAREMATCH_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_COMPAREMATCH[4] register.             */

/* CHIDX @Bits 0..7 : DPPI channel that event COMPAREMATCH[n] will publish to */
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Msk (0xFFUL << PWM_PUBLISH_COMPAREMATCH_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define PWM_PUBLISH_COMPAREMATCH_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define PWM_PUBLISH_COMPAREMATCH_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define PWM_PUBLISH_COMPAREMATCH_EN_Msk (0x1UL << PWM_PUBLISH_COMPAREMATCH_EN_Pos) /*!< Bit mask of EN field.                */
  #define PWM_PUBLISH_COMPAREMATCH_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define PWM_PUBLISH_COMPAREMATCH_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define PWM_PUBLISH_COMPAREMATCH_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define PWM_PUBLISH_COMPAREMATCH_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


