NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* RADIO_DAP: Device address prefix n */
  #define RADIO_DAP_MaxCount (8UL)                   /*!< Max size of DAP[8] array.                                            */
  #define RADIO_DAP_MaxIndex (7UL)                   /*!< Max index of DAP[8] array.                                           */
  #define RADIO_DAP_MinIndex (0UL)                   /*!< Min index of DAP[8] array.                                           */
  #define RADIO_DAP_ResetValue (0x00000000UL)        /*!< Reset value of DAP[8] register.                                      */

/* DAP @Bits 0..15 : Device address prefix n */
  #define RADIO_DAP_DAP_Pos (0UL)                    /*!< Position of DAP field.                                               */
  #define RADIO_DAP_DAP_Msk (0xFFFFUL << RADIO_DAP_DAP_Pos) /*!< Bit mask of DAP field.                                        */


/* RADIO_DACNF: Device address match configuration */
  #define RADIO_DACNF_ResetValue (0x00000000UL)      /*!< Reset value of DACNF register.                                       */

/* ENA0 @Bit 0 : Enable or disable device address matching using device address 0 */
  #define RADIO_DACNF_ENA0_Pos (0UL)                 /*!< Position of ENA0 field.                                              */
  #define RADIO_DACNF_ENA0_Msk (0x1UL << RADIO_DACNF_ENA0_Pos) /*!< Bit mask of ENA0 field.                                    */
  #define RADIO_DACNF_ENA0_Min (0x0UL)               /*!< Min enumerator value of ENA0 field.                                  */
  #define RADIO_DACNF_ENA0_Max (0x1UL)               /*!< Max enumerator value of ENA0 field.                                  */
  #define RADIO_DACNF_ENA0_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA0_Enabled (0x1UL)           /*!< Enabled                                                              */

/* ENA1 @Bit 1 : Enable or disable device address matching using device address 1 */
  #define RADIO_DACNF_ENA1_Pos (1UL)                 /*!< Position of ENA1 field.                                              */
  #define RADIO_DACNF_ENA1_Msk (0x1UL << RADIO_DACNF_ENA1_Pos) /*!< Bit mask of ENA1 field.                                    */
  #define RADIO_DACNF_ENA1_Min (0x0UL)               /*!< Min enumerator value of ENA1 field.                                  */
  #define RADIO_DACNF_ENA1_Max (0x1UL)               /*!< Max enumerator value of ENA1 field.                                  */
  #define RADIO_DACNF_ENA1_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA1_Enabled (0x1UL)           /*!< Enabled                                                              */

/* ENA2 @Bit 2 : Enable or disable device address matching using device address 2 */
  #define RADIO_DACNF_ENA2_Pos (2UL)                 /*!< Position of ENA2 field.                                              */
  #define RADIO_DACNF_ENA2_Msk (0x1UL << RADIO_DACNF_ENA2_Pos) /*!< Bit mask of ENA2 field.                                    */
  #define RADIO_DACNF_ENA2_Min (0x0UL)               /*!< Min enumerator value of ENA2 field.                                  */
  #define RADIO_DACNF_ENA2_Max (0x1UL)               /*!< Max enumerator value of ENA2 field.                                  */
  #define RADIO_DACNF_ENA2_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA2_Enabled (0x1UL)           /*!< Enabled                                                              */

/* ENA3 @Bit 3 : Enable or disable device address matching using device address 3 */
  #define RADIO_DACNF_ENA3_Pos (3UL)                 /*!< Position of ENA3 field.                                              */
  #define RADIO_DACNF_ENA3_Msk (0x1UL << RADIO_DACNF_ENA3_Pos) /*!< Bit mask of ENA3 field.                                    */
  #define RADIO_DACNF_ENA3_Min (0x0UL)               /*!< Min enumerator value of ENA3 field.                                  */
  #define RADIO_DACNF_ENA3_Max (0x1UL)               /*!< Max enumerator value of ENA3 field.                                  */
  #define RADIO_DACNF_ENA3_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA3_Enabled (0x1UL)           /*!< Enabled                                                              */

/* ENA4 @Bit 4 : Enable or disable device address matching using device address 4 */
  #define RADIO_DACNF_ENA4_Pos (4UL)                 /*!< Position of ENA4 field.                                              */
  #define RADIO_DACNF_ENA4_Msk (0x1UL << RADIO_DACNF_ENA4_Pos) /*!< Bit mask of ENA4 field.                                    */
  #define RADIO_DACNF_ENA4_Min (0x0UL)               /*!< Min enumerator value of ENA4 field.                                  */
  #define RADIO_DACNF_ENA4_Max (0x1UL)               /*!< Max enumerator value of ENA4 field.                                  */
  #define RADIO_DACNF_ENA4_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA4_Enabled (0x1UL)           /*!< Enabled                                                              */

/* ENA5 @Bit 5 : Enable or disable device address matching using device address 5 */
  #define RADIO_DACNF_ENA5_Pos (5UL)                 /*!< Position of ENA5 field.                                              */
  #define RADIO_DACNF_ENA5_Msk (0x1UL << RADIO_DACNF_ENA5_Pos) /*!< Bit mask of ENA5 field.                                    */
  #define RADIO_DACNF_ENA5_Min (0x0UL)               /*!< Min enumerator value of ENA5 field.                                  */
  #define RADIO_DACNF_ENA5_Max (0x1UL)               /*!< Max enumerator value of ENA5 field.                                  */
  #define RADIO_DACNF_ENA5_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA5_Enabled (0x1UL)           /*!< Enabled                                                              */

/* ENA6 @Bit 6 : Enable or disable device address matching using device address 6 */
  #define RADIO_DACNF_ENA6_Pos (6UL)                 /*!< Position of ENA6 field.                                              */
  #define RADIO_DACNF_ENA6_Msk (0x1UL << RADIO_DACNF_ENA6_Pos) /*!< Bit mask of ENA6 field.                                    */
  #define RADIO_DACNF_ENA6_Min (0x0UL)               /*!< Min enumerator value of ENA6 field.                                  */
  #define RADIO_DACNF_ENA6_Max (0x1UL)               /*!< Max enumerator value of ENA6 field.                                  */
  #define RADIO_DACNF_ENA6_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA6_Enabled (0x1UL)           /*!< Enabled                                                              */

/* ENA7 @Bit 7 : Enable or disable device address matching using device address 7 */
  #define RADIO_DACNF_ENA7_Pos (7UL)                 /*!< Position of ENA7 field.                                              */
  #define RADIO_DACNF_ENA7_Msk (0x1UL << RADIO_DACNF_ENA7_Pos) /*!< Bit mask of ENA7 field.                                    */
  #define RADIO_DACNF_ENA7_Min (0x0UL)               /*!< Min enumerator value of ENA7 field.                                  */
  #define RADIO_DACNF_ENA7_Max (0x1UL)               /*!< Max enumerator value of ENA7 field.                                  */
  #define RADIO_DACNF_ENA7_Disabled (0x0UL)          /*!< Disabled                                                             */
  #define RADIO_DACNF_ENA7_Enabled (0x1UL)           /*!< Enabled                                                              */

/* TXADD0 @Bit 8 : TxAdd for device address 0 */
  #define RADIO_DACNF_TXADD0_Pos (8UL)               /*!< Position of TXADD0 field.                                            */
  #define RADIO_DACNF_TXADD0_Msk (0x1UL << RADIO_DACNF_TXADD0_Pos) /*!< Bit mask of TXADD0 field.                              */

/* TXADD1 @Bit 9 : TxAdd for device address 1 */
  #define RADIO_DACNF_TXADD1_Pos (9UL)               /*!< Position of TXADD1 field.                                            */
  #define RADIO_DACNF_TXADD1_Msk (0x1UL << RADIO_DACNF_TXADD1_Pos) /*!< Bit mask of TXADD1 field.                              */

