NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
  #define REGULATORS_MRAMRECOVERY_BOOTCOUNT_Pos (4UL) /*!< Position of BOOTCOUNT field.                                        */
  #define REGULATORS_MRAMRECOVERY_BOOTCOUNT_Msk (0xFUL << REGULATORS_MRAMRECOVERY_BOOTCOUNT_Pos) /*!< Bit mask of BOOTCOUNT
                                                                            field.*/

/* KEY @Bits 16..31 : Write key. KEY must be written to 0xB7A6 when writing MRAMRECOVERY register. */
  #define REGULATORS_MRAMRECOVERY_KEY_Pos (16UL)     /*!< Position of KEY field.                                               */
  #define REGULATORS_MRAMRECOVERY_KEY_Msk (0xFFFFUL << REGULATORS_MRAMRECOVERY_KEY_Pos) /*!< Bit mask of KEY field.            */
  #define REGULATORS_MRAMRECOVERY_KEY_Min (0xB7A6UL) /*!< Min enumerator value of KEY field.                                   */
  #define REGULATORS_MRAMRECOVERY_KEY_Max (0xB7A6UL) /*!< Max enumerator value of KEY field.                                   */
  #define REGULATORS_MRAMRECOVERY_KEY_Key (0xB7A6UL) /*!< Write key value.                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RESET                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct RESET ======================================================= */
/**
  * @brief Reset control
  */
  typedef struct {                                   /*!< RESET Structure                                                      */
    __IM uint32_t RESERVED[384];
    __IOM uint32_t RESETREAS;                        /*!< (@ 0x00000600) Reset reason                                          */
  } NRF_RESET_Type;                                  /*!< Size = 1540 (0x604)                                                  */

/* RESET_RESETREAS: Reset reason */
  #define RESET_RESETREAS_ResetValue (0x00000000UL)  /*!< Reset value of RESETREAS register.                                   */

/* RESETPIN @Bit 0 : Reset from pin reset detected */
  #define RESET_RESETREAS_RESETPIN_Pos (0UL)         /*!< Position of RESETPIN field.                                          */
  #define RESET_RESETREAS_RESETPIN_Msk (0x1UL << RESET_RESETREAS_RESETPIN_Pos) /*!< Bit mask of RESETPIN field.                */
  #define RESET_RESETREAS_RESETPIN_Min (0x0UL)       /*!< Min enumerator value of RESETPIN field.                              */
  #define RESET_RESETREAS_RESETPIN_Max (0x1UL)       /*!< Max enumerator value of RESETPIN field.                              */
  #define RESET_RESETREAS_RESETPIN_NotDetected (0x0UL) /*!< Not detected                                                       */
  #define RESET_RESETREAS_RESETPIN_Detected (0x1UL)  /*!< Detected                                                             */

/* DOG0 @Bit 1 : Reset from watchdog timer 0 detected */
  #define RESET_RESETREAS_DOG0_Pos (1UL)             /*!< Position of DOG0 field.                                              */
  #define RESET_RESETREAS_DOG0_Msk (0x1UL << RESET_RESETREAS_DOG0_Pos) /*!< Bit mask of DOG0 field.                            */
  #define RESET_RESETREAS_DOG0_Min (0x0UL)           /*!< Min enumerator value of DOG0 field.                                  */
  #define RESET_RESETREAS_DOG0_Max (0x1UL)           /*!< Max enumerator value of DOG0 field.                                  */
  #define RESET_RESETREAS_DOG0_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_DOG0_Detected (0x1UL)      /*!< Detected                                                             */

/* DOG1 @Bit 2 : Reset from watchdog timer 1 detected */
  #define RESET_RESETREAS_DOG1_Pos (2UL)             /*!< Position of DOG1 field.                                              */
  #define RESET_RESETREAS_DOG1_Msk (0x1UL << RESET_RESETREAS_DOG1_Pos) /*!< Bit mask of DOG1 field.                            */
  #define RESET_RESETREAS_DOG1_Min (0x0UL)           /*!< Min enumerator value of DOG1 field.                                  */
  #define RESET_RESETREAS_DOG1_Max (0x1UL)           /*!< Max enumerator value of DOG1 field.                                  */
  #define RESET_RESETREAS_DOG1_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_DOG1_Detected (0x1UL)      /*!< Detected                                                             */

/* CTRLAPSOFT @Bit 3 : Soft reset from CTRL-AP detected */
  #define RESET_RESETREAS_CTRLAPSOFT_Pos (3UL)       /*!< Position of CTRLAPSOFT field.                                        */
  #define RESET_RESETREAS_CTRLAPSOFT_Msk (0x1UL << RESET_RESETREAS_CTRLAPSOFT_Pos) /*!< Bit mask of CTRLAPSOFT field.          */
  #define RESET_RESETREAS_CTRLAPSOFT_Min (0x0UL)     /*!< Min enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_Max (0x1UL)     /*!< Max enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_NotDetected (0x0UL) /*!< Not detected                                                     */
  #define RESET_RESETREAS_CTRLAPSOFT_Detected (0x1UL) /*!< Detected                                                            */

/* CTRLAPHARD @Bit 4 : Reset due to CTRL-AP hard reset */
  #define RESET_RESETREAS_CTRLAPHARD_Pos (4UL)       /*!< Position of CTRLAPHARD field.                                        */
  #define RESET_RESETREAS_CTRLAPHARD_Msk (0x1UL << RESET_RESETREAS_CTRLAPHARD_Pos) /*!< Bit mask of CTRLAPHARD field.          */
  #define RESET_RESETREAS_CTRLAPHARD_Min (0x0UL)     /*!< Min enumerator value of CTRLAPHARD field.                            */
  #define RESET_RESETREAS_CTRLAPHARD_Max (0x1UL)     /*!< Max enumerator value of CTRLAPHARD field.                            */
  #define RESET_RESETREAS_CTRLAPHARD_NotDetected (0x0UL) /*!< Not detected                                                     */
  #define RESET_RESETREAS_CTRLAPHARD_Detected (0x1UL) /*!< Detected                                                            */

/* CTRLAPPIN @Bit 5 : Reset due to CTRL-AP pin reset */
  #define RESET_RESETREAS_CTRLAPPIN_Pos (5UL)        /*!< Position of CTRLAPPIN field.                                         */
  #define RESET_RESETREAS_CTRLAPPIN_Msk (0x1UL << RESET_RESETREAS_CTRLAPPIN_Pos) /*!< Bit mask of CTRLAPPIN field.             */
  #define RESET_RESETREAS_CTRLAPPIN_Min (0x0UL)      /*!< Min enumerator value of CTRLAPPIN field.                             */
  #define RESET_RESETREAS_CTRLAPPIN_Max (0x1UL)      /*!< Max enumerator value of CTRLAPPIN field.                             */
  #define RESET_RESETREAS_CTRLAPPIN_NotDetected (0x0UL) /*!< Not detected                                                      */
  #define RESET_RESETREAS_CTRLAPPIN_Detected (0x1UL) /*!< Detected                                                             */

/* SREQ @Bit 6 : Reset from soft reset detected */
  #define RESET_RESETREAS_SREQ_Pos (6UL)             /*!< Position of SREQ field.                                              */
  #define RESET_RESETREAS_SREQ_Msk (0x1UL << RESET_RESETREAS_SREQ_Pos) /*!< Bit mask of SREQ field.                            */
  #define RESET_RESETREAS_SREQ_Min (0x0UL)           /*!< Min enumerator value of SREQ field.                                  */
  #define RESET_RESETREAS_SREQ_Max (0x1UL)           /*!< Max enumerator value of SREQ field.                                  */
  #define RESET_RESETREAS_SREQ_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_SREQ_Detected (0x1UL)      /*!< Detected                                                             */

