NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* B4 @Bits 0..11 : y-intercept of 5th piece wise linear function */
  #define TEMP_B4_B4_Pos (0UL)                       /*!< Position of B4 field.                                                */
  #define TEMP_B4_B4_Msk (0xFFFUL << TEMP_B4_B4_Pos) /*!< Bit mask of B4 field.                                                */


/* TEMP_B5: y-intercept of 6th piece wise linear function */
  #define TEMP_B5_ResetValue (0x000001EDUL)          /*!< Reset value of B5 register.                                          */

/* B5 @Bits 0..11 : y-intercept of 6th piece wise linear function */
  #define TEMP_B5_B5_Pos (0UL)                       /*!< Position of B5 field.                                                */
  #define TEMP_B5_B5_Msk (0xFFFUL << TEMP_B5_B5_Pos) /*!< Bit mask of B5 field.                                                */


/* TEMP_B6: y-intercept of 7th piece wise linear function */
  #define TEMP_B6_ResetValue (0x00000378UL)          /*!< Reset value of B6 register.                                          */

/* B6 @Bits 0..11 : y-intercept of 7th piece wise linear function */
  #define TEMP_B6_B6_Pos (0UL)                       /*!< Position of B6 field.                                                */
  #define TEMP_B6_B6_Msk (0xFFFUL << TEMP_B6_B6_Pos) /*!< Bit mask of B6 field.                                                */


/* TEMP_T0: End point of 1st piece wise linear function */
  #define TEMP_T0_ResetValue (0x000000EDUL)          /*!< Reset value of T0 register.                                          */

/* T0 @Bits 0..7 : End point of 1st piece wise linear function */
  #define TEMP_T0_T0_Pos (0UL)                       /*!< Position of T0 field.                                                */
  #define TEMP_T0_T0_Msk (0xFFUL << TEMP_T0_T0_Pos)  /*!< Bit mask of T0 field.                                                */


/* TEMP_T1: End point of 2nd piece wise linear function */
  #define TEMP_T1_ResetValue (0x00000013UL)          /*!< Reset value of T1 register.                                          */

/* T1 @Bits 0..7 : End point of 2nd piece wise linear function */
  #define TEMP_T1_T1_Pos (0UL)                       /*!< Position of T1 field.                                                */
  #define TEMP_T1_T1_Msk (0xFFUL << TEMP_T1_T1_Pos)  /*!< Bit mask of T1 field.                                                */


/* TEMP_T2: End point of 3rd piece wise linear function */
  #define TEMP_T2_ResetValue (0x00000029UL)          /*!< Reset value of T2 register.                                          */

/* T2 @Bits 0..7 : End point of 3rd piece wise linear function */
  #define TEMP_T2_T2_Pos (0UL)                       /*!< Position of T2 field.                                                */
  #define TEMP_T2_T2_Msk (0xFFUL << TEMP_T2_T2_Pos)  /*!< Bit mask of T2 field.                                                */


/* TEMP_T3: End point of 4th piece wise linear function */
  #define TEMP_T3_ResetValue (0x0000003CUL)          /*!< Reset value of T3 register.                                          */

/* T3 @Bits 0..7 : End point of 4th piece wise linear function */
  #define TEMP_T3_T3_Pos (0UL)                       /*!< Position of T3 field.                                                */
  #define TEMP_T3_T3_Msk (0xFFUL << TEMP_T3_T3_Pos)  /*!< Bit mask of T3 field.                                                */


/* TEMP_T4: End point of 5th piece wise linear function */
  #define TEMP_T4_ResetValue (0x00000044UL)          /*!< Reset value of T4 register.                                          */

/* T4 @Bits 0..7 : End point of 5th piece wise linear function */
  #define TEMP_T4_T4_Pos (0UL)                       /*!< Position of T4 field.                                                */
  #define TEMP_T4_T4_Msk (0xFFUL << TEMP_T4_T4_Pos)  /*!< Bit mask of T4 field.                                                */


/* TEMP_T5: End point of 6th piece wise linear function */
  #define TEMP_T5_ResetValue (0x00000053UL)          /*!< Reset value of T5 register.                                          */

/* T5 @Bits 0..7 : End point of 6th piece wise linear function */
  #define TEMP_T5_T5_Pos (0UL)                       /*!< Position of T5 field.                                                */
  #define TEMP_T5_T5_Msk (0xFFUL << TEMP_T5_T5_Pos)  /*!< Bit mask of T5 field.                                                */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct TIMER ======================================================= */
/**
  * @brief Timer/Counter
  */
  typedef struct {                                   /*!< TIMER Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start Timer                                           */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop Timer                                            */
    __OM uint32_t TASKS_COUNT;                       /*!< (@ 0x00000008) Increment Timer (Counter mode only)                   */
    __OM uint32_t TASKS_CLEAR;                       /*!< (@ 0x0000000C) Clear time                                            */
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CAPTURE[8];                  /*!< (@ 0x00000040) Capture Timer value to CC[n] register                 */
    __IM uint32_t RESERVED1[8];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_COUNT;                  /*!< (@ 0x00000088) Subscribe configuration for task COUNT                */
    __IOM uint32_t SUBSCRIBE_CLEAR;                  /*!< (@ 0x0000008C) Subscribe configuration for task CLEAR                */
    __IM uint32_t RESERVED2[12];
    __IOM uint32_t SUBSCRIBE_CAPTURE[8];             /*!< (@ 0x000000C0) Subscribe configuration for task CAPTURE[n]           */
    __IM uint32_t RESERVED3[24];
    __IOM uint32_t EVENTS_COMPARE[8];                /*!< (@ 0x00000140) Compare event on CC[n] match                          */
    __IM uint32_t RESERVED4[24];
    __IOM uint32_t PUBLISH_COMPARE[8];               /*!< (@ 0x000001C0) Publish configuration for event COMPARE[n]            */
    __IM uint32_t RESERVED5[8];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED7[125];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000504) Timer mode selection                                  */
    __IOM uint32_t BITMODE;                          /*!< (@ 0x00000508) Configure the number of bits used by the TIMER        */
    __IM uint32_t RESERVED8;
    __IOM uint32_t PRESCALER;                        /*!< (@ 0x00000510) Timer prescaler register                              */
    __IM uint32_t RESERVED9[11];
    __IOM uint32_t CC[8];                            /*!< (@ 0x00000540) Capture/Compare register n                            */
    __IM uint32_t RESERVED10[8];
    __IOM uint32_t ONESHOTEN[8];                     /*!< (@ 0x00000580) Enable one-shot operation for Capture/Compare channel
                                                                         n*/
  } NRF_TIMER_Type;                                  /*!< Size = 1440 (0x5A0)                                                  */

/* TIMER_TASKS_START: Start Timer */
  #define TIMER_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start Timer */
  #define TIMER_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define TIMER_TASKS_START_TASKS_START_Msk (0x1UL << TIMER_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define TIMER_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define TIMER_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define TIMER_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


