NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* TWIM_DMA_RX_MATCH_CANDIDATE: The data to look for - any match will trigger the MATCH[n] event, if enabled. */
  #define TWIM_DMA_RX_MATCH_CANDIDATE_MaxCount (4UL) /*!< Max size of CANDIDATE[4] array.                                      */
  #define TWIM_DMA_RX_MATCH_CANDIDATE_MaxIndex (3UL) /*!< Max index of CANDIDATE[4] array.                                     */
  #define TWIM_DMA_RX_MATCH_CANDIDATE_MinIndex (0UL) /*!< Min index of CANDIDATE[4] array.                                     */
  #define TWIM_DMA_RX_MATCH_CANDIDATE_ResetValue (0x00000000UL) /*!< Reset value of CANDIDATE[4] register.                     */

/* DATA @Bits 0..7 : Data to look for */
  #define TWIM_DMA_RX_MATCH_CANDIDATE_DATA_Pos (0UL) /*!< Position of DATA field.                                              */
  #define TWIM_DMA_RX_MATCH_CANDIDATE_DATA_Msk (0xFFUL << TWIM_DMA_RX_MATCH_CANDIDATE_DATA_Pos) /*!< Bit mask of DATA field.   */



/* =================================================== Struct TWIM_DMA_RX ==================================================== */
/**
  * @brief RX [TWIM_DMA_RX] (unspecified)
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) RAM buffer start address                              */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of bytes in channel buffer             */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of bytes transferred in the last transaction,
                                                                         updated after the END event. Also updated after each
                                                                         MATCH event.*/
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  LIST;                              /*!< (@ 0x00000014) EasyDMA list type                                     */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  TERMINATEONBUSERROR;               /*!< (@ 0x0000001C) Terminate the transaction if a BUSERROR event is
                                                                         detected.*/
  __IM  uint32_t  BUSERRORADDRESS;                   /*!< (@ 0x00000020) Address of transaction that generated the last BUSERROR
                                                                         event.*/
  __IOM NRF_TWIM_DMA_RX_MATCH_Type MATCH;            /*!< (@ 0x00000024) Registers to control the behavior of the pattern
                                                                         matcher engine*/
} NRF_TWIM_DMA_RX_Type;                              /*!< Size = 56 (0x038)                                                    */

/* TWIM_DMA_RX_PTR: RAM buffer start address */
  #define TWIM_DMA_RX_PTR_ResetValue (0x20000000UL)  /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..31 : RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address. */
  #define TWIM_DMA_RX_PTR_PTR_Pos (0UL)              /*!< Position of PTR field.                                               */
  #define TWIM_DMA_RX_PTR_PTR_Msk (0xFFFFFFFFUL << TWIM_DMA_RX_PTR_PTR_Pos) /*!< Bit mask of PTR field.                        */


/* TWIM_DMA_RX_MAXCNT: Maximum number of bytes in channel buffer */
  #define TWIM_DMA_RX_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                    */

/* MAXCNT @Bits 0..15 : Maximum number of bytes in channel buffer */
  #define TWIM_DMA_RX_MAXCNT_MAXCNT_Pos (0UL)        /*!< Position of MAXCNT field.                                            */
  #define TWIM_DMA_RX_MAXCNT_MAXCNT_Msk (0xFFFFUL << TWIM_DMA_RX_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.             */
  #define TWIM_DMA_RX_MAXCNT_MAXCNT_Min (0x0001UL)   /*!< Min value of MAXCNT field.                                           */
  #define TWIM_DMA_RX_MAXCNT_MAXCNT_Max (0xFFFFUL)   /*!< Max size of MAXCNT field.                                            */


/* TWIM_DMA_RX_AMOUNT: Number of bytes transferred in the last transaction, updated after the END event. Also updated after each
                        MATCH event. */

  #define TWIM_DMA_RX_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                    */

/* AMOUNT @Bits 0..15 : Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte. */
  #define TWIM_DMA_RX_AMOUNT_AMOUNT_Pos (0UL)        /*!< Position of AMOUNT field.                                            */
  #define TWIM_DMA_RX_AMOUNT_AMOUNT_Msk (0xFFFFUL << TWIM_DMA_RX_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.             */
  #define TWIM_DMA_RX_AMOUNT_AMOUNT_Min (0x0001UL)   /*!< Min value of AMOUNT field.                                           */
  #define TWIM_DMA_RX_AMOUNT_AMOUNT_Max (0xFFFFUL)   /*!< Max size of AMOUNT field.                                            */


/* TWIM_DMA_RX_LIST: EasyDMA list type */
  #define TWIM_DMA_RX_LIST_ResetValue (0x00000000UL) /*!< Reset value of LIST register.                                        */

/* TYPE @Bits 0..2 : List type */
  #define TWIM_DMA_RX_LIST_TYPE_Pos (0UL)            /*!< Position of TYPE field.                                              */
  #define TWIM_DMA_RX_LIST_TYPE_Msk (0x7UL << TWIM_DMA_RX_LIST_TYPE_Pos) /*!< Bit mask of TYPE field.                          */
  #define TWIM_DMA_RX_LIST_TYPE_Min (0x0UL)          /*!< Min enumerator value of TYPE field.                                  */
  #define TWIM_DMA_RX_LIST_TYPE_Max (0x1UL)          /*!< Max enumerator value of TYPE field.                                  */
  #define TWIM_DMA_RX_LIST_TYPE_Disabled (0x0UL)     /*!< Disable EasyDMA list                                                 */
  #define TWIM_DMA_RX_LIST_TYPE_ArrayList (0x1UL)    /*!< Use array list                                                       */


/* TWIM_DMA_RX_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define TWIM_DMA_RX_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.          */

/* ENABLE @Bit 0 : (unspecified) */
  #define TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                      */
  #define TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                        */
  #define TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                        */
  #define TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                 */
  #define TWIM_DMA_RX_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                   */


