NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define UARTE_EVENTS_DMA_TX_READY_READY_Pos (0UL)  /*!< Position of READY field.                                             */
  #define UARTE_EVENTS_DMA_TX_READY_READY_Msk (0x1UL << UARTE_EVENTS_DMA_TX_READY_READY_Pos) /*!< Bit mask of READY field.     */
  #define UARTE_EVENTS_DMA_TX_READY_READY_Min (0x0UL) /*!< Min enumerator value of READY field.                                */
  #define UARTE_EVENTS_DMA_TX_READY_READY_Max (0x1UL) /*!< Max enumerator value of READY field.                                */
  #define UARTE_EVENTS_DMA_TX_READY_READY_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define UARTE_EVENTS_DMA_TX_READY_READY_Generated (0x1UL) /*!< Event generated                                               */


/* UARTE_EVENTS_DMA_TX_BUSERROR: An error occured during the bus transfer. */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                        */

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                     */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Msk (0x1UL << UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos) /*!< Bit mask of
                                                                            BUSERROR field.*/
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                       */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                       */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define UARTE_EVENTS_DMA_TX_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                         */



/* ================================================= Struct UARTE_EVENTS_DMA ================================================= */
/**
  * @brief EVENTS_DMA [UARTE_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM NRF_UARTE_EVENTS_DMA_RX_Type RX;             /*!< (@ 0x00000000) Peripheral events.                                    */
  __IOM NRF_UARTE_EVENTS_DMA_TX_Type TX;             /*!< (@ 0x0000001C) Peripheral events.                                    */
} NRF_UARTE_EVENTS_DMA_Type;                         /*!< Size = 40 (0x028)                                                    */


/* =============================================== Struct UARTE_PUBLISH_DMA_RX =============================================== */
/**
  * @brief RX [UARTE_PUBLISH_DMA_RX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Publish configuration for event END                   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Publish configuration for event READY                 */
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) Publish configuration for event BUSERROR              */
  __IOM uint32_t  MATCH[4];                          /*!< (@ 0x0000000C) Publish configuration for event MATCH[n]              */
} NRF_UARTE_PUBLISH_DMA_RX_Type;                     /*!< Size = 28 (0x01C)                                                    */

/* UARTE_PUBLISH_DMA_RX_END: Publish configuration for event END */
  #define UARTE_PUBLISH_DMA_RX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define UARTE_PUBLISH_DMA_RX_END_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_END_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_DMA_RX_END_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_END_EN_Pos) /*!< Bit mask of EN field.                */
  #define UARTE_PUBLISH_DMA_RX_END_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_RX_END_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_RX_END_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define UARTE_PUBLISH_DMA_RX_END_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* UARTE_PUBLISH_DMA_RX_READY: Publish configuration for event READY */
  #define UARTE_PUBLISH_DMA_RX_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Msk (0xFFUL << UARTE_PUBLISH_DMA_RX_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define UARTE_PUBLISH_DMA_RX_READY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Msk (0x1UL << UARTE_PUBLISH_DMA_RX_READY_EN_Pos) /*!< Bit mask of EN field.            */
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define UARTE_PUBLISH_DMA_RX_READY_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


