NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* ID @Bit 31 : Overrides OTG ID pin signal */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Pos (31UL)     /*!< Position of ID field.                                                */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_ID_Pos) /*!< Bit mask of ID field.                */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Min (0x0UL)    /*!< Min enumerator value of ID field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Max (0x1UL)    /*!< Max enumerator value of ID field.                                    */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Device (0x1UL) /*!< Role is Device                                                       */
  #define USBHS_PHY_OVERRIDEVALUES_ID_Host (0x0UL)   /*!< Role is Host.                                                        */


/* USBHS_PHY_RTUNE: The RTUNE mode is an alternative method for calibrating the DP and DM 45-Ohm source impedance. */
  #define USBHS_PHY_RTUNE_ResetValue (0x0000000FUL)  /*!< Reset value of RTUNE register.                                       */

/* RTUNESEL @Bit 0 : This signal selects the tuning method for the high-speed DP and DM source impedance of the USBHS. */
  #define USBHS_PHY_RTUNE_RTUNESEL_Pos (0UL)         /*!< Position of RTUNESEL field.                                          */
  #define USBHS_PHY_RTUNE_RTUNESEL_Msk (0x1UL << USBHS_PHY_RTUNE_RTUNESEL_Pos) /*!< Bit mask of RTUNESEL field.                */
  #define USBHS_PHY_RTUNE_RTUNESEL_Min (0x0UL)       /*!< Min enumerator value of RTUNESEL field.                              */
  #define USBHS_PHY_RTUNE_RTUNESEL_Max (0x1UL)       /*!< Max enumerator value of RTUNESEL field.                              */
  #define USBHS_PHY_RTUNE_RTUNESEL_TXRTUNE (0x1UL)   /*!< The TXRTUNE pin, external resistor REXT, and resulting internal
                                                          digital calibration code are used for tuning the high-speed source
                                                          impedance.*/
  #define USBHS_PHY_RTUNE_RTUNESEL_RTUNE (0x0UL)     /*!< The RCALCODE value is used for tuning the high-speed source
                                                          impedance.*/

/* RCALCODE @Bits 1..4 : This signal is used to tune the internal 200 ohm resistor or the USBHS DP and DM high-speed source
                         impedance. */

  #define USBHS_PHY_RTUNE_RCALCODE_Pos (1UL)         /*!< Position of RCALCODE field.                                          */
  #define USBHS_PHY_RTUNE_RCALCODE_Msk (0xFUL << USBHS_PHY_RTUNE_RCALCODE_Pos) /*!< Bit mask of RCALCODE field.                */


/* ====================================================== Struct USBHS ======================================================= */
/**
  * @brief USBHS
  */
  typedef struct {                                   /*!< USBHS Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the USB peripheral.                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop the USB peripheral                               */
    __IM uint32_t RESERVED[94];
    __IOM uint32_t PUBLISH_SOF;                      /*!< (@ 0x00000180) Publish configuration for SOF event.                  */
    __IM uint32_t RESERVED1[159];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable USB peripheral.                                */
    __IM uint32_t RESERVED2[15];
    __IOM NRF_USBHS_PHY_Type PHY;                    /*!< (@ 0x00000440) (unspecified)                                         */
  } NRF_USBHS_Type;                                  /*!< Size = 1128 (0x468)                                                  */

/* USBHS_TASKS_START: Start the USB peripheral. */
  #define USBHS_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the USB peripheral. */
  #define USBHS_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define USBHS_TASKS_START_TASKS_START_Msk (0x1UL << USBHS_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define USBHS_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* USBHS_TASKS_STOP: Stop the USB peripheral */
  #define USBHS_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop the USB peripheral */
  #define USBHS_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << USBHS_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* USBHS_PUBLISH_SOF: Publish configuration for SOF event. */
  #define USBHS_PUBLISH_SOF_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SOF register.                                */

/* CHIDX @Bits 0..7 : DPPI channel to publish to */
  #define USBHS_PUBLISH_SOF_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define USBHS_PUBLISH_SOF_CHIDX_Msk (0xFFUL << USBHS_PUBLISH_SOF_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define USBHS_PUBLISH_SOF_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define USBHS_PUBLISH_SOF_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : Enable publishing of SOF event */
  #define USBHS_PUBLISH_SOF_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define USBHS_PUBLISH_SOF_EN_Msk (0x1UL << USBHS_PUBLISH_SOF_EN_Pos) /*!< Bit mask of EN field.                              */
  #define USBHS_PUBLISH_SOF_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define USBHS_PUBLISH_SOF_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define USBHS_PUBLISH_SOF_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define USBHS_PUBLISH_SOF_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* USBHS_ENABLE: Enable USB peripheral. */
  #define USBHS_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* CORE @Bit 0 : Enable USB Controller */
  #define USBHS_ENABLE_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define USBHS_ENABLE_CORE_Msk (0x1UL << USBHS_ENABLE_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Disabled (0x0UL)         /*!< USB Controller disabled.                                             */
  #define USBHS_ENABLE_CORE_Enabled (0x1UL)          /*!< USB Controller enabled.                                              */

/* PHY @Bit 1 : Enable USB PHY */
  #define USBHS_ENABLE_PHY_Pos (1UL)                 /*!< Position of PHY field.                                               */
  #define USBHS_ENABLE_PHY_Msk (0x1UL << USBHS_ENABLE_PHY_Pos) /*!< Bit mask of PHY field.                                     */
  #define USBHS_ENABLE_PHY_Min (0x0UL)               /*!< Min enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Max (0x1UL)               /*!< Max enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Disabled (0x0UL)          /*!< USB PHY disabled.                                                    */
  #define USBHS_ENABLE_PHY_Enabled (0x1UL)           /*!< USB PHY enabled.                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         USBHSCORE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

