NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* NAK @Bit 4 : NAK Response Received Interrupt (NAK) */
  #define USBHSCORE_HC_INT_NAK_Pos (4UL)             /*!< Position of NAK field.                                               */
  #define USBHSCORE_HC_INT_NAK_Msk (0x1UL << USBHSCORE_HC_INT_NAK_Pos) /*!< Bit mask of NAK field.                             */
  #define USBHSCORE_HC_INT_NAK_Min (0x0UL)           /*!< Min enumerator value of NAK field.                                   */
  #define USBHSCORE_HC_INT_NAK_Max (0x1UL)           /*!< Max enumerator value of NAK field.                                   */
  #define USBHSCORE_HC_INT_NAK_INACTIVE (0x0UL)      /*!< No NAK Response Received Interrupt                                   */
  #define USBHSCORE_HC_INT_NAK_ACTIVE (0x1UL)        /*!< NAK Response Received Interrupt                                      */

/* ACK @Bit 5 : ACK Response Received/Transmitted Interrupt (ACK) */
  #define USBHSCORE_HC_INT_ACK_Pos (5UL)             /*!< Position of ACK field.                                               */
  #define USBHSCORE_HC_INT_ACK_Msk (0x1UL << USBHSCORE_HC_INT_ACK_Pos) /*!< Bit mask of ACK field.                             */
  #define USBHSCORE_HC_INT_ACK_Min (0x0UL)           /*!< Min enumerator value of ACK field.                                   */
  #define USBHSCORE_HC_INT_ACK_Max (0x1UL)           /*!< Max enumerator value of ACK field.                                   */
  #define USBHSCORE_HC_INT_ACK_INACTIVE (0x0UL)      /*!< No ACK Response Received or Transmitted Interrupt                    */
  #define USBHSCORE_HC_INT_ACK_ACTIVE (0x1UL)        /*!< ACK Response Received or Transmitted Interrup                        */

/* NYET @Bit 6 : NYET Response Received Interrupt (NYET) */
  #define USBHSCORE_HC_INT_NYET_Pos (6UL)            /*!< Position of NYET field.                                              */
  #define USBHSCORE_HC_INT_NYET_Msk (0x1UL << USBHSCORE_HC_INT_NYET_Pos) /*!< Bit mask of NYET field.                          */
  #define USBHSCORE_HC_INT_NYET_Min (0x0UL)          /*!< Min enumerator value of NYET field.                                  */
  #define USBHSCORE_HC_INT_NYET_Max (0x1UL)          /*!< Max enumerator value of NYET field.                                  */
  #define USBHSCORE_HC_INT_NYET_INACTIVE (0x0UL)     /*!< No NYET Response Received Interrupt                                  */
  #define USBHSCORE_HC_INT_NYET_ACTIVE (0x1UL)       /*!< NYET Response Received Interrupt                                     */

/* XACTERR @Bit 7 : Transaction Error (XactErr) */
  #define USBHSCORE_HC_INT_XACTERR_Pos (7UL)         /*!< Position of XACTERR field.                                           */
  #define USBHSCORE_HC_INT_XACTERR_Msk (0x1UL << USBHSCORE_HC_INT_XACTERR_Pos) /*!< Bit mask of XACTERR field.                 */
  #define USBHSCORE_HC_INT_XACTERR_Min (0x0UL)       /*!< Min enumerator value of XACTERR field.                               */
  #define USBHSCORE_HC_INT_XACTERR_Max (0x1UL)       /*!< Max enumerator value of XACTERR field.                               */
  #define USBHSCORE_HC_INT_XACTERR_INACTIVE (0x0UL)  /*!< No Transaction Error                                                 */
  #define USBHSCORE_HC_INT_XACTERR_ACTIVE (0x1UL)    /*!< Transaction Error                                                    */

/* BBLERR @Bit 8 : Babble Error (BblErr) */
  #define USBHSCORE_HC_INT_BBLERR_Pos (8UL)          /*!< Position of BBLERR field.                                            */
  #define USBHSCORE_HC_INT_BBLERR_Msk (0x1UL << USBHSCORE_HC_INT_BBLERR_Pos) /*!< Bit mask of BBLERR field.                    */
  #define USBHSCORE_HC_INT_BBLERR_Min (0x0UL)        /*!< Min enumerator value of BBLERR field.                                */
  #define USBHSCORE_HC_INT_BBLERR_Max (0x1UL)        /*!< Max enumerator value of BBLERR field.                                */
  #define USBHSCORE_HC_INT_BBLERR_INACTIVE (0x0UL)   /*!< No Babble Error                                                      */
  #define USBHSCORE_HC_INT_BBLERR_ACTIVE (0x1UL)     /*!< Babble Error                                                         */

/* FRMOVRUN @Bit 9 : Frame Overrun (FrmOvrun). */
  #define USBHSCORE_HC_INT_FRMOVRUN_Pos (9UL)        /*!< Position of FRMOVRUN field.                                          */
  #define USBHSCORE_HC_INT_FRMOVRUN_Msk (0x1UL << USBHSCORE_HC_INT_FRMOVRUN_Pos) /*!< Bit mask of FRMOVRUN field.              */
  #define USBHSCORE_HC_INT_FRMOVRUN_Min (0x0UL)      /*!< Min enumerator value of FRMOVRUN field.                              */
  #define USBHSCORE_HC_INT_FRMOVRUN_Max (0x1UL)      /*!< Max enumerator value of FRMOVRUN field.                              */
  #define USBHSCORE_HC_INT_FRMOVRUN_INACTIVE (0x0UL) /*!< No Frame Overrun                                                     */
  #define USBHSCORE_HC_INT_FRMOVRUN_ACTIVE (0x1UL)   /*!< Frame Overrun                                                        */

/* DATATGLERR @Bit 10 : (unspecified) */
  #define USBHSCORE_HC_INT_DATATGLERR_Pos (10UL)     /*!< Position of DATATGLERR field.                                        */
  #define USBHSCORE_HC_INT_DATATGLERR_Msk (0x1UL << USBHSCORE_HC_INT_DATATGLERR_Pos) /*!< Bit mask of DATATGLERR field.        */
  #define USBHSCORE_HC_INT_DATATGLERR_Min (0x0UL)    /*!< Min enumerator value of DATATGLERR field.                            */
  #define USBHSCORE_HC_INT_DATATGLERR_Max (0x1UL)    /*!< Max enumerator value of DATATGLERR field.                            */
  #define USBHSCORE_HC_INT_DATATGLERR_INACTIVE (0x0UL) /*!< No Data Toggle Error                                               */
  #define USBHSCORE_HC_INT_DATATGLERR_ACTIVE (0x1UL) /*!< Data Toggle Error                                                    */

/* BNAINTR @Bit 11 : BNA (Buffer Not Available) Interrupt (BNAIntr) */
  #define USBHSCORE_HC_INT_BNAINTR_Pos (11UL)        /*!< Position of BNAINTR field.                                           */
  #define USBHSCORE_HC_INT_BNAINTR_Msk (0x1UL << USBHSCORE_HC_INT_BNAINTR_Pos) /*!< Bit mask of BNAINTR field.                 */
  #define USBHSCORE_HC_INT_BNAINTR_Min (0x0UL)       /*!< Min enumerator value of BNAINTR field.                               */
  #define USBHSCORE_HC_INT_BNAINTR_Max (0x1UL)       /*!< Max enumerator value of BNAINTR field.                               */
  #define USBHSCORE_HC_INT_BNAINTR_INACTIVE (0x0UL)  /*!< No BNA Interrupt                                                     */
  #define USBHSCORE_HC_INT_BNAINTR_ACTIVE (0x1UL)    /*!< BNA Interrupt                                                        */

