NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* USBHSCORE_GOTGINT: Interrupt Register */
  #define USBHSCORE_GOTGINT_ResetValue (0x00000000UL) /*!< Reset value of GOTGINT register.                                    */

/* SESENDDET @Bit 2 : Mode: Host and Device. Session End Detected (SesEndDet) */
  #define USBHSCORE_GOTGINT_SESENDDET_Pos (2UL)      /*!< Position of SESENDDET field.                                         */
  #define USBHSCORE_GOTGINT_SESENDDET_Msk (0x1UL << USBHSCORE_GOTGINT_SESENDDET_Pos) /*!< Bit mask of SESENDDET field.         */
  #define USBHSCORE_GOTGINT_SESENDDET_Min (0x0UL)    /*!< Min enumerator value of SESENDDET field.                             */
  #define USBHSCORE_GOTGINT_SESENDDET_Max (0x1UL)    /*!< Max enumerator value of SESENDDET field.                             */
  #define USBHSCORE_GOTGINT_SESENDDET_INACTIVE (0x0UL) /*!< Session is Active                                                  */
  #define USBHSCORE_GOTGINT_SESENDDET_ACTIVE (0x1UL) /*!< SessionEnd utmiotg_bvalid signal is deasserted                       */

/* SESREQSUCSTSCHNG @Bit 8 : Mode: Host and Device. Session Request Success Status Change (SesReqSucStsChng) */
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Pos (8UL) /*!< Position of SESREQSUCSTSCHNG field.                                */
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Msk (0x1UL << USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Pos) /*!< Bit mask of
                                                                            SESREQSUCSTSCHNG field.*/
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Min (0x0UL) /*!< Min enumerator value of SESREQSUCSTSCHNG field.                  */
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_Max (0x1UL) /*!< Max enumerator value of SESREQSUCSTSCHNG field.                  */
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_INACTIVE (0x0UL) /*!< No Change in Session Request Status                         */
  #define USBHSCORE_GOTGINT_SESREQSUCSTSCHNG_ACTIVE (0x1UL) /*!< Session Request Status has changed                            */

/* HSTNEGSUCSTSCHNG @Bit 9 : Mode: Host and Device. Host Negotiation Success Status Change (HstNegSucStsChng) */
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Pos (9UL) /*!< Position of HSTNEGSUCSTSCHNG field.                                */
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Msk (0x1UL << USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Pos) /*!< Bit mask of
                                                                            HSTNEGSUCSTSCHNG field.*/
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Min (0x0UL) /*!< Min enumerator value of HSTNEGSUCSTSCHNG field.                  */
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_Max (0x1UL) /*!< Max enumerator value of HSTNEGSUCSTSCHNG field.                  */
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_INACTIVE (0x0UL) /*!< No Change                                                   */
  #define USBHSCORE_GOTGINT_HSTNEGSUCSTSCHNG_ACTIVE (0x1UL) /*!< Host Negotiation Status Change                                */

/* HSTNEGDET @Bit 17 : Mode:Host and Device. Host Negotiation Detected (HstNegDet) */
  #define USBHSCORE_GOTGINT_HSTNEGDET_Pos (17UL)     /*!< Position of HSTNEGDET field.                                         */
  #define USBHSCORE_GOTGINT_HSTNEGDET_Msk (0x1UL << USBHSCORE_GOTGINT_HSTNEGDET_Pos) /*!< Bit mask of HSTNEGDET field.         */
  #define USBHSCORE_GOTGINT_HSTNEGDET_Min (0x0UL)    /*!< Min enumerator value of HSTNEGDET field.                             */
  #define USBHSCORE_GOTGINT_HSTNEGDET_Max (0x1UL)    /*!< Max enumerator value of HSTNEGDET field.                             */
  #define USBHSCORE_GOTGINT_HSTNEGDET_INACTIVE (0x0UL) /*!< No Active HNP Request                                              */
  #define USBHSCORE_GOTGINT_HSTNEGDET_ACTIVE (0x1UL) /*!< Active HNP request detected                                          */

/* ADEVTOUTCHG @Bit 18 : Mode: Host and Device. A-Device Timeout Change (ADevTOUTChg) */
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Pos (18UL)   /*!< Position of ADEVTOUTCHG field.                                       */
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Msk (0x1UL << USBHSCORE_GOTGINT_ADEVTOUTCHG_Pos) /*!< Bit mask of ADEVTOUTCHG field.   */
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Min (0x0UL)  /*!< Min enumerator value of ADEVTOUTCHG field.                           */
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_Max (0x1UL)  /*!< Max enumerator value of ADEVTOUTCHG field.                           */
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_INACTIVE (0x0UL) /*!< No A-Device Timeout                                              */
  #define USBHSCORE_GOTGINT_ADEVTOUTCHG_ACTIVE (0x1UL) /*!< A-Device Timeout                                                   */

/* DBNCEDONE @Bit 19 : Mode: Host only. Debounce Done (DbnceDone) */
  #define USBHSCORE_GOTGINT_DBNCEDONE_Pos (19UL)     /*!< Position of DBNCEDONE field.                                         */
  #define USBHSCORE_GOTGINT_DBNCEDONE_Msk (0x1UL << USBHSCORE_GOTGINT_DBNCEDONE_Pos) /*!< Bit mask of DBNCEDONE field.         */
  #define USBHSCORE_GOTGINT_DBNCEDONE_Min (0x0UL)    /*!< Min enumerator value of DBNCEDONE field.                             */
  #define USBHSCORE_GOTGINT_DBNCEDONE_Max (0x1UL)    /*!< Max enumerator value of DBNCEDONE field.                             */
  #define USBHSCORE_GOTGINT_DBNCEDONE_INACTIVE (0x0UL) /*!< After Connect waiting for Debounce to complete                     */
  #define USBHSCORE_GOTGINT_DBNCEDONE_ACTIVE (0x1UL) /*!< Debounce completed                                                   */

/* MULTVALIPCHNG @Bit 20 : This bit when set indicates that there is a change in the value of at least one ACA pin value. */
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Pos (20UL) /*!< Position of MULTVALIPCHNG field.                                     */
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Msk (0x1UL << USBHSCORE_GOTGINT_MULTVALIPCHNG_Pos) /*!< Bit mask of MULTVALIPCHNG
                                                                            field.*/
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Min (0x0UL) /*!< Min enumerator value of MULTVALIPCHNG field.                        */
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_Max (0x1UL) /*!< Max enumerator value of MULTVALIPCHNG field.                        */
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_NO_ACA_PIN_CHANGE (0x0UL) /*!< Indicates there is no change in ACA pin value         */
  #define USBHSCORE_GOTGINT_MULTVALIPCHNG_ACA_PIN_CHANGE (0x1UL) /*!< Indicates there is a change in ACA pin value             */


/* USBHSCORE_GAHBCFG: AHB Configuration Register */
  #define USBHSCORE_GAHBCFG_ResetValue (0x0A000000UL) /*!< Reset value of GAHBCFG register.                                    */

/* GLBLINTRMSK @Bit 0 : Mode: Host and device. Global Interrupt Mask (GlblIntrMsk) */
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Pos (0UL)    /*!< Position of GLBLINTRMSK field.                                       */
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Msk (0x1UL << USBHSCORE_GAHBCFG_GLBLINTRMSK_Pos) /*!< Bit mask of GLBLINTRMSK field.   */
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Min (0x0UL)  /*!< Min enumerator value of GLBLINTRMSK field.                           */
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_Max (0x1UL)  /*!< Max enumerator value of GLBLINTRMSK field.                           */
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_MASK (0x0UL) /*!< Mask the interrupt assertion to the application                      */
  #define USBHSCORE_GAHBCFG_GLBLINTRMSK_NOMASK (0x1UL) /*!< Unmask the interrupt assertion to the application.                 */

/* HBSTLEN @Bits 1..4 : Mode: Host and device. Burst Length/Type (HBstLen) */
  #define USBHSCORE_GAHBCFG_HBSTLEN_Pos (1UL)        /*!< Position of HBSTLEN field.                                           */
  #define USBHSCORE_GAHBCFG_HBSTLEN_Msk (0xFUL << USBHSCORE_GAHBCFG_HBSTLEN_Pos) /*!< Bit mask of HBSTLEN field.               */
  #define USBHSCORE_GAHBCFG_HBSTLEN_Min (0x0UL)      /*!< Min enumerator value of HBSTLEN field.                               */
  #define USBHSCORE_GAHBCFG_HBSTLEN_Max (0x8UL)      /*!< Max enumerator value of HBSTLEN field.                               */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD1ORSINGLE (0x0UL) /*!< 1 word or single                                                */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD4ORINCR (0x1UL) /*!< 4 words or INCR                                                   */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD8 (0x2UL)    /*!< 8 words                                                              */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD16ORINCR4 (0x3UL) /*!< 16 words or INCR4                                               */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD32 (0x4UL)   /*!< 32 words                                                             */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD64ORINCR8 (0x5UL) /*!< 64 words or INCR8                                               */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD128 (0x6UL)  /*!< 128 words                                                            */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORD256ORINCR16 (0x7UL) /*!< 256 words or INCR16                                           */
  #define USBHSCORE_GAHBCFG_HBSTLEN_WORDX (0x8UL)    /*!< Others reserved                                                      */

