NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* USBHSCORE_GUSBCFG: USB Configuration Register */
  #define USBHSCORE_GUSBCFG_ResetValue (0x10001400UL) /*!< Reset value of GUSBCFG register.                                    */

/* TOUTCAL @Bits 0..2 : Mode: Host and Device. HS/FS Timeout Calibration (TOutCal) */
  #define USBHSCORE_GUSBCFG_TOUTCAL_Pos (0UL)        /*!< Position of TOUTCAL field.                                           */
  #define USBHSCORE_GUSBCFG_TOUTCAL_Msk (0x7UL << USBHSCORE_GUSBCFG_TOUTCAL_Pos) /*!< Bit mask of TOUTCAL field.               */
  #define USBHSCORE_GUSBCFG_TOUTCAL_Min (0x0UL)      /*!< Min enumerator value of TOUTCAL field.                               */
  #define USBHSCORE_GUSBCFG_TOUTCAL_Max (0x7UL)      /*!< Max enumerator value of TOUTCAL field.                               */
  #define USBHSCORE_GUSBCFG_TOUTCAL_ZERO (0x0UL)     /*!< Add 0 PHY clocks                                                     */
  #define USBHSCORE_GUSBCFG_TOUTCAL_ONE (0x1UL)      /*!< Add 1 PHY clocks                                                     */
  #define USBHSCORE_GUSBCFG_TOUTCAL_TWO (0x2UL)      /*!< Add 2 PHY clocks                                                     */
  #define USBHSCORE_GUSBCFG_TOUTCAL_THREE (0x3UL)    /*!< Add 3 PHY clocks                                                     */
  #define USBHSCORE_GUSBCFG_TOUTCAL_FOUR (0x4UL)     /*!< Add 4 PHY clocks                                                     */
  #define USBHSCORE_GUSBCFG_TOUTCAL_FIVE (0x5UL)     /*!< Add 5 PHY clocks                                                     */
  #define USBHSCORE_GUSBCFG_TOUTCAL_SIX (0x6UL)      /*!< Add 6 PHY clocks                                                     */
  #define USBHSCORE_GUSBCFG_TOUTCAL_SEVEN (0x7UL)    /*!< Add 7 PHY clocks                                                     */

/* PHYIF @Bit 3 : Mode: Host and Device. PHY Interface (PHYIf) */
  #define USBHSCORE_GUSBCFG_PHYIF_Pos (3UL)          /*!< Position of PHYIF field.                                             */
  #define USBHSCORE_GUSBCFG_PHYIF_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYIF_Pos) /*!< Bit mask of PHYIF field.                     */
  #define USBHSCORE_GUSBCFG_PHYIF_Min (0x0UL)        /*!< Min enumerator value of PHYIF field.                                 */
  #define USBHSCORE_GUSBCFG_PHYIF_Max (0x1UL)        /*!< Max enumerator value of PHYIF field.                                 */
  #define USBHSCORE_GUSBCFG_PHYIF_BITS8 (0x0UL)      /*!< PHY 8bit Mode                                                        */
  #define USBHSCORE_GUSBCFG_PHYIF_BITS16 (0x1UL)     /*!< PHY 16bit Mode                                                       */

/* ULPIUTMISEL @Bit 4 : Mode: Host and Device. ULPI or UTMI+ Select (ULPI_UTMI_Sel) */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Pos (4UL)    /*!< Position of ULPIUTMISEL field.                                       */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Msk (0x1UL << USBHSCORE_GUSBCFG_ULPIUTMISEL_Pos) /*!< Bit mask of ULPIUTMISEL field.   */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Min (0x0UL)  /*!< Min enumerator value of ULPIUTMISEL field.                           */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_Max (0x1UL)  /*!< Max enumerator value of ULPIUTMISEL field.                           */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_UTMI (0x0UL) /*!< UTMI+ Interface                                                      */
  #define USBHSCORE_GUSBCFG_ULPIUTMISEL_ULPI (0x1UL) /*!< ULPI Interface                                                       */

/* FSINTF @Bit 5 : Mode: Host and Device. Full-Speed Serial Interface Select (FSIntf) */
  #define USBHSCORE_GUSBCFG_FSINTF_Pos (5UL)         /*!< Position of FSINTF field.                                            */
  #define USBHSCORE_GUSBCFG_FSINTF_Msk (0x1UL << USBHSCORE_GUSBCFG_FSINTF_Pos) /*!< Bit mask of FSINTF field.                  */
  #define USBHSCORE_GUSBCFG_FSINTF_Min (0x0UL)       /*!< Min enumerator value of FSINTF field.                                */
  #define USBHSCORE_GUSBCFG_FSINTF_Max (0x1UL)       /*!< Max enumerator value of FSINTF field.                                */
  #define USBHSCORE_GUSBCFG_FSINTF_FS6PIN (0x0UL)    /*!< 6-pin unidirectional full-speed serial interface                     */
  #define USBHSCORE_GUSBCFG_FSINTF_FS3PIN (0x1UL)    /*!< 3-pin bidirectional full-speed serial interface                      */

/* PHYSEL @Bit 6 : PHYSel */
  #define USBHSCORE_GUSBCFG_PHYSEL_Pos (6UL)         /*!< Position of PHYSEL field.                                            */
  #define USBHSCORE_GUSBCFG_PHYSEL_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYSEL_Pos) /*!< Bit mask of PHYSEL field.                  */
  #define USBHSCORE_GUSBCFG_PHYSEL_Min (0x0UL)       /*!< Min enumerator value of PHYSEL field.                                */
  #define USBHSCORE_GUSBCFG_PHYSEL_Max (0x1UL)       /*!< Max enumerator value of PHYSEL field.                                */
  #define USBHSCORE_GUSBCFG_PHYSEL_USB20 (0x0UL)     /*!< USB 2.0 high-speed UTMI+ or ULPI PHY is selected                     */
  #define USBHSCORE_GUSBCFG_PHYSEL_USB11 (0x1UL)     /*!< USB 1.1 full-speed serial transceiver is selected                    */

/* USBTRDTIM @Bits 10..13 : Mode: Device only. USB Turnaround Time (USBTrdTim) */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Pos (10UL)     /*!< Position of USBTRDTIM field.                                         */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Msk (0xFUL << USBHSCORE_GUSBCFG_USBTRDTIM_Pos) /*!< Bit mask of USBTRDTIM field.         */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Min (0x5UL)    /*!< Min enumerator value of USBTRDTIM field.                             */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_Max (0x9UL)    /*!< Max enumerator value of USBTRDTIM field.                             */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_TURNTIME16BIT (0x5UL) /*!< MAC interface is 16-bit UTMI+.                                */
  #define USBHSCORE_GUSBCFG_USBTRDTIM_TURNTIME8BIT (0x9UL) /*!< MAC interface is 8-bit UTMI+.                                  */

/* PHYLPWRCLKSEL @Bit 15 : PHY Low-Power Clock Select (PhyLPwrClkSel) */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Pos (15UL) /*!< Position of PHYLPWRCLKSEL field.                                     */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Msk (0x1UL << USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Pos) /*!< Bit mask of PHYLPWRCLKSEL
                                                                            field.*/
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Min (0x0UL) /*!< Min enumerator value of PHYLPWRCLKSEL field.                        */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_Max (0x1UL) /*!< Max enumerator value of PHYLPWRCLKSEL field.                        */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_INTPLLCLK (0x0UL) /*!< 480-MHz Internal PLL clock                                    */
  #define USBHSCORE_GUSBCFG_PHYLPWRCLKSEL_EXTCLK (0x1UL) /*!< 48-MHz External Clock                                            */

