NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* PRTPWR @Bit 12 : Port Power (PrtPwr) */
  #define USBHSCORE_HPRT_PRTPWR_Pos (12UL)           /*!< Position of PRTPWR field.                                            */
  #define USBHSCORE_HPRT_PRTPWR_Msk (0x1UL << USBHSCORE_HPRT_PRTPWR_Pos) /*!< Bit mask of PRTPWR field.                        */
  #define USBHSCORE_HPRT_PRTPWR_Min (0x0UL)          /*!< Min enumerator value of PRTPWR field.                                */
  #define USBHSCORE_HPRT_PRTPWR_Max (0x1UL)          /*!< Max enumerator value of PRTPWR field.                                */
  #define USBHSCORE_HPRT_PRTPWR_OFF (0x0UL)          /*!< Power off                                                            */
  #define USBHSCORE_HPRT_PRTPWR_ON (0x1UL)           /*!< Power on                                                             */

/* PRTTSTCTL @Bits 13..16 : Port Test Control (PrtTstCtl) */
  #define USBHSCORE_HPRT_PRTTSTCTL_Pos (13UL)        /*!< Position of PRTTSTCTL field.                                         */
  #define USBHSCORE_HPRT_PRTTSTCTL_Msk (0xFUL << USBHSCORE_HPRT_PRTTSTCTL_Pos) /*!< Bit mask of PRTTSTCTL field.               */
  #define USBHSCORE_HPRT_PRTTSTCTL_Min (0x0UL)       /*!< Min enumerator value of PRTTSTCTL field.                             */
  #define USBHSCORE_HPRT_PRTTSTCTL_Max (0x5UL)       /*!< Max enumerator value of PRTTSTCTL field.                             */
  #define USBHSCORE_HPRT_PRTTSTCTL_DISABLED (0x0UL)  /*!< Test mode disabled                                                   */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTJ (0x1UL)     /*!< Test_J mode                                                          */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTK (0x2UL)     /*!< Test_K mode                                                          */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTSN (0x3UL)    /*!< Test_SE0_NAK mode                                                    */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTPM (0x4UL)    /*!< Test_Packet mode                                                     */
  #define USBHSCORE_HPRT_PRTTSTCTL_TESTFENB (0x5UL)  /*!< Test_force_Enable                                                    */

/* PRTSPD @Bits 17..18 : Port Speed (PrtSpd) */
  #define USBHSCORE_HPRT_PRTSPD_Pos (17UL)           /*!< Position of PRTSPD field.                                            */
  #define USBHSCORE_HPRT_PRTSPD_Msk (0x3UL << USBHSCORE_HPRT_PRTSPD_Pos) /*!< Bit mask of PRTSPD field.                        */
  #define USBHSCORE_HPRT_PRTSPD_Min (0x0UL)          /*!< Min enumerator value of PRTSPD field.                                */
  #define USBHSCORE_HPRT_PRTSPD_Max (0x2UL)          /*!< Max enumerator value of PRTSPD field.                                */
  #define USBHSCORE_HPRT_PRTSPD_HIGHSPD (0x0UL)      /*!< High speed                                                           */
  #define USBHSCORE_HPRT_PRTSPD_FULLSPD (0x1UL)      /*!< Full speed                                                           */
  #define USBHSCORE_HPRT_PRTSPD_LOWSPD (0x2UL)       /*!< Low speed                                                            */


/* USBHSCORE_DCFG: Device Configuration Register */
  #define USBHSCORE_DCFG_ResetValue (0x08020000UL)   /*!< Reset value of DCFG register.                                        */

/* DEVSPD @Bits 0..1 : Device Speed (DevSpd) */
  #define USBHSCORE_DCFG_DEVSPD_Pos (0UL)            /*!< Position of DEVSPD field.                                            */
  #define USBHSCORE_DCFG_DEVSPD_Msk (0x3UL << USBHSCORE_DCFG_DEVSPD_Pos) /*!< Bit mask of DEVSPD field.                        */
  #define USBHSCORE_DCFG_DEVSPD_Min (0x0UL)          /*!< Min enumerator value of DEVSPD field.                                */
  #define USBHSCORE_DCFG_DEVSPD_Max (0x3UL)          /*!< Max enumerator value of DEVSPD field.                                */
  #define USBHSCORE_DCFG_DEVSPD_USBHS20 (0x0UL)      /*!< High speed USB 2.0 PHY clock is 30 MHz or 60 MHz                     */
  #define USBHSCORE_DCFG_DEVSPD_USBFS20 (0x1UL)      /*!< Full speed USB 2.0 PHY clock is 30 MHz or 60 MHz                     */
  #define USBHSCORE_DCFG_DEVSPD_USBLS116 (0x2UL)     /*!< Low speed USB 1.1 transceiver clock is 6 MHz                         */
  #define USBHSCORE_DCFG_DEVSPD_USBFS1148 (0x3UL)    /*!< Full speed USB 1.1 transceiver clock is 48 MHz                       */

/* NZSTSOUTHSHK @Bit 2 : Non-Zero-Length Status OUT Handshake (NZStsOUTHShk) */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Pos (2UL)      /*!< Position of NZSTSOUTHSHK field.                                      */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Msk (0x1UL << USBHSCORE_DCFG_NZSTSOUTHSHK_Pos) /*!< Bit mask of NZSTSOUTHSHK field.      */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Min (0x0UL)    /*!< Min enumerator value of NZSTSOUTHSHK field.                          */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_Max (0x1UL)    /*!< Max enumerator value of NZSTSOUTHSHK field.                          */
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_SENDOUT (0x0UL) /*!< Send the received OUT packet to the application (zero-length or
                                                           non-zero length) and send a handshake based on NAK and STALL bits for
                                                           the endpoint in the Devce Endpoint Control Register*/
  #define USBHSCORE_DCFG_NZSTSOUTHSHK_SENDSTALL (0x1UL) /*!< Send a STALL handshake on a nonzero-length status OUT transaction
                                                             and do not send the received OUT packet to the application*/

/* ENA32KHZSUSP @Bit 3 : Enable 32 KHz Suspend mode (Ena32KHzSusp) */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Pos (3UL)      /*!< Position of ENA32KHZSUSP field.                                      */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Msk (0x1UL << USBHSCORE_DCFG_ENA32KHZSUSP_Pos) /*!< Bit mask of ENA32KHZSUSP field.      */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Min (0x0UL)    /*!< Min enumerator value of ENA32KHZSUSP field.                          */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Max (0x1UL)    /*!< Max enumerator value of ENA32KHZSUSP field.                          */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_DISABLED (0x0UL) /*!< USB 1.1 Full-Speed Serial Transceiver not selected                 */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_ENABLED (0x1UL) /*!< USB 1.1 Full-Speed Serial Transceiver Interface selected            */

/* DEVADDR @Bits 4..10 : Device Address (DevAddr) */
  #define USBHSCORE_DCFG_DEVADDR_Pos (4UL)           /*!< Position of DEVADDR field.                                           */
  #define USBHSCORE_DCFG_DEVADDR_Msk (0x7FUL << USBHSCORE_DCFG_DEVADDR_Pos) /*!< Bit mask of DEVADDR field.                    */

/* PERFRINT @Bits 11..12 : Periodic Frame Interval (PerFrInt) */
  #define USBHSCORE_DCFG_PERFRINT_Pos (11UL)         /*!< Position of PERFRINT field.                                          */
  #define USBHSCORE_DCFG_PERFRINT_Msk (0x3UL << USBHSCORE_DCFG_PERFRINT_Pos) /*!< Bit mask of PERFRINT field.                  */
  #define USBHSCORE_DCFG_PERFRINT_Min (0x0UL)        /*!< Min enumerator value of PERFRINT field.                              */
  #define USBHSCORE_DCFG_PERFRINT_Max (0x3UL)        /*!< Max enumerator value of PERFRINT field.                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF80 (0x0UL)     /*!< 80 percent of the (micro)Frame interval                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF85 (0x1UL)     /*!< 85 percent of the (micro)Frame interval                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF90 (0x2UL)     /*!< 90 percent of the (micro)Frame interval                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF95 (0x3UL)     /*!< 95 percent of the (micro)Frame interval                              */

/* ENDEVOUTNAK @Bit 13 : Enable Device OUT NAK (EnDevOutNak) */
  #define USBHSCORE_DCFG_ENDEVOUTNAK_Pos (13UL)      /*!< Position of ENDEVOUTNAK field.                                       */
  #define USBHSCORE_DCFG_ENDEVOUTNAK_Msk (0x1UL << USBHSCORE_DCFG_ENDEVOUTNAK_Pos) /*!< Bit mask of ENDEVOUTNAK field.         */
  #define USBHSCORE_DCFG_ENDEVOUTNAK_Min (0x0UL)     /*!< Min enumerator value of ENDEVOUTNAK field.                           */
  #define USBHSCORE_DCFG_ENDEVOUTNAK_Max (0x1UL)     /*!< Max enumerator value of ENDEVOUTNAK field.                           */
  #define USBHSCORE_DCFG_ENDEVOUTNAK_DISABLED (0x0UL) /*!< The core does not set NAK after Bulk OUT transfer complete          */
  #define USBHSCORE_DCFG_ENDEVOUTNAK_ENABLED (0x1UL) /*!< The core sets NAK after Bulk OUT transfer complete                   */

/* XCVRDLY @Bit 14 : XCVRDLY */
  #define USBHSCORE_DCFG_XCVRDLY_Pos (14UL)          /*!< Position of XCVRDLY field.                                           */
  #define USBHSCORE_DCFG_XCVRDLY_Msk (0x1UL << USBHSCORE_DCFG_XCVRDLY_Pos) /*!< Bit mask of XCVRDLY field.                     */
  #define USBHSCORE_DCFG_XCVRDLY_Min (0x0UL)         /*!< Min enumerator value of XCVRDLY field.                               */
  #define USBHSCORE_DCFG_XCVRDLY_Max (0x1UL)         /*!< Max enumerator value of XCVRDLY field.                               */
  #define USBHSCORE_DCFG_XCVRDLY_DISABLE (0x0UL)     /*!< No delay between xcvr_sel and txvalid during Device chirp            */
  #define USBHSCORE_DCFG_XCVRDLY_ENABLE (0x1UL)      /*!< Enable delay between xcvr_sel and txvalid during Device chirp        */

/* ERRATICINTMSK @Bit 15 : Erratic Error Interrupt Mask */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Pos (15UL)    /*!< Position of ERRATICINTMSK field.                                     */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Msk (0x1UL << USBHSCORE_DCFG_ERRATICINTMSK_Pos) /*!< Bit mask of ERRATICINTMSK field.   */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Min (0x0UL)   /*!< Min enumerator value of ERRATICINTMSK field.                         */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Max (0x1UL)   /*!< Max enumerator value of ERRATICINTMSK field.                         */
  #define USBHSCORE_DCFG_ERRATICINTMSK_NOMASK (0x0UL) /*!< Early suspend interrupt is generated on erratic error               */
  #define USBHSCORE_DCFG_ERRATICINTMSK_MASK (0x1UL)  /*!< Mask early suspend interrupt on erratic error                        */

/* IPGISOCSUPT @Bit 17 : Worst-Case Inter-Packet Gap ISOC OUT Support (ipgisocSupt) */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Pos (17UL)      /*!< Position of IPGISOCSUPT field.                                       */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Msk (0x1UL << USBHSCORE_DCFG_IPGISOCSUPT_Pos) /*!< Bit mask of IPGISOCSUPT field.         */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Min (0x0UL)     /*!< Min enumerator value of IPGISOCSUPT field.                           */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Max (0x1UL)     /*!< Max enumerator value of IPGISOCSUPT field.                           */
  #define USBHSCORE_DCFG_IPGISOCSUPT_DISABLED (0x0UL) /*!< Worst-Case Inter-Packet Gap ISOC OUT Support is disabled            */
  #define USBHSCORE_DCFG_IPGISOCSUPT_ENABLED (0x1UL) /*!< Worst-Case Inter-Packet Gap ISOC OUT Support is enabled              */

/* DESCDMA @Bit 23 : Enable Scatter/gather DMA in device mode (DescDMA). */
  #define USBHSCORE_DCFG_DESCDMA_Pos (23UL)          /*!< Position of DESCDMA field.                                           */
  #define USBHSCORE_DCFG_DESCDMA_Msk (0x1UL << USBHSCORE_DCFG_DESCDMA_Pos) /*!< Bit mask of DESCDMA field.                     */
  #define USBHSCORE_DCFG_DESCDMA_Min (0x0UL)         /*!< Min enumerator value of DESCDMA field.                               */
  #define USBHSCORE_DCFG_DESCDMA_Max (0x1UL)         /*!< Max enumerator value of DESCDMA field.                               */
  #define USBHSCORE_DCFG_DESCDMA_DISABLED (0x0UL)    /*!< Disable Scatter/Gather DMA                                           */
  #define USBHSCORE_DCFG_DESCDMA_ENABLED (0x1UL)     /*!< Enable Scatter/Gather DMA                                            */

