NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* SETD0PID @Bit 28 : Set DATA0 PID (SetD0PID) */
  #define USBHSCORE_DOEPCTL12_SETD0PID_Pos (28UL)    /*!< Position of SETD0PID field.                                          */
  #define USBHSCORE_DOEPCTL12_SETD0PID_Msk (0x1UL << USBHSCORE_DOEPCTL12_SETD0PID_Pos) /*!< Bit mask of SETD0PID field.        */
  #define USBHSCORE_DOEPCTL12_SETD0PID_Min (0x0UL)   /*!< Min enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DOEPCTL12_SETD0PID_Max (0x1UL)   /*!< Max enumerator value of SETD0PID field.                              */
  #define USBHSCORE_DOEPCTL12_SETD0PID_DISABLED (0x0UL) /*!< Disables Set DATA0 PID or Do not force Even Frame                 */
  #define USBHSCORE_DOEPCTL12_SETD0PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA0 or Sets EO_FrNum field to odd
                                                            (micro)Frame*/

/* SETD1PID @Bit 29 : Set DATA1 PID (SetD1PID) */
  #define USBHSCORE_DOEPCTL12_SETD1PID_Pos (29UL)    /*!< Position of SETD1PID field.                                          */
  #define USBHSCORE_DOEPCTL12_SETD1PID_Msk (0x1UL << USBHSCORE_DOEPCTL12_SETD1PID_Pos) /*!< Bit mask of SETD1PID field.        */
  #define USBHSCORE_DOEPCTL12_SETD1PID_Min (0x0UL)   /*!< Min enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DOEPCTL12_SETD1PID_Max (0x1UL)   /*!< Max enumerator value of SETD1PID field.                              */
  #define USBHSCORE_DOEPCTL12_SETD1PID_DISABLED (0x0UL) /*!< Disables Set DATA1 PID or Do not force Odd Frame                  */
  #define USBHSCORE_DOEPCTL12_SETD1PID_ENABLED (0x1UL) /*!< Set Endpoint Data PID to DATA1 or Sets EO_FrNum field to odd
                                                            (micro)Frame*/

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DOEPCTL12_EPDIS_Pos (30UL)       /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DOEPCTL12_EPDIS_Msk (0x1UL << USBHSCORE_DOEPCTL12_EPDIS_Pos) /*!< Bit mask of EPDIS field.                 */
  #define USBHSCORE_DOEPCTL12_EPDIS_Min (0x0UL)      /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL12_EPDIS_Max (0x1UL)      /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL12_EPDIS_INACTIVE (0x0UL) /*!< No Action                                                            */
  #define USBHSCORE_DOEPCTL12_EPDIS_ACTIVE (0x1UL)   /*!< Disable Endpoint                                                     */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DOEPCTL12_EPENA_Pos (31UL)       /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DOEPCTL12_EPENA_Msk (0x1UL << USBHSCORE_DOEPCTL12_EPENA_Pos) /*!< Bit mask of EPENA field.                 */
  #define USBHSCORE_DOEPCTL12_EPENA_Min (0x0UL)      /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL12_EPENA_Max (0x1UL)      /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL12_EPENA_INACTIVE (0x0UL) /*!< No Action                                                            */
  #define USBHSCORE_DOEPCTL12_EPENA_ACTIVE (0x1UL)   /*!< Enable Endpoint                                                      */


/* USBHSCORE_DOEPINT12: Device OUT Endpoint Interrupt Register 12 */
  #define USBHSCORE_DOEPINT12_ResetValue (0x00000000UL) /*!< Reset value of DOEPINT12 register.                                */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DOEPINT12_XFERCOMPL_Pos (0UL)    /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DOEPINT12_XFERCOMPL_Msk (0x1UL << USBHSCORE_DOEPINT12_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.     */
  #define USBHSCORE_DOEPINT12_XFERCOMPL_Min (0x0UL)  /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT12_XFERCOMPL_Max (0x1UL)  /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT12_XFERCOMPL_INACTIVE (0x0UL) /*!< No Transfer Complete Interrupt                                   */
  #define USBHSCORE_DOEPINT12_XFERCOMPL_ACTIVE (0x1UL) /*!< Transfer Complete Interrupt                                        */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DOEPINT12_EPDISBLD_Pos (1UL)     /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DOEPINT12_EPDISBLD_Msk (0x1UL << USBHSCORE_DOEPINT12_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.        */
  #define USBHSCORE_DOEPINT12_EPDISBLD_Min (0x0UL)   /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT12_EPDISBLD_Max (0x1UL)   /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT12_EPDISBLD_INACTIVE (0x0UL) /*!< No Endpoint Disabled Interrupt                                    */
  #define USBHSCORE_DOEPINT12_EPDISBLD_ACTIVE (0x1UL) /*!< Endpoint Disabled Interrupt                                         */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DOEPINT12_AHBERR_Pos (2UL)       /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DOEPINT12_AHBERR_Msk (0x1UL << USBHSCORE_DOEPINT12_AHBERR_Pos) /*!< Bit mask of AHBERR field.              */
  #define USBHSCORE_DOEPINT12_AHBERR_Min (0x0UL)     /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT12_AHBERR_Max (0x1UL)     /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT12_AHBERR_INACTIVE (0x0UL) /*!< No AHB Error Interrupt                                              */
  #define USBHSCORE_DOEPINT12_AHBERR_ACTIVE (0x1UL)  /*!< AHB Error interrupt                                                  */

/* SETUP @Bit 3 : SETUP Phase Done (SetUp) */
  #define USBHSCORE_DOEPINT12_SETUP_Pos (3UL)        /*!< Position of SETUP field.                                             */
  #define USBHSCORE_DOEPINT12_SETUP_Msk (0x1UL << USBHSCORE_DOEPINT12_SETUP_Pos) /*!< Bit mask of SETUP field.                 */
  #define USBHSCORE_DOEPINT12_SETUP_Min (0x0UL)      /*!< Min enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT12_SETUP_Max (0x1UL)      /*!< Max enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT12_SETUP_INACTIVE (0x0UL) /*!< No SETUP Phase Done                                                  */
  #define USBHSCORE_DOEPINT12_SETUP_ACTIVE (0x1UL)   /*!< SETUP Phase Done                                                     */

/* OUTTKNEPDIS @Bit 4 : OUT Token Received When Endpoint Disabled (OUTTknEPdis) */
  #define USBHSCORE_DOEPINT12_OUTTKNEPDIS_Pos (4UL)  /*!< Position of OUTTKNEPDIS field.                                       */
  #define USBHSCORE_DOEPINT12_OUTTKNEPDIS_Msk (0x1UL << USBHSCORE_DOEPINT12_OUTTKNEPDIS_Pos) /*!< Bit mask of OUTTKNEPDIS
                                                                            field.*/
  #define USBHSCORE_DOEPINT12_OUTTKNEPDIS_Min (0x0UL) /*!< Min enumerator value of OUTTKNEPDIS field.                          */
  #define USBHSCORE_DOEPINT12_OUTTKNEPDIS_Max (0x1UL) /*!< Max enumerator value of OUTTKNEPDIS field.                          */
  #define USBHSCORE_DOEPINT12_OUTTKNEPDIS_INACTIVE (0x0UL) /*!< No OUT Token Received When Endpoint Disabled                   */
  #define USBHSCORE_DOEPINT12_OUTTKNEPDIS_ACTIVE (0x1UL) /*!< OUT Token Received When Endpoint Disabled                        */

/* STSPHSERCVD @Bit 5 : Status Phase Received for Control Write (StsPhseRcvd) */
  #define USBHSCORE_DOEPINT12_STSPHSERCVD_Pos (5UL)  /*!< Position of STSPHSERCVD field.                                       */
  #define USBHSCORE_DOEPINT12_STSPHSERCVD_Msk (0x1UL << USBHSCORE_DOEPINT12_STSPHSERCVD_Pos) /*!< Bit mask of STSPHSERCVD
                                                                            field.*/
  #define USBHSCORE_DOEPINT12_STSPHSERCVD_Min (0x0UL) /*!< Min enumerator value of STSPHSERCVD field.                          */
  #define USBHSCORE_DOEPINT12_STSPHSERCVD_Max (0x1UL) /*!< Max enumerator value of STSPHSERCVD field.                          */
  #define USBHSCORE_DOEPINT12_STSPHSERCVD_INACTIVE (0x0UL) /*!< No Status Phase Received for Control Write                     */
  #define USBHSCORE_DOEPINT12_STSPHSERCVD_ACTIVE (0x1UL) /*!< Status Phase Received for Control Write                          */

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received (Back2BackSETup) */
  #define USBHSCORE_DOEPINT12_BACK2BACKSETUP_Pos (6UL) /*!< Position of BACK2BACKSETUP field.                                  */
  #define USBHSCORE_DOEPINT12_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPINT12_BACK2BACKSETUP_Pos) /*!< Bit mask of
                                                                            BACK2BACKSETUP field.*/
  #define USBHSCORE_DOEPINT12_BACK2BACKSETUP_Min (0x0UL) /*!< Min enumerator value of BACK2BACKSETUP field.                    */
  #define USBHSCORE_DOEPINT12_BACK2BACKSETUP_Max (0x1UL) /*!< Max enumerator value of BACK2BACKSETUP field.                    */
  #define USBHSCORE_DOEPINT12_BACK2BACKSETUP_INACTIVE (0x0UL) /*!< No Back-to-Back SETUP Packets Received                      */
  #define USBHSCORE_DOEPINT12_BACK2BACKSETUP_ACTIVE (0x1UL) /*!< Back-to-Back SETUP Packets Received                           */

/* OUTPKTERR @Bit 8 : OUT Packet Error (OutPktErr) */
  #define USBHSCORE_DOEPINT12_OUTPKTERR_Pos (8UL)    /*!< Position of OUTPKTERR field.                                         */
  #define USBHSCORE_DOEPINT12_OUTPKTERR_Msk (0x1UL << USBHSCORE_DOEPINT12_OUTPKTERR_Pos) /*!< Bit mask of OUTPKTERR field.     */
  #define USBHSCORE_DOEPINT12_OUTPKTERR_Min (0x0UL)  /*!< Min enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT12_OUTPKTERR_Max (0x1UL)  /*!< Max enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT12_OUTPKTERR_INACTIVE (0x0UL) /*!< No OUT Packet Error                                              */
  #define USBHSCORE_DOEPINT12_OUTPKTERR_ACTIVE (0x1UL) /*!< OUT Packet Error                                                   */

