NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* VPR_DEBUGIF_HALTSUM2: Halt Summary 2 */
  #define VPR_DEBUGIF_HALTSUM2_ResetValue (0x00000000UL) /*!< Reset value of HALTSUM2 register.                                */

/* HALTSUM2 @Bits 0..31 : Halt Summary 2 */
  #define VPR_DEBUGIF_HALTSUM2_HALTSUM2_Pos (0UL)    /*!< Position of HALTSUM2 field.                                          */
  #define VPR_DEBUGIF_HALTSUM2_HALTSUM2_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM2_HALTSUM2_Pos) /*!< Bit mask of HALTSUM2
                                                                            field.*/


/* VPR_DEBUGIF_HALTSUM3: Halt Summary 3 */
  #define VPR_DEBUGIF_HALTSUM3_ResetValue (0x00000000UL) /*!< Reset value of HALTSUM3 register.                                */

/* HALTSUM3 @Bits 0..31 : Halt Summary 3 */
  #define VPR_DEBUGIF_HALTSUM3_HALTSUM3_Pos (0UL)    /*!< Position of HALTSUM3 field.                                          */
  #define VPR_DEBUGIF_HALTSUM3_HALTSUM3_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_HALTSUM3_HALTSUM3_Pos) /*!< Bit mask of HALTSUM3
                                                                            field.*/


/* VPR_DEBUGIF_SBADDRESS3: System Bus Addres 127:96 */
  #define VPR_DEBUGIF_SBADDRESS3_ResetValue (0x00000000UL) /*!< Reset value of SBADDRESS3 register.                            */

/* ADDRESS @Bits 0..31 : Accesses bits 127:96 of the physical address in sbaddress (if the system address bus is that wide). */
  #define VPR_DEBUGIF_SBADDRESS3_ADDRESS_Pos (0UL)   /*!< Position of ADDRESS field.                                           */
  #define VPR_DEBUGIF_SBADDRESS3_ADDRESS_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_SBADDRESS3_ADDRESS_Pos) /*!< Bit mask of ADDRESS
                                                                            field.*/


/* VPR_DEBUGIF_SBCS: System Bus Access Control and Status */
  #define VPR_DEBUGIF_SBCS_ResetValue (0x20000000UL) /*!< Reset value of SBCS register.                                        */

/* SBACCESS8 @Bit 0 : 8-bit system bus accesses are supported. */
  #define VPR_DEBUGIF_SBCS_SBACCESS8_Pos (0UL)       /*!< Position of SBACCESS8 field.                                         */
  #define VPR_DEBUGIF_SBCS_SBACCESS8_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS8_Pos) /*!< Bit mask of SBACCESS8 field.           */

/* SBACCESS16 @Bit 1 : 16-bit system bus accesses are supported. */
  #define VPR_DEBUGIF_SBCS_SBACCESS16_Pos (1UL)      /*!< Position of SBACCESS16 field.                                        */
  #define VPR_DEBUGIF_SBCS_SBACCESS16_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS16_Pos) /*!< Bit mask of SBACCESS16 field.        */

/* SBACCESS32 @Bit 2 : 32-bit system bus accesses are supported. */
  #define VPR_DEBUGIF_SBCS_SBACCESS32_Pos (2UL)      /*!< Position of SBACCESS32 field.                                        */
  #define VPR_DEBUGIF_SBCS_SBACCESS32_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS32_Pos) /*!< Bit mask of SBACCESS32 field.        */

/* SBACCESS64 @Bit 3 : 64-bit system bus accesses are supported. */
  #define VPR_DEBUGIF_SBCS_SBACCESS64_Pos (3UL)      /*!< Position of SBACCESS64 field.                                        */
  #define VPR_DEBUGIF_SBCS_SBACCESS64_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS64_Pos) /*!< Bit mask of SBACCESS64 field.        */

/* SBACCESS128 @Bit 4 : 128-bit system bus accesses are supported. */
  #define VPR_DEBUGIF_SBCS_SBACCESS128_Pos (4UL)     /*!< Position of SBACCESS128 field.                                       */
  #define VPR_DEBUGIF_SBCS_SBACCESS128_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBACCESS128_Pos) /*!< Bit mask of SBACCESS128 field.     */

/* SBASIZE @Bits 5..11 : Width of system bus addresses in bits. (0 indicates there is no bus access support.) */
  #define VPR_DEBUGIF_SBCS_SBASIZE_Pos (5UL)         /*!< Position of SBASIZE field.                                           */
  #define VPR_DEBUGIF_SBCS_SBASIZE_Msk (0x7FUL << VPR_DEBUGIF_SBCS_SBASIZE_Pos) /*!< Bit mask of SBASIZE field.                */

/* SBERROR @Bits 12..14 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBERROR_Pos (12UL)        /*!< Position of SBERROR field.                                           */
  #define VPR_DEBUGIF_SBCS_SBERROR_Msk (0x7UL << VPR_DEBUGIF_SBCS_SBERROR_Pos) /*!< Bit mask of SBERROR field.                 */
  #define VPR_DEBUGIF_SBCS_SBERROR_Min (0x0UL)       /*!< Min enumerator value of SBERROR field.                               */
  #define VPR_DEBUGIF_SBCS_SBERROR_Max (0x7UL)       /*!< Max enumerator value of SBERROR field.                               */
  #define VPR_DEBUGIF_SBCS_SBERROR_Normal (0x0UL)    /*!< There was no bus error.                                              */
  #define VPR_DEBUGIF_SBCS_SBERROR_Timeout (0x1UL)   /*!< There was a timeout.                                                 */
  #define VPR_DEBUGIF_SBCS_SBERROR_Address (0x2UL)   /*!< A bad address was accessed.                                          */
  #define VPR_DEBUGIF_SBCS_SBERROR_Alignment (0x3UL) /*!< There was an alignment error.                                        */
  #define VPR_DEBUGIF_SBCS_SBERROR_Size (0x4UL)      /*!< An access of unsupported size was requested.                         */
  #define VPR_DEBUGIF_SBCS_SBERROR_Other (0x7UL)     /*!< Other.                                                               */

/* SBREADONDATA @Bit 15 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Pos (15UL)   /*!< Position of SBREADONDATA field.                                      */
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBREADONDATA_Pos) /*!< Bit mask of SBREADONDATA field.  */
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Min (0x1UL)  /*!< Min enumerator value of SBREADONDATA field.                          */
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_Max (0x1UL)  /*!< Max enumerator value of SBREADONDATA field.                          */
  #define VPR_DEBUGIF_SBCS_SBREADONDATA_sbreadondata (0x1UL) /*!< Every read from sbdata0 automatically triggers a system bus
                                                                  read at the (possibly autoincremented) address.*/

/* SBAUTOINCREMENT @Bit 16 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Pos (16UL) /*!< Position of SBAUTOINCREMENT field.                                  */
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Pos) /*!< Bit mask of SBAUTOINCREMENT
                                                                            field.*/
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Min (0x1UL) /*!< Min enumerator value of SBAUTOINCREMENT field.                     */
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_Max (0x1UL) /*!< Max enumerator value of SBAUTOINCREMENT field.                     */
  #define VPR_DEBUGIF_SBCS_SBAUTOINCREMENT_sbautoincrement (0x1UL) /*!< sbaddress is incremented by the access size (in bytes)
                                                                        selected in sbaccess after every system bus access.*/

/* SBACCESS @Bits 17..19 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBACCESS_Pos (17UL)       /*!< Position of SBACCESS field.                                          */
  #define VPR_DEBUGIF_SBCS_SBACCESS_Msk (0x7UL << VPR_DEBUGIF_SBCS_SBACCESS_Pos) /*!< Bit mask of SBACCESS field.              */
  #define VPR_DEBUGIF_SBCS_SBACCESS_Min (0x0UL)      /*!< Min enumerator value of SBACCESS field.                              */
  #define VPR_DEBUGIF_SBCS_SBACCESS_Max (0x4UL)      /*!< Max enumerator value of SBACCESS field.                              */
  #define VPR_DEBUGIF_SBCS_SBACCESS_size8 (0x0UL)    /*!< 8-bit.                                                               */
  #define VPR_DEBUGIF_SBCS_SBACCESS_size16 (0x1UL)   /*!< 16-bit.                                                              */
  #define VPR_DEBUGIF_SBCS_SBACCESS_size32 (0x2UL)   /*!< 32-bit.                                                              */
  #define VPR_DEBUGIF_SBCS_SBACCESS_size64 (0x3UL)   /*!< 64-bit.                                                              */
  #define VPR_DEBUGIF_SBCS_SBACCESS_size128 (0x4UL)  /*!< 128-bit.                                                             */

/* SBREADONADDR @Bit 20 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Pos (20UL)   /*!< Position of SBREADONADDR field.                                      */
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBREADONADDR_Pos) /*!< Bit mask of SBREADONADDR field.  */
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Min (0x1UL)  /*!< Min enumerator value of SBREADONADDR field.                          */
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_Max (0x1UL)  /*!< Max enumerator value of SBREADONADDR field.                          */
  #define VPR_DEBUGIF_SBCS_SBREADONADDR_sbreadonaddr (0x1UL) /*!< Every write to sbaddress0 automatically triggers a system bus
                                                                  read at the new address.*/

/* SBBUSY @Bit 21 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBBUSY_Pos (21UL)         /*!< Position of SBBUSY field.                                            */
  #define VPR_DEBUGIF_SBCS_SBBUSY_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBBUSY_Pos) /*!< Bit mask of SBBUSY field.                    */
  #define VPR_DEBUGIF_SBCS_SBBUSY_Min (0x0UL)        /*!< Min enumerator value of SBBUSY field.                                */
  #define VPR_DEBUGIF_SBCS_SBBUSY_Max (0x1UL)        /*!< Max enumerator value of SBBUSY field.                                */
  #define VPR_DEBUGIF_SBCS_SBBUSY_notbusy (0x0UL)    /*!< System bus master is not busy.                                       */
  #define VPR_DEBUGIF_SBCS_SBBUSY_busy (0x1UL)       /*!< System bus master is busy.                                           */

/* SBBUSYERROR @Bit 22 : (unspecified) */
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Pos (22UL)    /*!< Position of SBBUSYERROR field.                                       */
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Msk (0x1UL << VPR_DEBUGIF_SBCS_SBBUSYERROR_Pos) /*!< Bit mask of SBBUSYERROR field.     */
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Min (0x0UL)   /*!< Min enumerator value of SBBUSYERROR field.                           */
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_Max (0x1UL)   /*!< Max enumerator value of SBBUSYERROR field.                           */
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_noerror (0x0UL) /*!< No error.                                                          */
  #define VPR_DEBUGIF_SBCS_SBBUSYERROR_error (0x1UL) /*!< Debugger access attempted while one in progress.                     */

