NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* SUBSCRIBE10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Pos (10UL) /*!< Position of SUBSCRIBE10 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE10 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE10 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE10 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Disabled (0x0UL) /*!< Subscribe disabled for TASK[10]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE10_Enabled (0x1UL) /*!< Subscribe enabled for TASK[10]                              */

/* SUBSCRIBE11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Pos (11UL) /*!< Position of SUBSCRIBE11 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE11 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE11 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE11 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Disabled (0x0UL) /*!< Subscribe disabled for TASK[11]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE11_Enabled (0x1UL) /*!< Subscribe enabled for TASK[11]                              */

/* SUBSCRIBE12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Pos (12UL) /*!< Position of SUBSCRIBE12 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE12 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE12 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE12 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Disabled (0x0UL) /*!< Subscribe disabled for TASK[12]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE12_Enabled (0x1UL) /*!< Subscribe enabled for TASK[12]                              */

/* SUBSCRIBE13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Pos (13UL) /*!< Position of SUBSCRIBE13 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE13 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE13 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE13 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Disabled (0x0UL) /*!< Subscribe disabled for TASK[13]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE13_Enabled (0x1UL) /*!< Subscribe enabled for TASK[13]                              */

/* SUBSCRIBE14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Pos (14UL) /*!< Position of SUBSCRIBE14 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE14 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE14 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE14 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Disabled (0x0UL) /*!< Subscribe disabled for TASK[14]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE14_Enabled (0x1UL) /*!< Subscribe enabled for TASK[14]                              */

/* SUBSCRIBE15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Pos (15UL) /*!< Position of SUBSCRIBE15 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE15 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE15 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE15 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Disabled (0x0UL) /*!< Subscribe disabled for TASK[15]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE15_Enabled (0x1UL) /*!< Subscribe enabled for TASK[15]                              */

/* SUBSCRIBE16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Pos (16UL) /*!< Position of SUBSCRIBE16 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE16 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE16 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE16 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Disabled (0x0UL) /*!< Subscribe disabled for TASK[16]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Enabled (0x1UL) /*!< Subscribe enabled for TASK[16]                              */

