NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* EVENTS17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Pos (17UL)   /*!< Position of EVENTS17 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS17_Pos) /*!< Bit mask of EVENTS17 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Min (0x0UL)  /*!< Min enumerator value of EVENTS17 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Max (0x1UL)  /*!< Max enumerator value of EVENTS17 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Disabled (0x0UL) /*!< EVENTS[17] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS17_Enabled (0x1UL) /*!< EVENTS[17] enabled                                                */

/* EVENTS18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Pos (18UL)   /*!< Position of EVENTS18 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS18_Pos) /*!< Bit mask of EVENTS18 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Min (0x0UL)  /*!< Min enumerator value of EVENTS18 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Max (0x1UL)  /*!< Max enumerator value of EVENTS18 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Disabled (0x0UL) /*!< EVENTS[18] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS18_Enabled (0x1UL) /*!< EVENTS[18] enabled                                                */

/* EVENTS19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Pos (19UL)   /*!< Position of EVENTS19 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS19_Pos) /*!< Bit mask of EVENTS19 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Min (0x0UL)  /*!< Min enumerator value of EVENTS19 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Max (0x1UL)  /*!< Max enumerator value of EVENTS19 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Disabled (0x0UL) /*!< EVENTS[19] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS19_Enabled (0x1UL) /*!< EVENTS[19] enabled                                                */

/* EVENTS20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Pos (20UL)   /*!< Position of EVENTS20 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS20_Pos) /*!< Bit mask of EVENTS20 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Min (0x0UL)  /*!< Min enumerator value of EVENTS20 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Max (0x1UL)  /*!< Max enumerator value of EVENTS20 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Disabled (0x0UL) /*!< EVENTS[20] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS20_Enabled (0x1UL) /*!< EVENTS[20] enabled                                                */

/* EVENTS21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Pos (21UL)   /*!< Position of EVENTS21 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS21_Pos) /*!< Bit mask of EVENTS21 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Min (0x0UL)  /*!< Min enumerator value of EVENTS21 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Max (0x1UL)  /*!< Max enumerator value of EVENTS21 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Disabled (0x0UL) /*!< EVENTS[21] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS21_Enabled (0x1UL) /*!< EVENTS[21] enabled                                                */

/* EVENTS22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Pos (22UL)   /*!< Position of EVENTS22 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS22_Pos) /*!< Bit mask of EVENTS22 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Min (0x0UL)  /*!< Min enumerator value of EVENTS22 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Max (0x1UL)  /*!< Max enumerator value of EVENTS22 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Disabled (0x0UL) /*!< EVENTS[22] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS22_Enabled (0x1UL) /*!< EVENTS[22] enabled                                                */

/* EVENTS23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Pos (23UL)   /*!< Position of EVENTS23 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS23_Pos) /*!< Bit mask of EVENTS23 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Min (0x0UL)  /*!< Min enumerator value of EVENTS23 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Max (0x1UL)  /*!< Max enumerator value of EVENTS23 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Disabled (0x0UL) /*!< EVENTS[23] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS23_Enabled (0x1UL) /*!< EVENTS[23] enabled                                                */

/* EVENTS24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Pos (24UL)   /*!< Position of EVENTS24 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS24_Pos) /*!< Bit mask of EVENTS24 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Min (0x0UL)  /*!< Min enumerator value of EVENTS24 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Max (0x1UL)  /*!< Max enumerator value of EVENTS24 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Disabled (0x0UL) /*!< EVENTS[24] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS24_Enabled (0x1UL) /*!< EVENTS[24] enabled                                                */

/* EVENTS25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Pos (25UL)   /*!< Position of EVENTS25 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS25_Pos) /*!< Bit mask of EVENTS25 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Min (0x0UL)  /*!< Min enumerator value of EVENTS25 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Max (0x1UL)  /*!< Max enumerator value of EVENTS25 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Disabled (0x0UL) /*!< EVENTS[25] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS25_Enabled (0x1UL) /*!< EVENTS[25] enabled                                                */

