NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* PUBLISH23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Pos (23UL) /*!< Position of PUBLISH23 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH23_Pos) /*!< Bit mask of PUBLISH23 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Min (0x0UL) /*!< Min enumerator value of PUBLISH23 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Max (0x1UL) /*!< Max enumerator value of PUBLISH23 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Disabled (0x0UL) /*!< Publish disabled for EVENTS[23]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH23_Enabled (0x1UL) /*!< Publish enabled for EVENTS[23]                                  */

/* PUBLISH24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Pos (24UL) /*!< Position of PUBLISH24 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH24_Pos) /*!< Bit mask of PUBLISH24 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Min (0x0UL) /*!< Min enumerator value of PUBLISH24 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Max (0x1UL) /*!< Max enumerator value of PUBLISH24 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Disabled (0x0UL) /*!< Publish disabled for EVENTS[24]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH24_Enabled (0x1UL) /*!< Publish enabled for EVENTS[24]                                  */

/* PUBLISH25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Pos (25UL) /*!< Position of PUBLISH25 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH25_Pos) /*!< Bit mask of PUBLISH25 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Min (0x0UL) /*!< Min enumerator value of PUBLISH25 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Max (0x1UL) /*!< Max enumerator value of PUBLISH25 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Disabled (0x0UL) /*!< Publish disabled for EVENTS[25]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH25_Enabled (0x1UL) /*!< Publish enabled for EVENTS[25]                                  */

/* PUBLISH26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Pos (26UL) /*!< Position of PUBLISH26 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH26_Pos) /*!< Bit mask of PUBLISH26 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Min (0x0UL) /*!< Min enumerator value of PUBLISH26 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Max (0x1UL) /*!< Max enumerator value of PUBLISH26 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Disabled (0x0UL) /*!< Publish disabled for EVENTS[26]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH26_Enabled (0x1UL) /*!< Publish enabled for EVENTS[26]                                  */

/* PUBLISH27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Pos (27UL) /*!< Position of PUBLISH27 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH27_Pos) /*!< Bit mask of PUBLISH27 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Min (0x0UL) /*!< Min enumerator value of PUBLISH27 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Max (0x1UL) /*!< Max enumerator value of PUBLISH27 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Disabled (0x0UL) /*!< Publish disabled for EVENTS[27]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH27_Enabled (0x1UL) /*!< Publish enabled for EVENTS[27]                                  */

/* PUBLISH28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Pos (28UL) /*!< Position of PUBLISH28 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH28_Pos) /*!< Bit mask of PUBLISH28 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Min (0x0UL) /*!< Min enumerator value of PUBLISH28 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Max (0x1UL) /*!< Max enumerator value of PUBLISH28 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Disabled (0x0UL) /*!< Publish disabled for EVENTS[28]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH28_Enabled (0x1UL) /*!< Publish enabled for EVENTS[28]                                  */

/* PUBLISH29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Pos (29UL) /*!< Position of PUBLISH29 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH29_Pos) /*!< Bit mask of PUBLISH29 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Min (0x0UL) /*!< Min enumerator value of PUBLISH29 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Max (0x1UL) /*!< Max enumerator value of PUBLISH29 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Disabled (0x0UL) /*!< Publish disabled for EVENTS[29]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH29_Enabled (0x1UL) /*!< Publish enabled for EVENTS[29]                                  */

/* PUBLISH30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Pos (30UL) /*!< Position of PUBLISH30 field.                                         */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Msk (0x1UL << VPRCSR_NORDIC_PUBLISH_PUBLISH30_Pos) /*!< Bit mask of PUBLISH30 field. */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Min (0x0UL) /*!< Min enumerator value of PUBLISH30 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Max (0x1UL) /*!< Max enumerator value of PUBLISH30 field.                            */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Disabled (0x0UL) /*!< Publish disabled for EVENTS[30]                                */
  #define VPRCSR_NORDIC_PUBLISH_PUBLISH30_Enabled (0x1UL) /*!< Publish enabled for EVENTS[30]                                  */

