NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* EVENTS_VBUSDETECTED @Bit 0 : VBUS detected */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Pos (0UL) /*!< Position of EVENTS_VBUSDETECTED field.                */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Msk (0x1UL << VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Pos)
                                                                            /*!< Bit mask of EVENTS_VBUSDETECTED field.*/
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_VBUSDETECTED field.  */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_VBUSDETECTED field.  */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_NotGenerated (0x0UL) /*!< Event not generated                        */
  #define VREGUSB_EVENTS_VBUSDETECTED_EVENTS_VBUSDETECTED_Generated (0x1UL) /*!< Event generated                               */


/* VREGUSB_EVENTS_SETTLED3V3: 3V3 settled */
  #define VREGUSB_EVENTS_SETTLED3V3_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SETTLED3V3 register.                  */

/* EVENTS_SETTLED3V3 @Bit 0 : 3V3 settled */
  #define VREGUSB_EVENTS_SETTLED3V3_EVENTS_SETTLED3V3_Pos (0UL) /*!< Position of EVENTS_SETTLED3V3 field.                      */
  #define VREGUSB_EVENTS_SETTLED3V3_EVENTS_SETTLED3V3_Msk (0x1UL << VREGUSB_EVENTS_SETTLED3V3_EVENTS_SETTLED3V3_Pos) /*!< Bit
                                                                            mask of EVENTS_SETTLED3V3 field.*/
  #define VREGUSB_EVENTS_SETTLED3V3_EVENTS_SETTLED3V3_Min (0x0UL) /*!< Min enumerator value of EVENTS_SETTLED3V3 field.        */
  #define VREGUSB_EVENTS_SETTLED3V3_EVENTS_SETTLED3V3_Max (0x1UL) /*!< Max enumerator value of EVENTS_SETTLED3V3 field.        */
  #define VREGUSB_EVENTS_SETTLED3V3_EVENTS_SETTLED3V3_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define VREGUSB_EVENTS_SETTLED3V3_EVENTS_SETTLED3V3_Generated (0x1UL) /*!< Event generated                                   */


/* VREGUSB_EVENTS_VBUSREMOVED: VBUS removed */
  #define VREGUSB_EVENTS_VBUSREMOVED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_VBUSREMOVED register.                */

/* EVENTS_VBUSREMOVED @Bit 0 : VBUS removed */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Pos (0UL) /*!< Position of EVENTS_VBUSREMOVED field.                   */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Msk (0x1UL << VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Pos) /*!<
                                                                            Bit mask of EVENTS_VBUSREMOVED field.*/
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Min (0x0UL) /*!< Min enumerator value of EVENTS_VBUSREMOVED field.     */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Max (0x1UL) /*!< Max enumerator value of EVENTS_VBUSREMOVED field.     */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_NotGenerated (0x0UL) /*!< Event not generated                          */
  #define VREGUSB_EVENTS_VBUSREMOVED_EVENTS_VBUSREMOVED_Generated (0x1UL) /*!< Event generated                                 */


/* VREGUSB_INTEN: Enable or disable interrupt */
  #define VREGUSB_INTEN_ResetValue (0x00000000UL)    /*!< Reset value of INTEN register.                                       */

/* VBUSDETECTED @Bit 1 : Enable or disable interrupt for event VBUSDETECTED */
  #define VREGUSB_INTEN_VBUSDETECTED_Pos (1UL)       /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTEN_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTEN_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.        */
  #define VREGUSB_INTEN_VBUSDETECTED_Min (0x0UL)     /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTEN_VBUSDETECTED_Max (0x1UL)     /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTEN_VBUSDETECTED_Disabled (0x0UL) /*!< Disable                                                             */
  #define VREGUSB_INTEN_VBUSDETECTED_Enabled (0x1UL) /*!< Enable                                                               */

/* SETTLED3V3 @Bit 3 : Enable or disable interrupt for event SETTLED3V3 */
  #define VREGUSB_INTEN_SETTLED3V3_Pos (3UL)         /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_INTEN_SETTLED3V3_Msk (0x1UL << VREGUSB_INTEN_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.              */
  #define VREGUSB_INTEN_SETTLED3V3_Min (0x0UL)       /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTEN_SETTLED3V3_Max (0x1UL)       /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTEN_SETTLED3V3_Disabled (0x0UL)  /*!< Disable                                                              */
  #define VREGUSB_INTEN_SETTLED3V3_Enabled (0x1UL)   /*!< Enable                                                               */

/* VBUSREMOVED @Bit 4 : Enable or disable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTEN_VBUSREMOVED_Pos (4UL)        /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTEN_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTEN_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.           */
  #define VREGUSB_INTEN_VBUSREMOVED_Min (0x0UL)      /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTEN_VBUSREMOVED_Max (0x1UL)      /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTEN_VBUSREMOVED_Disabled (0x0UL) /*!< Disable                                                              */
  #define VREGUSB_INTEN_VBUSREMOVED_Enabled (0x1UL)  /*!< Enable                                                               */


/* VREGUSB_INTENSET: Enable interrupt */
  #define VREGUSB_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                    */

/* VBUSDETECTED @Bit 1 : Write '1' to enable interrupt for event VBUSDETECTED */
  #define VREGUSB_INTENSET_VBUSDETECTED_Pos (1UL)    /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTENSET_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTENSET_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.  */
  #define VREGUSB_INTENSET_VBUSDETECTED_Min (0x0UL)  /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENSET_VBUSDETECTED_Max (0x1UL)  /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENSET_VBUSDETECTED_Set (0x1UL)  /*!< Enable                                                               */
  #define VREGUSB_INTENSET_VBUSDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define VREGUSB_INTENSET_VBUSDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                     */

