NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* SETTLED3V3 @Bit 3 : Write '1' to enable interrupt for event SETTLED3V3 */
  #define VREGUSB_INTENSET_SETTLED3V3_Pos (3UL)      /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_INTENSET_SETTLED3V3_Msk (0x1UL << VREGUSB_INTENSET_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.        */
  #define VREGUSB_INTENSET_SETTLED3V3_Min (0x0UL)    /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENSET_SETTLED3V3_Max (0x1UL)    /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENSET_SETTLED3V3_Set (0x1UL)    /*!< Enable                                                               */
  #define VREGUSB_INTENSET_SETTLED3V3_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VREGUSB_INTENSET_SETTLED3V3_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* VBUSREMOVED @Bit 4 : Write '1' to enable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTENSET_VBUSREMOVED_Pos (4UL)     /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTENSET_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTENSET_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.     */
  #define VREGUSB_INTENSET_VBUSREMOVED_Min (0x0UL)   /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENSET_VBUSREMOVED_Max (0x1UL)   /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENSET_VBUSREMOVED_Set (0x1UL)   /*!< Enable                                                               */
  #define VREGUSB_INTENSET_VBUSREMOVED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGUSB_INTENSET_VBUSREMOVED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* VREGUSB_INTENCLR: Disable interrupt */
  #define VREGUSB_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                    */

/* VBUSDETECTED @Bit 1 : Write '1' to disable interrupt for event VBUSDETECTED */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Pos (1UL)    /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTENCLR_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.  */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Min (0x0UL)  /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Max (0x1UL)  /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Clear (0x1UL) /*!< Disable                                                             */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Disabled (0x0UL) /*!< Read: Disabled                                                   */
  #define VREGUSB_INTENCLR_VBUSDETECTED_Enabled (0x1UL) /*!< Read: Enabled                                                     */

/* SETTLED3V3 @Bit 3 : Write '1' to disable interrupt for event SETTLED3V3 */
  #define VREGUSB_INTENCLR_SETTLED3V3_Pos (3UL)      /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_INTENCLR_SETTLED3V3_Msk (0x1UL << VREGUSB_INTENCLR_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.        */
  #define VREGUSB_INTENCLR_SETTLED3V3_Min (0x0UL)    /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENCLR_SETTLED3V3_Max (0x1UL)    /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTENCLR_SETTLED3V3_Clear (0x1UL)  /*!< Disable                                                              */
  #define VREGUSB_INTENCLR_SETTLED3V3_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define VREGUSB_INTENCLR_SETTLED3V3_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* VBUSREMOVED @Bit 4 : Write '1' to disable interrupt for event VBUSREMOVED */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Pos (4UL)     /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTENCLR_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.     */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Min (0x0UL)   /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Max (0x1UL)   /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Clear (0x1UL) /*!< Disable                                                              */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define VREGUSB_INTENCLR_VBUSREMOVED_Enabled (0x1UL) /*!< Read: Enabled                                                      */


/* VREGUSB_INTPEND: Pending interrupts */
  #define VREGUSB_INTPEND_ResetValue (0x00000000UL)  /*!< Reset value of INTPEND register.                                     */

/* VBUSDETECTED @Bit 1 : Read pending status of interrupt for event VBUSDETECTED */
  #define VREGUSB_INTPEND_VBUSDETECTED_Pos (1UL)     /*!< Position of VBUSDETECTED field.                                      */
  #define VREGUSB_INTPEND_VBUSDETECTED_Msk (0x1UL << VREGUSB_INTPEND_VBUSDETECTED_Pos) /*!< Bit mask of VBUSDETECTED field.    */
  #define VREGUSB_INTPEND_VBUSDETECTED_Min (0x0UL)   /*!< Min enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTPEND_VBUSDETECTED_Max (0x1UL)   /*!< Max enumerator value of VBUSDETECTED field.                          */
  #define VREGUSB_INTPEND_VBUSDETECTED_NotPending (0x0UL) /*!< Read: Not pending                                               */
  #define VREGUSB_INTPEND_VBUSDETECTED_Pending (0x1UL) /*!< Read: Pending                                                      */

/* SETTLED3V3 @Bit 3 : Read pending status of interrupt for event SETTLED3V3 */
  #define VREGUSB_INTPEND_SETTLED3V3_Pos (3UL)       /*!< Position of SETTLED3V3 field.                                        */
  #define VREGUSB_INTPEND_SETTLED3V3_Msk (0x1UL << VREGUSB_INTPEND_SETTLED3V3_Pos) /*!< Bit mask of SETTLED3V3 field.          */
  #define VREGUSB_INTPEND_SETTLED3V3_Min (0x0UL)     /*!< Min enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTPEND_SETTLED3V3_Max (0x1UL)     /*!< Max enumerator value of SETTLED3V3 field.                            */
  #define VREGUSB_INTPEND_SETTLED3V3_NotPending (0x0UL) /*!< Read: Not pending                                                 */
  #define VREGUSB_INTPEND_SETTLED3V3_Pending (0x1UL) /*!< Read: Pending                                                        */

/* VBUSREMOVED @Bit 4 : Read pending status of interrupt for event VBUSREMOVED */
  #define VREGUSB_INTPEND_VBUSREMOVED_Pos (4UL)      /*!< Position of VBUSREMOVED field.                                       */
  #define VREGUSB_INTPEND_VBUSREMOVED_Msk (0x1UL << VREGUSB_INTPEND_VBUSREMOVED_Pos) /*!< Bit mask of VBUSREMOVED field.       */
  #define VREGUSB_INTPEND_VBUSREMOVED_Min (0x0UL)    /*!< Min enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTPEND_VBUSREMOVED_Max (0x1UL)    /*!< Max enumerator value of VBUSREMOVED field.                           */
  #define VREGUSB_INTPEND_VBUSREMOVED_NotPending (0x0UL) /*!< Read: Not pending                                                */
  #define VREGUSB_INTPEND_VBUSREMOVED_Pending (0x1UL) /*!< Read: Pending                                                       */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           VTIM                                           ================ */
/* =========================================================================================================================== */

/**
  * @brief VTIM CSR registers
  */


/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct WDT ======================================================== */
/**
  * @brief Watchdog Timer
  */
  typedef struct {                                   /*!< WDT Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start WDT                                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop WDT                                              */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_TIMEOUT;                   /*!< (@ 0x00000100) Watchdog timeout                                      */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) Watchdog stopped                                      */
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_TIMEOUT;                  /*!< (@ 0x00000180) Publish configuration for event TIMEOUT               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[6];
    __IOM uint32_t NMIENSET;                         /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t NMIENCLR;                         /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t RESERVED5[53];
    __IM uint32_t RUNSTATUS;                         /*!< (@ 0x00000400) Run status                                            */
    __IM uint32_t REQSTATUS;                         /*!< (@ 0x00000404) Request status                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t CRV;                              /*!< (@ 0x00000504) Counter reload value                                  */
    __IOM uint32_t RREN;                             /*!< (@ 0x00000508) Enable register for reload request registers          */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000050C) Configuration register                                */
    __IM uint32_t RESERVED7[4];
    __OM uint32_t TSEN;                              /*!< (@ 0x00000520) Task stop enable                                      */
    __IM uint32_t RESERVED8[55];
    __OM uint32_t RR[8];                             /*!< (@ 0x00000600) Reload request n                                      */
  } NRF_WDT_Type;                                    /*!< Size = 1568 (0x620)                                                  */

