NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_types.h
/* WICR_FIRMWARE_UMACINITPC: Boot address for UMAC processor (defaults to start of Wi-Fi core ROM_1) */
  #define WICR_FIRMWARE_UMACINITPC_ResetValue (0x28180000UL) /*!< Reset value of UMACINITPC register.                          */

/* INITPC @Bits 0..31 : UMAC boot vector */
  #define WICR_FIRMWARE_UMACINITPC_INITPC_Pos (0UL)  /*!< Position of INITPC field.                                            */
  #define WICR_FIRMWARE_UMACINITPC_INITPC_Msk (0xFFFFFFFFUL << WICR_FIRMWARE_UMACINITPC_INITPC_Pos) /*!< Bit mask of INITPC
                                                                            field.*/


/* WICR_FIRMWARE_LMACROMPATCHADDR: Address in MRAM for LMAC ROM patch */
  #define WICR_FIRMWARE_LMACROMPATCHADDR_ResetValue (0x00000000UL) /*!< Reset value of LMACROMPATCHADDR register.              */

/* Address @Bits 0..31 : LMAC ROM patch address */
  #define WICR_FIRMWARE_LMACROMPATCHADDR_Address_Pos (0UL) /*!< Position of Address field.                                     */
  #define WICR_FIRMWARE_LMACROMPATCHADDR_Address_Msk (0xFFFFFFFFUL << WICR_FIRMWARE_LMACROMPATCHADDR_Address_Pos) /*!< Bit mask
                                                                            of Address field.*/


/* WICR_FIRMWARE_UMACROMPATCHADDR: Address in MRAM for UMAC ROM patch */
  #define WICR_FIRMWARE_UMACROMPATCHADDR_ResetValue (0x00000000UL) /*!< Reset value of UMACROMPATCHADDR register.              */

/* Address @Bits 0..31 : UMAC ROM patch address */
  #define WICR_FIRMWARE_UMACROMPATCHADDR_Address_Pos (0UL) /*!< Position of Address field.                                     */
  #define WICR_FIRMWARE_UMACROMPATCHADDR_Address_Msk (0xFFFFFFFFUL << WICR_FIRMWARE_UMACROMPATCHADDR_Address_Pos) /*!< Bit mask
                                                                            of Address field.*/



/* ================================================== Struct WICR_IPCCONFIG ================================================== */
/**
  * @brief IPCCONFIG [WICR_IPCCONFIG] (unspecified)
  */
typedef struct {
  __IOM uint32_t * COMMANDMBOXADDR;                  /*!< (@ 0x00000000) Base address of command mailbox                       */
  __IOM uint32_t  COMMANDMBOXSIZE;                   /*!< (@ 0x00000004) Size of command mailbox in bytes                      */
  __IOM uint32_t * EVENTMBOXADDR;                    /*!< (@ 0x00000008) Base address of event mailbox                         */
  __IOM uint32_t  EVENTMBOXSIZE;                     /*!< (@ 0x0000000C) Size of event mailbox in bytes                        */
  __IOM uint32_t * SPAREMBOXADDR;                    /*!< (@ 0x00000010) Base address of spare mailbox                         */
  __IOM uint32_t  SPAREMBOXSIZE;                     /*!< (@ 0x00000014) Size of spare mailbox in bytes                        */
} NRF_WICR_IPCCONFIG_Type;                           /*!< Size = 24 (0x018)                                                    */

/* WICR_IPCCONFIG_COMMANDMBOXADDR: Base address of command mailbox */
  #define WICR_IPCCONFIG_COMMANDMBOXADDR_ResetValue (0x00000000UL) /*!< Reset value of COMMANDMBOXADDR register.               */

/* ADDRESS @Bits 0..31 : Base address of mailbox */
  #define WICR_IPCCONFIG_COMMANDMBOXADDR_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                     */
  #define WICR_IPCCONFIG_COMMANDMBOXADDR_ADDRESS_Msk (0xFFFFFFFFUL << WICR_IPCCONFIG_COMMANDMBOXADDR_ADDRESS_Pos) /*!< Bit mask
                                                                            of ADDRESS field.*/


/* WICR_IPCCONFIG_COMMANDMBOXSIZE: Size of command mailbox in bytes */
  #define WICR_IPCCONFIG_COMMANDMBOXSIZE_ResetValue (0x00000000UL) /*!< Reset value of COMMANDMBOXSIZE register.               */

/* SIZE @Bits 0..31 : Size in bytes */
  #define WICR_IPCCONFIG_COMMANDMBOXSIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                           */
  #define WICR_IPCCONFIG_COMMANDMBOXSIZE_SIZE_Msk (0xFFFFFFFFUL << WICR_IPCCONFIG_COMMANDMBOXSIZE_SIZE_Pos) /*!< Bit mask of
                                                                            SIZE field.*/


/* WICR_IPCCONFIG_EVENTMBOXADDR: Base address of event mailbox */
  #define WICR_IPCCONFIG_EVENTMBOXADDR_ResetValue (0x00000000UL) /*!< Reset value of EVENTMBOXADDR register.                   */

/* ADDRESS @Bits 0..31 : Base address of mailbox */
  #define WICR_IPCCONFIG_EVENTMBOXADDR_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define WICR_IPCCONFIG_EVENTMBOXADDR_ADDRESS_Msk (0xFFFFFFFFUL << WICR_IPCCONFIG_EVENTMBOXADDR_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* WICR_IPCCONFIG_EVENTMBOXSIZE: Size of event mailbox in bytes */
  #define WICR_IPCCONFIG_EVENTMBOXSIZE_ResetValue (0x00000000UL) /*!< Reset value of EVENTMBOXSIZE register.                   */

/* SIZE @Bits 0..31 : Size in bytes */
  #define WICR_IPCCONFIG_EVENTMBOXSIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                             */
  #define WICR_IPCCONFIG_EVENTMBOXSIZE_SIZE_Msk (0xFFFFFFFFUL << WICR_IPCCONFIG_EVENTMBOXSIZE_SIZE_Pos) /*!< Bit mask of SIZE
                                                                            field.*/


/* WICR_IPCCONFIG_SPAREMBOXADDR: Base address of spare mailbox */
  #define WICR_IPCCONFIG_SPAREMBOXADDR_ResetValue (0x00000000UL) /*!< Reset value of SPAREMBOXADDR register.                   */

/* ADDRESS @Bits 0..31 : Base address of mailbox */
  #define WICR_IPCCONFIG_SPAREMBOXADDR_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                       */
  #define WICR_IPCCONFIG_SPAREMBOXADDR_ADDRESS_Msk (0xFFFFFFFFUL << WICR_IPCCONFIG_SPAREMBOXADDR_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* WICR_IPCCONFIG_SPAREMBOXSIZE: Size of spare mailbox in bytes */
  #define WICR_IPCCONFIG_SPAREMBOXSIZE_ResetValue (0x00000000UL) /*!< Reset value of SPAREMBOXSIZE register.                   */

/* SIZE @Bits 0..31 : Size in bytes */
  #define WICR_IPCCONFIG_SPAREMBOXSIZE_SIZE_Pos (0UL) /*!< Position of SIZE field.                                             */
  #define WICR_IPCCONFIG_SPAREMBOXSIZE_SIZE_Msk (0xFFFFFFFFUL << WICR_IPCCONFIG_SPAREMBOXSIZE_SIZE_Pos) /*!< Bit mask of SIZE
                                                                            field.*/


/* ======================================================= Struct WICR ======================================================= */
/**
  * @brief Wi-Fi Information Configuration Registers
  */
  typedef struct {                                   /*!< WICR Structure                                                       */
    __IOM NRF_WICR_FIRMWARE_Type FIRMWARE;           /*!< (@ 0x00000000) (unspecified)                                         */
    __IM uint32_t RESERVED[28];
    __IOM NRF_WICR_IPCCONFIG_Type IPCCONFIG;         /*!< (@ 0x00000080) (unspecified)                                         */
    __IM uint32_t RESERVED1[26];
    __IOM uint32_t VTFDATA;                          /*!< (@ 0x00000100) Pointer to memory location containing VTF data from the
                                                                         VTF monitoring system*/
  } NRF_WICR_Type;                                   /*!< Size = 260 (0x104)                                                   */

/* WICR_VTFDATA: Pointer to memory location containing VTF data from the VTF monitoring system */
  #define WICR_VTFDATA_ResetValue (0xFFFFFFFFUL)     /*!< Reset value of VTFDATA register.                                     */

/* ADDRESS @Bits 0..31 : Address of the VTF monitoring data in RAM */
  #define WICR_VTFDATA_ADDRESS_Pos (0UL)             /*!< Position of ADDRESS field.                                           */
  #define WICR_VTFDATA_ADDRESS_Msk (0xFFFFFFFFUL << WICR_VTFDATA_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* ========================================== End of section using anonymous unions ========================================== */

#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif
#endif /* NRF7120E_TYPES_H */

